// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x2C25C0
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x2C25C0
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
class AmbientBiomeAudio
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    EventInstance mEventInstance; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    uint32_t mListenerMask; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    bool mInstanceEnabled; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float mPauseTimer; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    bool mPaused; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    Il2CppString* mParameterName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float mBlendValue; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float mPendingBlendValue; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    Vector3 mBlendDir; // 0x0038
    uint8_t pad_0039[0xB]; // 0x0039
    Vector3 mPendingBlendDir; // 0x0044
    uint8_t pad_0045[0xB]; // 0x0045
    float mBlendTimer; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float mBlendTimerMax; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    WorldText* mDebugText; // 0x0058

    // Methods
    void .ctor(ViewController* primaryViewController, Il2CppString* parameterName);  // RVA: 0x2C11E0
    void Initialise(ViewController* primaryViewController, Il2CppString* parameterName);  // RVA: 0x2C1090
    void EnableInstance(bool enable);  // RVA: 0x2C0C90
    void PauseInstance(bool pause);  // RVA: 0x2C1140
    void UpdatePause(float dt);  // RVA: 0x2C11A0
    void InitialiseDebugText(PlayerController* playerController);  // RVA: 0x2C0E90
    void Clear();  // RVA: 0x2C0BA0
    void ClearPendingBlendValue();  // RVA: 0x2C0B50
    void AddBlendValue(float blendValue, Vector3 blendDir);  // RVA: 0x2C0230
    void ApplyBlendValue(ViewController* primaryViewController, float blendSum, float dt, bool clear);  // RVA: 0x2C0280
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static System.Comparison<AmbientBiomeAudio> <>9__5_0;


    // Methods
    static void .cctor();  // RVA: 0x2D74A0
    void .ctor();  // RVA: 0x2C1750
    int32_t <Update>b__5_0(AmbientBiomeAudio* a, AmbientBiomeAudio* b);  // RVA: 0x2D7470
};

// Namespace: <global>
class AmbientAudioHelper
{
public:
    // Static fields
    // static int32_t cMaxBlendCount;

    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.Dictionary<System.String,AmbientBiomeAudio> mAmbientBiomeAudioMap; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.List<AmbientBiomeAudio> mAmbientBiomeAudioList; // 0x0018

    // Methods
    void Initialise();  // RVA: 0x2BF960
    void Clear();  // RVA: 0x2BF780
    void Update(float dt);  // RVA: 0x2BFB50
    void .ctor();  // RVA: 0x2C0160
};

// Namespace: <global>
class Animal : public PlaceableItem
{
public:
    uint8_t pad_0000[0xD0]; // 0x0000
    DynamicItemState* mDynamicState; // 0x00D0
    uint8_t pad_00D1[0x7]; // 0x00D1
    float mDefense; // 0x00D8
    uint8_t pad_00D9[0x3]; // 0x00D9
    float childSpawnTimer; // 0x00DC
    uint8_t pad_00DD[0x3]; // 0x00DD
    int8_t mPlayerIndex; // 0x00E0
    uint8_t pad_00E1[0x7]; // 0x00E1
    Pen* mPen; // 0x00E8
    uint8_t pad_00E9[0x7]; // 0x00E9
    AnimatedSpriteObject* mAnimStateObject; // 0x00F0
    uint8_t pad_00F1[0x7]; // 0x00F1
    AnimState* mAnimState; // 0x00F8
    uint8_t pad_00F9[0x7]; // 0x00F9
    Il2CppString* mIdleAnim; // 0x0100
    uint8_t pad_0101[0x7]; // 0x0101
    Il2CppString* mWalkAnim; // 0x0108
    uint8_t pad_0109[0x7]; // 0x0109
    Vector3 mDirection; // 0x0110
    uint8_t pad_0111[0xB]; // 0x0111
    Vector3 mRepulsion; // 0x011C
    uint8_t pad_011D[0xB]; // 0x011D
    BehaviourStateController* mBehaviourStateController; // 0x0128

    // Methods
    OnlineItemClassType get_OnlineClassType();  // RVA: 0x2C8910
    void Initialise(ItemDescriptor* descr, GameTile* _gameTile, int8_t levelId, Vector3 pos, ItemState placeState, ItemManager* mg, int8_t orientation, Params onlineParams, bool loading);  // RVA: 0x2C6310
    Il2CppString* GetAnimName(AnimType animType);  // RVA: 0x2C5EE0
    bool SetAnim(Il2CppString* animName, float animSpeed, AnimCompareType animCompareType);  // RVA: 0x2C7590
    void TransitionFrom(Item* previousItem, float newAge, bool instant);  // RVA: 0x2C7B20
    void SetOwnership(int8_t _playerIndex);  // RVA: 0x2C7620
    void OnAuthorityChanged(int8_t localClientIndex, int8_t oldClientIndex);  // RVA: 0x2C6AE0
    void Save(Stream* stream, bool rootObject, int32_t worldSerialisationFlags);  // RVA: 0x2C7440
    void Load(Stream* stream, int32_t version, ItemIndexTable* itemIndexTable, bool rootObject, int32_t worldSerialisationFlags, int32_t itemLoadFlags);  // RVA: 0x2C68A0
    void PostLoad(int32_t worldSerialisationFlags);  // RVA: 0x2C6FA0
    void Delete();  // RVA: 0x2C57C0
    void Destroy(bool despawned, int32_t sourcePlayerIndex);  // RVA: 0x2C5800
    static void SpawnChild(int8_t sourceClientIndex, AnimalSpawnChild msg);  // RVA: 0x2C7900
    static Item* SpawnChild(ItemDescriptor* itemDescr, ItemState state, int8_t levelId, Vector3 spawnPos, int8_t playerIndex, Params onlineParams);  // RVA: 0x2C7720
    bool IsValidChildSpawnTile(Level* level, int32_t col, int32_t row);  // RVA: 0x2C6810
    Vector3 GetChildSpawnDropPosition(PlaceableDescriptor* childDescriptor, ItemState itemState);  // RVA: 0x2C5F00
    void Age(float dt, bool instant);  // RVA: 0x2C4F50
    bool Update(float dt, bool postUpdateGameTile);  // RVA: 0x2C85C0
    void UpdateMove(float dt);  // RVA: 0x2C8170
    void UpdateRemote(float dt);  // RVA: 0x2C82A0
    void UpdateAnimEvents(Vector3 moveDir);  // RVA: 0x2C7D70
    void ApplyKnockback(Vector3 sourcePos, float knockback);  // RVA: 0x2C55B0
    bool ReceiveDamage(int8_t playerIndex, Vector3 sourcePos, float damage, float knockback, bool wouldKill);  // RVA: 0x2C70C0
    Vector3 CalculateRenderPosition(GameRendering* gameRendering);  // RVA: 0x2C55F0
    bool Render(GameRendering* gameRendering, float alpha, bool forceVisible, int32_t renderFlags, int32_t forceState);  // RVA: 0x2C7130
    bool CanDespawn(bool checkAuthority);  // RVA: 0x2C56C0
    bool UpdateDespawnTimer(bool despawn, Player* nearbyPlayer, float dt);  // RVA: 0x2C8160
    bool CanPlace(GameTile* _gameTile);  // RVA: 0x2C56F0
    Item* Place(Player* player, int8_t levelId, Vector3 worldPos, Params onlineParams, int8_t orientation);  // RVA: 0x2C6B40
    ItemState GetPlacementType();  // RVA: 0x2C6300
    void Unplace(ContainerItem* newParent);  // RVA: 0x2C7CB0
    static void Drop(int8_t sourceClientIndex, AnimalDrop msg);  // RVA: 0x2C5D50
    void Drop(Player* player, int8_t levelId, Vector3 worldPos, int8_t dropParent);  // RVA: 0x2C5930
    void DropImplementation(Player* player, GameTile* dropTile, Vector3 worldPos, int8_t dropParent, Vector3 dropVelocity);  // RVA: 0x2C58A0
    void SetDirection(Vector2 newDirection, bool sendOnline);  // RVA: 0x2C75C0
    Vector2 GetDirection();  // RVA: 0x2C62E0
    void .ctor();  // RVA: 0x2C87E0
};

// Namespace: <global>
class AttachmentTypeAngleOffset
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AttachmentType type; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float angle; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    float angleDeg; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class PivotPointDescriptor : public Descriptor
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Vector3 anchorPos; // 0x0020
    uint8_t pad_0021[0xB]; // 0x0021
    Vector3 offset; // 0x002C
    uint8_t pad_002D[0xB]; // 0x002D
    Vector3 anchorPosPPU; // 0x0038
    uint8_t pad_0039[0xB]; // 0x0039
    Vector3 offsetPPU; // 0x0044

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase);  // RVA: 0x2D7330
    void .ctor();  // RVA: 0x2D73A0
};

// Namespace: <global>
class AttachmentPointDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* name; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 anchorPos; // 0x0018
    uint8_t pad_0019[0xB]; // 0x0019
    Vector3 offset; // 0x0024
    uint8_t pad_0025[0xB]; // 0x0025
    Il2CppString* pivotPointName; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    PivotPointDescriptor* pivotPoint; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float uvFacing; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float angleStart; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    float angleEnd; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float angleStartDeg; // 0x004C
    uint8_t pad_004D[0x3]; // 0x004D
    float angleEndDeg; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    AttachmentTypeAngleOffset[][] attachmentTypeAngleOffsets; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    float depth; // 0x0060
    uint8_t pad_0061[0x3]; // 0x0061
    bool zWrite; // 0x0064
    uint8_t pad_0065[0x3]; // 0x0065
    Il2CppString* spriteName; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    int32_t facingIndex; // 0x0070
    uint8_t pad_0071[0x3]; // 0x0071
    Vector3 anchorPosPPU; // 0x0074
    uint8_t pad_0075[0xB]; // 0x0075
    Vector3 offsetPPU; // 0x0080
    uint8_t pad_0081[0xF]; // 0x0081
    SpriteDescriptor* spriteDescriptor; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    float defaultAttachmentTypeAngleOffset; // 0x0098

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, SpriteDescriptor* parentSpriteDescriptor, Vector3 parentOffset, PivotPointCollection* pivotPointCollection);  // RVA: 0x2CB250
    float GetAttachmentTypeAngleOffset(AttachmentType weaponType);  // RVA: 0x2CB090
    static PivotPointDescriptor* GetPrefixedPivotPoint(Il2CppString* prefix, PivotPointDescriptor* referenceDescr);  // RVA: 0x2CB120
    void .ctor();  // RVA: 0x2CB500
};

// Namespace: <global>
struct KeyFrameState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 offset; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    float alpha; // 0x001C
};

// Namespace: <global>
class AnimatedSubSpriteDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* spriteName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float uvFacing; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    Vector3 offset; // 0x001C
    uint8_t pad_001D[0xB]; // 0x001D
    float alpha; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float angleDeg; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float depth; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    bool zWrite; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    int32_t layerMax; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool applyColourTint; // 0x003C
    bool lerpNextKeyFrame; // 0x003D
    uint8_t pad_003E[0x2]; // 0x003E
    SpriteDescriptor* spriteDescriptor; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Vector3 offsetPPU; // 0x0048
    uint8_t pad_0049[0xB]; // 0x0049
    float angle; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    AnimatedSubSpriteDescriptor* nextSubSpriteKeyFrame; // 0x0058

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, AnimatedSubSpriteDescriptor* _nextSubSpriteKeyFrame);  // RVA: 0x2CAF40
    void .ctor();  // RVA: 0x2CB010
};

// Namespace: <global>
class AnimatedSpriteKeyFrameDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* spriteName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float duration; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float uvFacing; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    Vector3 offset; // 0x0020
    uint8_t pad_0021[0xB]; // 0x0021
    bool lerpNextKeyFrame; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    AttachmentPointDescriptor[][] attachmentPoints; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    AnimatedSubSpriteDescriptor[][] subSpriteDescriptors; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteDescriptor* spriteDescriptor; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Vector3 offsetPPU; // 0x0048
    uint8_t pad_0049[0xB]; // 0x0049
    float keyFrameStartTime; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float keyFrameEndTime; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    AnimatedSpriteKeyFrameDescriptor* nextKeyFrame; // 0x0060

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, PivotPointCollection* pivotPointCollection, float currentDuration, AnimatedSpriteKeyFrameDescriptor* _nextKeyFrame);  // RVA: 0x2C9010
    Vector3 GetLerpedOffset(float animTime);  // RVA: 0x2C8DA0
    float GetLerpValue(float animTime);  // RVA: 0x2C8D70
    KeyFrameState GetLerpedSubSprite(int32_t subSpriteIndex, float lerpVal, AnimatedSubSpriteDescriptor* subSpriteDescriptor);  // RVA: 0x2C8E70
    void .ctor();  // RVA: 0x2C9260
};

// Namespace: <global>
class AnimatedSpriteDescriptor : public Descriptor
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    AnimatedSpriteKeyFrameDescriptor[][] keyFrames; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float totalDuration; // 0x0028

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, PivotPointCollection* pivotPointCollection);  // RVA: 0x2C8C60
    AnimatedSpriteKeyFrameDescriptor* GetKeyFrame(float time);  // RVA: 0x2C8920
    AnimatedSpriteKeyFrameDescriptor* GetKeyFrame(float time, float frameTime);  // RVA: 0x2C8990
    SpriteDescriptor* GetSprite(float time, Vector2 facing);  // RVA: 0x2C8BE0
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
struct AnimType
{
public:
    // Static fields
    // static AnimType Idle;
    // static AnimType Walk;
    // static AnimType Run;
    // static AnimType Place;
    // static AnimType Aim;
    // static AnimType Water;
    // static AnimType Attack;
    // static AnimType PreAttack;
    // static AnimType PostAttack;
    // static AnimType Spawn;
    // static AnimType ChildSpawn;
    // static AnimType ChildIdle;
    // static AnimType ChildAttack;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct AnimCompareType
{
public:
    // Static fields
    // static AnimCompareType Default;
    // static AnimCompareType Force;
    // static AnimCompareType OneHigherPriorityOrLess;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct EventType
{
public:
    // Static fields
    // static EventType Audio;
    // static EventType Contact;
    // static EventType Effect;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class AnimEvent
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float time; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    EventType type; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    Il2CppString* name; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Vector3 position; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimFacingDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* animatedSpriteName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector2 minFacing; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Vector2 maxFacing; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float depth; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AnimatedSpriteDescriptor* animatedSpriteDescriptor; // 0x0030

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, AnimatedSpriteDatabase* animatedSpriteDatabase, Il2CppString* animatedSpritePrefix);  // RVA: 0x2C1760
    bool TestFacing(Vector2 facing);  // RVA: 0x2C19A0
    bool TestFacingValid(Vector2 facing);  // RVA: 0x2C1940
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* name; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* nextAnimName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t priority; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AnimFacingDescriptor[][] animFacings; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AnimEvent[][] events; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float duration; // 0x0038

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, AnimatedSpriteDatabase* animatedSpriteDatabase, Il2CppString* animSpritePrefix);  // RVA: 0x2C1430
    AnimFacingDescriptor* GetFacingDescriptor(Vector2 facing);  // RVA: 0x2C1390
    void GetAnimEvents(System.Collections.Generic.List<AnimEvent>& animEvents, float startTime, float endTime);  // RVA: 0x2C12A0
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimGroupDescriptor
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* name; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* referenceSpriteName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* referenceAnimSpritePrefix; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    bool renderReference; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AnimDescriptor[][] animDescriptors; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    SpriteDescriptor* referenceSpriteDescriptor; // 0x0038

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, AnimatedSpriteDatabase* animatedSpriteDatabase);  // RVA: 0x2C1AA0
    void Update(float dt, System.Collections.Generic.List<AnimEvent>& animEvents);  // RVA: 0x2C1B90
    AnimDescriptor* GetAnimDescriptor(Il2CppString* animName);  // RVA: 0x2C19E0
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimSetDescriptor : public Descriptor
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    AnimGroupDescriptor[][] animGroupDescriptors; // 0x0020

    // Methods
    void Initialise(SpriteDatabase* spriteDatabase, AnimatedSpriteDatabase* animatedSpriteDatabase);  // RVA: 0x2C25D0
    void Update(float dt, System.Collections.Generic.List<AnimEvent>& animEvents);  // RVA: 0x2C2740
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
class AnimGroupLookup
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* groupName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* animSpritePrefix; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* attachmentPointPrefix; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* offsetSpriteName; // 0x0028

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimGroupOverride
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.Dictionary<System.String,AnimatedSpriteDescriptor> prefixedSpriteDescriptors; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.Dictionary<System.String,PivotPointDescriptor> prefixedPivotPoints; // 0x0018

    // Methods
    void Initialise(ItemDatabase* itemDatabase, AnimGroupDescriptor* animGroupDescriptor, AnimGroupLookup* animGroupOverride);  // RVA: 0x2C1DE0
    AnimatedSpriteDescriptor* GetPrefixedSprite(Il2CppString* prefix, Il2CppString* suffix);  // RVA: 0x2C1CC0
    PivotPointDescriptor* GetPrefixedPivotPoint(Il2CppString* prefix, Il2CppString* suffix);  // RVA: 0x2C1BA0
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AnimLookupDescriptor : public Descriptor
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    Il2CppString* baseAnimationSetName; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AnimGroupLookup[][] animGroupLookups; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<AnimGroupOverride> animGroupOverrides; // 0x0030

    // Methods
    void CreateBaseLookup(Il2CppString* _name, Il2CppString* _animSetName);  // RVA: 0x2C2280
    void Initialise(ItemDatabase* itemDatabase);  // RVA: 0x2C22E0
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
class AnimSetSpriteRefOverride : public Descriptor
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    AnimLookupDescriptor* animLookupDescriptor; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AnimSetDescriptor* animSetDescriptor; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    SpriteDescriptor* refSpriteDescriptor; // 0x0030

    // Methods
    void .ctor(ItemDatabase* itemDatabase, Il2CppString* descriptorName);  // RVA: 0x2C27A0
};

// Namespace: <global>
struct AnimStateLayerParams
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector2 offsetUV; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t renderFlags; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    Color32 tintColour; // 0x001C

    // Methods
    void .ctor(Vector2 _offssetUV, int32_t _renderFlags, Color32 _tintColour);  // RVA: 0x2C4270
};

// Namespace: <global>
class AnimState : public IPoolable
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    float animTime; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float animSpeed; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    AnimDescriptor* currentAnimDescriptor; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AnimFacingDescriptor* currentFacingDescriptor; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AnimatedSpriteDescriptor* currentSpriteDescriptor; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    AnimatedSpriteKeyFrameDescriptor* currentKeyFrameDescriptor; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    Vector2 facing; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    bool facingLocked; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    Vector2 referenceUV; // 0x004C
    uint8_t pad_004D[0xB]; // 0x004D
    System.Collections.Generic.List<AnimState.AnimStateLayerParams> layerParams; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    AnimGroupOverride* animGroupOverride; // 0x0060

    // Methods
    void Initialise(AnimGroupDescriptor* animGroupDescriptor, AnimGroupOverride* _animGroupOverride);  // RVA: 0x2C4650
    static AnimatedSpriteDescriptor* GetPrefixedSprite(Il2CppString* prefix, Il2CppString* suffix);  // RVA: 0x2C4530
    AttachmentPointDescriptor* GetAttachmentPoint(Il2CppString* name, PivotPointDescriptor* pivotPointDescr);  // RVA: 0x2C42F0
    AnimatedSpriteDescriptor* GetCurrentSpriteDescriptor(AnimFacingDescriptor* facingDescriptor);  // RVA: 0x2C4490
    void UpdateReferenceSprite(SpriteDescriptor* referenceSpriteDescriptor);  // RVA: 0x2C4E50
    void SetSpriteLayerParams(Vector2 offset, int32_t renderFlags, Color32 colour, int32_t index);  // RVA: 0x2C4AB0
    void SetSpriteLayerParams(SpriteDescriptor* offsetSpriteDescriptor, int32_t renderFlags, Color32 colour, int32_t index, int32_t additionalReferenceIndex);  // RVA: 0x2C4C10
    void ClearSpriteLayer(int32_t index);  // RVA: 0x2C4280
    void SetFacing(Vector2 _facing, bool _facingLocked);  // RVA: 0x2C48D0
    void .ctor();  // RVA: 0x2C4E80
};

// Namespace: <global>
class AnimSetState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AnimSetDescriptor* mAnimSet; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.List<AnimState> mCurrentAnimStates; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    AnimState* lockedFacingState; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* lockedFacingName; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Il2CppString* mIdleAnim; // 0x0030

    // Methods
    void Initialise(AnimSetDescriptor* animSet, AnimLookupDescriptor* animLookup);  // RVA: 0x2C30C0
    bool HasAnimDescriptor(Il2CppString* animName);  // RVA: 0x2C2FF0
    bool SetAnim(Il2CppString* animName, float animSpeed, AnimCompareType animCompareType);  // RVA: 0x2C35E0
    void LockFacing(Vector2 facing, Il2CppString* lockingAnimName);  // RVA: 0x2C3450
    void UnlockFacing(bool testCurrentFacingAnims);  // RVA: 0x2C3790
    bool UpdateAnimGroup(float dt, System.Collections.Generic.List<AnimEvent>& animEvents, int32_t animGroupIndex);  // RVA: 0x2C3890
    bool Update(float dt, System.Collections.Generic.List<AnimEvent>& animEvents);  // RVA: 0x2C3F50
    void UpdateSpriteOffset(SpriteDatabase* spriteDatabase, Il2CppString* groupName, Il2CppString* offsetSpriteName);  // RVA: 0x2C3AE0
    void UpdateSpriteOffset(SpriteDatabase* spriteDatabase, SpriteDescriptor* offsetSpriteDescriptor);  // RVA: 0x2C3D20
    void UpdateSpriteOffsets(SpriteDatabase* spriteDatabase, AnimLookupDescriptor* animLookupDescriptor);  // RVA: 0x2C3E90
    AttachmentPointDescriptor* GetAttachmentPoint(Il2CppString* name, PivotPointDescriptor* pivotPointDescr);  // RVA: 0x2C2F30
    Vector3 GetAttachmentPointPos(SpritesRenderer* renderer, Vector3 objectPos, Il2CppString* name);  // RVA: 0x2C2C00
    float GetAttachmentPointAngle(Il2CppString* name);  // RVA: 0x2C2A20
    void .ctor();  // RVA: 0x2C41F0
};

// Namespace: <global>
class AnimatedSpriteObject : public SpriteObjectBase
{
public:
    uint8_t pad_0000[0x30]; // 0x0000
    Vector2 facing; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    AnimSetState* mAnimSetState; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    System.Collections.Generic.List<AnimEvent> mAnimEvents; // 0x0040

    // Methods
    void Initialise(AnimLookupDescriptor* animLookupdescriptor, AnimSetDescriptor* animSetDescriptor, SpriteDatabase* spriteDatabase, SpriteDescriptor* spriteRefOverride);  // RVA: 0x2C93F0
    bool SetAnim(Il2CppString* animName, float animSpeed, AnimCompareType animCompareType);  // RVA: 0x2C9A90
    bool Update(float dt);  // RVA: 0x2CADA0
    AnimState* GetAnimState(Il2CppString* groupName);  // RVA: 0x2C92D0
    void Render(GameRendering* gameRendering, Vector3 position, int32_t renderFlags);  // RVA: 0x2C9680
    void SortedRender(SpritesRenderer* renderer, float depth, bool flat, int32_t renderFlags, float emissiveFactor);  // RVA: 0x2CA400
    void SortedRenderUI(SpritesRenderer* renderer, Vector3 _position, Vector2 _facing, int32_t renderFlags);  // RVA: 0x2C9C30
    void .ctor();  // RVA: 0x2CAE20
};

// Namespace: <global>
struct MusicState
{
public:
    // Static fields
    // static MusicState Silence;
    // static MusicState Explore;
    // static MusicState FlutterBoss;
    // static MusicState CriticalError;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class MusicHelper
{
public:
    // Static fields
    // static float SILENCE_COOLDOWN;

    uint8_t pad_0000[0x10]; // 0x0000
    MusicState mMusicState; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    MusicState mPendingMusicState; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    float mSilenceStateCooldown; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float mMusicProximity; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float mMusicIntensity; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    bool mFirstPlay; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float mBiome; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.Dictionary<System.Single,System.Boolean> mBiomeMusicTriggered; // 0x0030

    // Methods
    void Initialise(float initialBiomeValue);  // RVA: 0x2D6D40
    void ResetMusicState();  // RVA: 0x2D6F40
    bool CombatMusicActive();  // RVA: 0x2D6D00
    void SetBiome(float biomeValue);  // RVA: 0x2D6F50
    void SetMusicState(MusicState newMusicState, bool maxStateOnly);  // RVA: 0x2D7110
    void SetMaxMusicProximity(float musicProximity);  // RVA: 0x2D70F0
    void AddMusicIntensity(float musicIntensity);  // RVA: 0x2D6C40
    float GetMusicIntensity();  // RVA: 0x2D6D30
    void Update(float dt);  // RVA: 0x2D7190
    void UpdateMusicState(float dt);  // RVA: 0x2D7120
    void ApplyMusicState(MusicState newMusicState);  // RVA: 0x2D6C50
    void .ctor();  // RVA: 0x2D72B0
};

// Namespace: <global>
struct AudioEventType
{
public:
    // Static fields
    // static AudioEventType NONE;
    // static AudioEventType ATTACK;
    // static AudioEventType IMPACT;
    // static AudioEventType CONTACT;
    // static AudioEventType DESTROY;
    // static AudioEventType NPC_IDLE;
    // static AudioEventType NPC_MOVEMENT;
    // static AudioEventType NPC_HURT;
    // static AudioEventType NPC_DEATH;
    // static AudioEventType NPC_ALERT;
    // static AudioEventType NPC_ATTACK;
    // static AudioEventType PLAYER_MOVEMENT;
    // static AudioEventType PLAYER_HURT;
    // static AudioEventType PLAYER_DEATH;
    // static AudioEventType PROJECTILE_FLY;
    // static AudioEventType PLACE;
    // static AudioEventType CUSTOM;
    // static AudioEventType GLOBAL;
    // static AudioEventType OPEN;
    // static AudioEventType CLOSE;
    // static AudioEventType COLLECT;
    // static AudioEventType WATER;
    // static AudioEventType CONSUME;
    // static AudioEventType TELEPORT_IN;
    // static AudioEventType TELEPORT_OUT;
    // static AudioEventType WAYSHRINE_ACTIVATE;
    // static AudioEventType PLAYER_RESPAWN;
    // static AudioEventType PLAYER_SLEEP;
    // static AudioEventType STAIRS_DOWN;
    // static AudioEventType STAIRS_UP;
    // static AudioEventType NPC_MOVEMENT_LOOPING;
    // static AudioEventType MAX;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct AudioMovementType
{
public:
    // Static fields
    // static AudioMovementType NORMAL;
    // static AudioMovementType LOOPING;
    // static AudioMovementType NONE;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class AudioPathLookup
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* eventName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventPath; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
struct AudioParamType
{
public:
    // Static fields
    // static AudioParamType NONE;
    // static AudioParamType BIOME;
    // static AudioParamType SURFACE;
    // static AudioParamType WEAPON_TYPE;
    // static AudioParamType MATERIAL_TYPE;
    // static AudioParamType PROJECTILE_TYPE;
    // static AudioParamType NPC_TYPE;
    // static AudioParamType SEED_TYPE;
    // static AudioParamType ANIMAL_TYPE;
    // static AudioParamType CUSTOM;
    // static AudioParamType GLOBAL;
    // static AudioParamType CONSUME_TYPE;
    // static AudioParamType CONSUME_EFFECT;
    // static AudioParamType ELEMENT_TYPE;
    // static AudioParamType SOURCE_MATERIAL_TYPE;
    // static AudioParamType ARMOUR_MATERIAL_TYPE;
    // static AudioParamType MAX;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct AudioParamSource
{
public:
    // Static fields
    // static AudioParamSource PRIMARY;
    // static AudioParamSource SECONDARY;
    // static AudioParamSource TARGET;
    // static AudioParamSource MAX;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class AudioParameter
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioParamType type; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* name; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* label; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AudioParamSource source; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float value; // 0x002C

    // Methods
    void .ctor();  // RVA: 0x2C1750
    void .ctor(AudioParamType _type, AudioParamSource _source, Il2CppString* _name, Il2CppString* _label, float _value);  // RVA: 0x2D5A80
    void UpdateData(AudioParamType _type, AudioParamSource _source, Il2CppString* _name, Il2CppString* _label, float _value);  // RVA: 0x2D59F0
    void UpdateOverrideData(AudioLabel* _label);  // RVA: 0x2D5A40
};

// Namespace: <global>
class AudioEventData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioEventType eventType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.List<AudioParameter> audioParameters; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<System.Collections.Generic.Dictionary<System.String,AudioParameter>> audioSourceParameterMaps; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    int32_t audioParameterCount; // 0x0030

    // Methods
    void Initialise();  // RVA: 0x2CBEF0
    void AddAudioParameterDefault(AudioParamDefault* paramDefault);  // RVA: 0x2CBB00
    void AddAudioParameterDefault(AudioLabel* audioLabel, AudioParamSource sourceType);  // RVA: 0x2CBC50
    AudioParameter* GetAudioParameter(Il2CppString* paramName, AudioParamSource sourceType);  // RVA: 0x2CBE50
    void Clear();  // RVA: 0x2CBDA0
    void .ctor();  // RVA: 0x2CC0F0
};

// Namespace: <global>
class AudioLabel
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* label; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* parameter; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    float value; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    AudioParamType paramType; // 0x0024

    // Methods
    void .ctor();  // RVA: 0x2CCCC0
    void .ctor(Il2CppString* _label, Il2CppString* _parameter, float _value);  // RVA: 0x2CCCE0
    void Initialise(AudioParamType paramType, float defaultValue);  // RVA: 0x2CCB00
};

// Namespace: <global>
class AudioEventDetails
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioEventType eventType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventNameOverride; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    AudioParamSource eventParamSource; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* eventName; // 0x0028

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AudioEventOverride
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioEventDetails* eventData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.List<AudioParameter> paramOverrides; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.List<AudioLabel> paramOverrideList; // 0x0020

    // Methods
    void Initialise(System.Collections.Generic.List<AudioParameter> generalParamOverrides);  // RVA: 0x2CC340
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
struct RangeFloat
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float min; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float max; // 0x0014

    // Methods
    void .ctor(float _min, float _max);  // RVA: 0x2D7460
    bool Evaluate(float value);  // RVA: 0x2D7430
};

// Namespace: <global>
class AudioEventDataOverride
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<AudioParameter> paramOverrides; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.List<AudioLabel> paramOverrideList; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.List<AudioEventOverride> eventOverrides; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.List<System.Collections.Generic.Dictionary<AudioEventType,AudioEventOverride>> eventOverrideMaps; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AudioMovementType audioMovementType; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    RangeFloat idleTimeRange; // 0x0034

    // Methods
    void Initialise();  // RVA: 0x2CB980
    void InitialiseParamOverrides();  // RVA: 0x2CB910
    void InitialiseEventOverrides();  // RVA: 0x2CB5A0
    void .ctor();  // RVA: 0x2CBA80
};

// Namespace: <global>
class AudioParameterTable
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioParamType parameterType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* mParameterName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.Dictionary<System.String,AudioLabel> mLookupTable; // 0x0020

    // Methods
    void .ctor(AudioParamType _parameterType, Il2CppString* _parameterName);  // RVA: 0x2CCAC0
    void PopulateTable(Il2CppString* parameterName);  // RVA: 0x2D5710
    void PopulateTable(Il2CppString* parameterName, Il2CppString* eventName);  // RVA: 0x2D5460
    void AddAudioLabelLookup(Il2CppString* label, Il2CppString* parameterName, int32_t value);  // RVA: 0x2D5210
    Il2CppString* GetLabelFromValue(int32_t value);  // RVA: 0x2D52E0
};

// Namespace: <global>
class AudioParameterLookup
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioParamType parameterType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* parameterName; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AudioParameterTable* lookupTable; // 0x0028

    // Methods
    void .ctor(AudioParamType _parameterType, Il2CppString* _parameterName, Il2CppString* _eventName);  // RVA: 0x2D51B0
    void Initialise();  // RVA: 0x2D50F0
};

// Namespace: <global>
class AudioParamLookup
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioParamType paramType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* paramName; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AudioParamDefault
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioParamSource sourceType; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    AudioParamType paramType; // 0x0014
    uint8_t pad_0015[0x3]; // 0x0015
    Il2CppString* paramLabel; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* paramName; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    AudioLabel* audioLabel; // 0x0028

    // Methods
    void Initialise(Il2CppString* eventName);  // RVA: 0x2D4F00
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AudioEventLookup
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioEventType eventType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.List<AudioParamDefault> parameterDefaults; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    System.Collections.Generic.Dictionary<System.String,AudioParamDefault> parameterDefaultsMap; // 0x0028

    // Methods
    void Initialise();  // RVA: 0x2CC1C0
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AudioEventParameterMap
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    AudioEventType eventType; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* eventName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.Dictionary<System.String,AudioParameterTable> parameterNameMap; // 0x0020

    // Methods
    void .ctor(AudioEventType _eventType, Il2CppString* _eventName);  // RVA: 0x2CCAC0
    void Initialise();  // RVA: 0x2CC490
    float GetParameterValue(Il2CppString* parameterName, Il2CppString* parameterLabel, float defaultValue);  // RVA: 0x2CC3C0
    void PopulateGlobalParams();  // RVA: 0x2CC920
    void PopulateEventParams();  // RVA: 0x2CC660
};

// Namespace: <global>
class AudioTriggerCooldown
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t mLookup; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float mCooldown; // 0x0014

    // Methods
    void Initialise(int32_t lookup);  // RVA: 0x2D5AF0
    bool Update(float dt);  // RVA: 0x2D5B00
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
class AudioManager : public MonoBehaviour
{
public:
    // Static fields
    // static float PARAM_NONE;
    // static float PARAM_UNINITIALISED;
    // static AudioManager* instance;
    // static StringBuilder* bankPathStringBuilder;
    // static AudioEventData* sEventData;
    // static System.Collections.Generic.List<AudioParameterLookup> sAudioParameterLookupTables;

    uint8_t pad_0000[0x20]; // 0x0000
    StudioEventEmitter* mMusicEmitter; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    StudioEventEmitter* mAmbienceEmitter; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    AudioNPCHelper* mAudioNPCHelper; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    AmbientAudioHelper* mAmbientAudioHelper; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    MusicHelper* mMusicHelper; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    System.Collections.Generic.List<System.String> mBuiltInBanks; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    System.Collections.Generic.List<AudioPathLookup> mAudioEventPaths; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    System.Collections.Generic.List<AudioParamLookup> mParamDefinitions; // 0x0058
    uint8_t pad_0059[0x7]; // 0x0059
    System.Collections.Generic.List<AudioEventLookup> mDefaultAudioEventMap; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    System.Collections.Generic.Dictionary<System.String,AudioEventParameterMap> mEventParameterMaps; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    System.Collections.Generic.List<AudioEventParameterMap> mEventParameterList; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    System.Collections.Generic.List<AudioEventLookup> mDefaultAudioEventList; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    System.Collections.Generic.Dictionary<System.String,System.String> mAudioEventPathMap; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    System.Collections.Generic.Dictionary<System.Int32,AudioTriggerCooldown> mAudioTriggerCooldowns; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    SimplePool<AudioTriggerCooldown> mAudioTriggerCooldownPool; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    System.Collections.Generic.List<AudioTriggerCooldown> mPendingAudioTriggerCooldownDeletes; // 0x0098

    // Methods
    void Initialise(Il2CppString* modPath);  // RVA: 0x2CDCE0
    void InitialiseEventParameterMaps();  // RVA: 0x2CDA70
    void InitialiseAudioEventPathMap();  // RVA: 0x2CD960
    void Clear();  // RVA: 0x2CCDE0
    void PostCreateWorld(float initialBiomeValue);  // RVA: 0x2D0CF0
    void LogEventParameterMaps();  // RVA: 0x2CECF0
    bool ToggleMusic();  // RVA: 0x2D0F80
    void ResetMusicState();  // RVA: 0x2D0E30
    void SetMusicState(MusicState newMusicState);  // RVA: 0x2D0F20
    void SetMaxMusicProximity(float musicProximity);  // RVA: 0x2D0EF0
    void AddMusicIntensity(float musicIntensity);  // RVA: 0x2CCDB0
    float GetMusicIntensity();  // RVA: 0x2CD870
    void SetBiome(float biomeValue);  // RVA: 0x2D0E60
    void UpdateAudio(float dt, bool running);  // RVA: 0x2D3D10
    void UpdateAudioTriggerCooldowns(float dt);  // RVA: 0x2D3A60
    bool ProcessAudioTriggerCooldown(int32_t playerIndex, AudioEventType eventType);  // RVA: 0x2D0D50
    AudioEventParameterMap* GetEventParamaterMap(AudioEventType eventType, Il2CppString* eventName, bool createNew);  // RVA: 0x2CD420
    Il2CppString* GetAudioEventPath(Il2CppString* eventName);  // RVA: 0x2CCEA0
    float GetEventParameterValue(Il2CppString* eventName, Il2CppString* paramName, Il2CppString* paramLabel);  // RVA: 0x2CD750
    bool PopulateEventData(AudioEventType eventType, AudioEventDataOverride* primaryOverrides, AudioEventDataOverride* targetOverrides);  // RVA: 0x2D0060
    bool PopulateEventData(AudioEventType eventType, AudioEventDataOverride* primaryOverrides, AudioEventDataOverride* targetOverrides, AudioEventDataOverride* targetArmourOverrides);  // RVA: 0x2CFF20
    void PopulateDefaultEventData(AudioEventType eventType);  // RVA: 0x2CF9F0
    void OverrideDefaultEventData(AudioEventType eventType, AudioEventDataOverride* eventDataOverrides, AudioParamSource sourceType);  // RVA: 0x2CF820
    void OverrideDefaultEventData(System.Collections.Generic.List<AudioLabel> eventParamOverrides, AudioParamSource sourceType);  // RVA: 0x2CF630
    void PopulateEventDataValues();  // RVA: 0x2CFD70
    void LoadBanks(Il2CppString* modPath);  // RVA: 0x2CEB90
    void LoadBank(Il2CppString* bankName, Il2CppString* modPath, bool loadStringsFile);  // RVA: 0x2CE570
    AudioEventType GetAudioEventType(Il2CppString* eventName);  // RVA: 0x2CCF20
    AudioParamType GetAudioParamType(Il2CppString* paramName);  // RVA: 0x2CD170
    Il2CppString* GetParamName(AudioParamType parameterType);  // RVA: 0x2CD890
    AudioParamLookup* GetAudioParamLookup(AudioParamType parameterType);  // RVA: 0x2CD0C0
    AudioLabel* GetAudioLabel(AudioParamType parameterType, Il2CppString* label);  // RVA: 0x2CCFF0
    void PopulateParamOverrides(System.Collections.Generic.List<AudioParameter> paramOverrides, System.Collections.Generic.List<AudioLabel>& paramLabelOverrides);  // RVA: 0x2D0AB0
    AudioParameter* GetAudioParameterOverride(System.Collections.Generic.List<AudioParameter> paramOverrides, AudioParamType paramType);  // RVA: 0x2CD2A0
    void PopulateEventOverrideData(AudioEventOverride* audioEventOverride, System.Collections.Generic.List<AudioParameter> fallbackParamOverrides);  // RVA: 0x2D0170
    AudioEventLookup* GetDefaultAudioEventLookup(AudioEventType eventType);  // RVA: 0x2CD3C0
    static void TriggerAudio(int8_t sourceClientIndex, TriggerAudio msg);  // RVA: 0x2D1420
    static void TriggerOneShotAudioOnline(AudioEventType eventType, Vector3 eventPosition, int32_t level);  // RVA: 0x2D22B0
    static void Trigger2DAudio(Il2CppString* eventName, Il2CppString* parameterName, float parameterValue);  // RVA: 0x2D1000
    static void TriggerOneShotAudio(Il2CppString* eventName, Vector3 eventPosition, int32_t level, Il2CppString* parameterName, float parameterValue, LogLevel logLevel);  // RVA: 0x2D3630
    static void TriggerOneShotAudio(AudioEventType eventType, Vector3 eventPosition, int32_t level, AudioEventDataOverride* primaryOverrides, AudioEventDataOverride* targetOverrides, Il2CppString* parameterName, float parameterValue, LogLevel logLevel, int8_t playerTriggerCooldown);  // RVA: 0x2D2D60
    static void TriggerOneShotAudio(AudioEventType eventType, Vector3 eventPosition, int32_t level, AudioEventDataOverride* primaryOverrides, AudioEventDataOverride* targetOverrides, AudioEventDataOverride* targetArmourOverrides, LogLevel logLevel, int8_t playerTriggerCooldown);  // RVA: 0x2D24A0
    static bool TriggerInstancedAudio(EventInstance eventInstance, Il2CppString* eventName, Vector3 eventPosition, int32_t level, Il2CppString* parameterName, float parameterValue, Il2CppString* parameterName2, float parameterValue2);  // RVA: 0x2D1560
    static bool TriggerInstancedAudio(EventInstance eventInstance, AudioEventType eventType, Vector3 eventPosition, int32_t level, AudioEventDataOverride* primaryOverrides, AudioEventDataOverride* targetOverrides, Il2CppString* parameterName, float parameterValue, LogLevel logLevel);  // RVA: 0x2D1AB0
    static void UpdateInstancedAudio(EventInstance eventInstance, Vector3 eventPosition, int32_t level);  // RVA: 0x2D3E90
    static void StopInstancedAudio(EventInstance eventInstance, STOP_MODE stopMode);  // RVA: 0x2D0F40
    static bool IsPlaying(EventInstance eventInstance);  // RVA: 0x2CE530
    static float GetBusVolume(Il2CppString* busID);  // RVA: 0x2CD350
    static void SetBusVolume(Il2CppString* busID, float volume);  // RVA: 0x2D0E80
    void .ctor();  // RVA: 0x2D4390
    static void .cctor();  // RVA: 0x2D3F70
};

// Namespace: <global>
class AudioNPCHelper
{
public:
    // Static fields
    // static float minTriggerTime;
    // static float maxTriggerTime;

    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* mEventName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float mTriggerTimer; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    System.Collections.Generic.List<Item> mTriggerItems; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    NPC* mNPC; // 0x0028

    // Methods
    void Initialise();  // RVA: 0x2D4760
    void Clear();  // RVA: 0x2D46F0
    void Update(float dt);  // RVA: 0x2D4AB0
    void .ctor();  // RVA: 0x2D4E50
};

// Namespace: <global>
struct BehaviourType
{
public:
    // Static fields
    // static BehaviourType NoChange;
    // static BehaviourType SimpleIdle;
    // static BehaviourType FollowPlayer;
    // static BehaviourType Retreat;
    // static BehaviourType Charge;
    // static BehaviourType PendingDespawn;
    // static BehaviourType Max;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class BehaviourState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    BehaviourStateController* mBehaviourStateController; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Item* mItem; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t mBehaviourTypeState; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float mTimer; // 0x0024

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2D6BD0
    void Reset();  // RVA: 0x2D6C10
    void Update(float dt);  // RVA: 0x2D6C20
    void UpdateMusicIntensity(bool forceIfNoTarget);  // RVA: 0x2C1B90
    void EvaluateNearbyTargets(float dt);  // RVA: 0x2C1B90
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2BF6A0
    Vector3 CalculateMoveVector(float dt, float moveDist, float moveModifier, Vector3 moveDir, Vector2 facing);  // RVA: 0x2D5B30
    float GetModifiedFollowDistance(float distance, Player* player);  // RVA: 0x2D6AD0
    Player* FindClosestPlayer(float maxDistance, int32_t maxLadderDistance, Item* existingTarget, float closestPlayerDistance, Vector3 closestPlayerPosition);  // RVA: 0x2D6780
    GameTile* CalculateTargetPath(Vector3 desiredDir, Vector2Int pathSource, int32_t targetMinDistance, int32_t targetMaxDistance, float targetMaxCost, float maxAngleRange);  // RVA: 0x2D6100
    GameTile* CalculateTargetRetreatPath(Vector3 desiredDir, Vector2Int pathSource, int32_t targetMinDistance, float targetMaxCost, float maxAngleRange);  // RVA: 0x2D6530
    Vector3 CalculateTargetPathDirection(float moveDist, int32_t targetMinDistance, float targetMaxCost, GameTile* pathTargetTile);  // RVA: 0x2D5B70
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
struct SimpleIdleBehaviourType
{
public:
    // Static fields
    // static SimpleIdleBehaviourType Idle;
    // static SimpleIdleBehaviourType RandomWalk;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class SimpleIdleBehaviourState : public BehaviourState
{
public:
    uint8_t pad_0000[0x28]; // 0x0000
    Vector2 mDestDir; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    GameTile* mAnchorTile; // 0x0030

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2F0A20
    void Reset();  // RVA: 0x2F0A70
    void SetIdle();  // RVA: 0x2F0B10
    void SetRandom();  // RVA: 0x2F0B60
    void Update(float dt);  // RVA: 0x2F0D10
    void EvaluateNearbyTargets(float dt);  // RVA: 0x2F0960
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2F08F0
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
struct ComplexIdleBehaviourType
{
public:
    // Static fields
    // static ComplexIdleBehaviourType Idle;
    // static ComplexIdleBehaviourType RandomWalk;
    // static ComplexIdleBehaviourType RandomWalkSimple;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class ComplexIdleBehaviourState : public BehaviourState
{
public:
    uint8_t pad_0000[0x28]; // 0x0000
    GameTile* mTargetTile; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    GameTile* mAnchorTile; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Vector2 mDestDir; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float mRetargetTimer; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float mBlockedTimer; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Vector2 mBlockedPos; // 0x0048

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2E2010
    void Reset();  // RVA: 0x2E2080
    void SetIdle();  // RVA: 0x2E2160
    void AutoUpdateAnchorTile();  // RVA: 0x2E1940
    void SetWalk();  // RVA: 0x2E2620
    void SetRandom();  // RVA: 0x2E21D0
    void Update(float dt);  // RVA: 0x2E2A40
    void EvaluateBlockedMovement(float dt);  // RVA: 0x2E1D70
    void EvaluateNearbyTargets(float dt);  // RVA: 0x2E1ED0
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2E1A60
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
struct FollowPlayerBehaviourType
{
public:
    // Static fields
    // static FollowPlayerBehaviourType FollowPlayer;
    // static FollowPlayerBehaviourType PendingIgnore;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class FollowPlayerBehaviourState : public BehaviourState
{
public:
    uint8_t pad_0000[0x28]; // 0x0000
    float mCurrentTargetDistance; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    Vector3 mCurrentTargetPosition; // 0x002C
    uint8_t pad_002D[0xB]; // 0x002D
    GameTile* mTargetTile; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float mLosMoveModifier; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float mDistRetreatOffset; // 0x0044

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2EEFB0
    void UpdateMusicIntensity(bool forceIfNoTarget);  // RVA: 0x2EF020
    void Reset();  // RVA: 0x2EEFE0
    void Update(float dt);  // RVA: 0x2EF4C0
    bool HasLOS(PlaceableItem* target, float maxLosDist);  // RVA: 0x2EEF00
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2EE860
    Vector3 CalculateMoveVector(float dt, float moveDist, float moveModifier, Vector3 moveDir, Vector2 facing);  // RVA: 0x2EE320
    void EvaluateNearbyTargets(float dt);  // RVA: 0x2EECE0
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
class ChargeBehaviourState : public BehaviourState
{
public:
    uint8_t pad_0000[0x28]; // 0x0000
    Vector2 mTargetDir; // 0x0028

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2DF550
    void UpdateMusicIntensity(bool forceIfNoTarget);  // RVA: 0x2DF5A0
    void Reset();  // RVA: 0x2DF560
    void SetCharge(Vector2 targetDir);  // RVA: 0x2DF570
    void Update(float dt);  // RVA: 0x2DF780
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2DF530
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
struct RetreatBehaviourType
{
public:
    // Static fields
    // static RetreatBehaviourType PendingRetreat;
    // static RetreatBehaviourType Retreat;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class RetreatBehaviourState : public BehaviourState
{
public:
    uint8_t pad_0000[0x28]; // 0x0000
    GameTile* mTargetTile; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector3 mRetreatDir; // 0x0030

    // Methods
    void Initialise(Item* item, BehaviourStateController* behaviourStateController);  // RVA: 0x2F0530
    void Reset();  // RVA: 0x2F0580
    void Update(float dt);  // RVA: 0x2F05B0
    Vector3 CalculateTargetPathDirection(float moveDist, float moveModifier);  // RVA: 0x2F0180
    void EvaluateNearbyTargets(float dt);  // RVA: 0x2F0340
    void .ctor();  // RVA: 0x2C25C0
};

// Namespace: <global>
class BehaviourStateController
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    System.Collections.Generic.List<GameTile> pathList; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Item* mItem; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    MovementBehaviourDescriptor* mBehaviourParams; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    BehaviourType mCurrentBehaviourType; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    System.Collections.Generic.List<BehaviourState> mBehaviours; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float mTime; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    bool mFleeing; // 0x003C
    bool mInitialised; // 0x003D
    uint8_t pad_003E[0x2]; // 0x003E
    Player* mPendingFollowTarget; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Player* mFollowTarget; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Player* mRetreatTarget; // 0x0050

    // Methods
    void .ctor();  // RVA: 0x2DA150
    void Reset();  // RVA: 0x2D90D0
    void Initialise(Item* item, MovementBehaviourDescriptor* _behaviourParams);  // RVA: 0x2D8BB0
    void SetAnchor(GameTile* anchorTile);  // RVA: 0x2D9190
    GameTile* GetAnchor();  // RVA: 0x2D89C0
    bool SetFollowTarget(Player* player, bool sendOnline);  // RVA: 0x2D96F0
    Player* GetFollowTarget();  // RVA: 0x2D8A70
    BehaviourState* SetState(BehaviourType behaviourType);  // RVA: 0x2D9BD0
    void Update(float dt);  // RVA: 0x2DA080
    Vector3 CalculateMoveDirection(float dt, float moveDist, float moveModifier, Vector2 facing);  // RVA: 0x2D87F0
    void SetIdle(bool startMoving);  // RVA: 0x2D9A90
    void SetPendingFollowPlayer(Player* player);  // RVA: 0x2D9B70
    void SetFollowPlayer(Player* player, bool testCanChange, bool isLoading);  // RVA: 0x2D9350
    void SetCharge(Vector2 targetDir);  // RVA: 0x2D92A0
    void SetRetreat(Player* player, bool flee);  // RVA: 0x2D9B80
    void SetPendingDespawn();  // RVA: 0x2D9B60
    void OnPlayerRemoved(Player* player);  // RVA: 0x2D8EE0
    void OnPlayerDeath(Player* player);  // RVA: 0x2D8DE0
    void ReceivePlayerDamage(int8_t playerIndex);  // RVA: 0x2D9050
    void UpdateMusicIntensity(bool forceIfNoTarget);  // RVA: 0x2D9CD0
    bool HasPathToPlayer(Player* player);  // RVA: 0x2D8A80
    void UpdatePathsToLocalPlayers();  // RVA: 0x2D9D60
};

// Namespace: <global>
class BehaviourManager : public MonoBehaviour
{
public:
    // Static fields
    // static int32_t sPendingRetreatProcessedCount;

    uint8_t pad_0000[0x20]; // 0x0000
    BehaviourDatabase* mBehaviourDatabase; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    WorldManager* mWorld; // 0x0028

    // Methods
    void Initialise(WorldManager* world);  // RVA: 0x2D7DF0
    void FixedUpdate();  // RVA: 0x2D7CA0
    void InitialiseBehaviour(Item* item, BehaviourStateController* state, Il2CppString* behaviourName);  // RVA: 0x2D7CE0
    void SetBehaviour(Item* item, BehaviourStateController* state, Il2CppString* behaviourName);  // RVA: 0x2D7E70
    float UpdateBehaviourState(BehaviourStateController* state, float dt, bool forceIfNoTarget);  // RVA: 0x2D7EC0
    Vector3 UpdateBehaviourState(float moveModifier, Item* item, BehaviourStateController* state, float moveDist, float dt, bool updateState, Vector2 facing);  // RVA: 0x2D7FB0
    void .ctor();  // RVA: 0x2D82C0
};

// Namespace: <global>
class BehaviourPhaseController
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Boss* mBoss; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float mCurrentPhaseTime; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BehaviourPhaseDescriptor* mCurrentPhase; // 0x0020

    // Methods
    void Initialise(Boss* boss, Il2CppString* initialPhaseName);  // RVA: 0x2D82D0
    void RefreshBehaviour();  // RVA: 0x2D8530
    void SetPhase(int32_t phaseId);  // RVA: 0x2D86B0
    void UpdatePhaseRemote(float dt);  // RVA: 0x2D8760
    bool UpdatePhase(float dt, bool canSwitchPhase);  // RVA: 0x2D8770
    void Save(Stream* stream);  // RVA: 0x2D85D0
    void Load(Stream* stream, int32_t version);  // RVA: 0x2D8380
    void .ctor();  // RVA: 0x2C1750
};

// Namespace: <global>
struct BossEffect
{
public:
