// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class f`2
{
public:
    a pes; // 0x0000
    b pet; // 0x0000

    // Methods
    a bvq();  // RVA: 0x3506D0
    int32_t GetHashCode();  // RVA: 0x276B00
    bool nca(Il2CppObject* value);  // RVA: 0x274FA0
    bool Equals(Il2CppObject* value);  // RVA: 0x274FA0
    Il2CppString* iic();  // RVA: 0x26EAF0
    b bvr();  // RVA: 0x3506D0
    void .ctor(a a, b b);  // RVA: 0x3506D0
    Il2CppString* bnp();  // RVA: 0x26EAF0
    bool ikb(Il2CppObject* value);  // RVA: 0x274FA0
    int32_t cyz();  // RVA: 0x276B00
    Il2CppString* bez();  // RVA: 0x26EAF0
    int32_t nzq();  // RVA: 0x276B00
    Il2CppString* ToString();  // RVA: 0x26EAF0
    Il2CppString* jxv();  // RVA: 0x26EAF0
};

// Namespace: <global>
class k`2
{
public:
    a peu; // 0x0000
    b pev; // 0x0000

    // Methods
    int32_t xl();  // RVA: 0x276B00
    Il2CppString* icr();  // RVA: 0x26EAF0
    Il2CppString* hzi();  // RVA: 0x26EAF0
    void .ctor(a a, b b);  // RVA: 0x3506D0
    int32_t bpr();  // RVA: 0x276B00
    bool nzw(Il2CppObject* value);  // RVA: 0x274FA0
    a bvs();  // RVA: 0x3506D0
    bool uq(Il2CppObject* value);  // RVA: 0x274FA0
    Il2CppString* lyw();  // RVA: 0x26EAF0
    int32_t cad();  // RVA: 0x276B00
    b bvt();  // RVA: 0x3506D0
    Il2CppString* lym();  // RVA: 0x26EAF0
    bool Equals(Il2CppObject* value);  // RVA: 0x274FA0
    int32_t nrt();  // RVA: 0x276B00
    int32_t GetHashCode();  // RVA: 0x276B00
    Il2CppString* ToString();  // RVA: 0x26EAF0
    bool ggp(Il2CppObject* value);  // RVA: 0x274FA0
};

namespace Microsoft.CodeAnalysis
{

    // Namespace: Microsoft.CodeAnalysis
    class EmbeddedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x485B30
    };

} // namespace Microsoft.CodeAnalysis

namespace System.Runtime.CompilerServices
{

    // Namespace: System.Runtime.CompilerServices
    class IsUnmanagedAttribute : public Attribute
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x485B30
    };

    // Namespace: System.Runtime.CompilerServices
    class NullableAttribute : public Attribute
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Byte[][] NullableFlags; // 0x0010
    
        // Methods
        void .ctor(uint8_t param0);  // RVA: 0x485DB0
        void .ctor(Byte[][] param0);  // RVA: 0x485E30
    };

    // Namespace: System.Runtime.CompilerServices
    class NullableContextAttribute : public Attribute
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t Flag; // 0x0010
    
        // Methods
        void .ctor(uint8_t param0);  // RVA: 0x485E70
    };

} // namespace System.Runtime.CompilerServices

// Namespace: <global>
class JoinLeave : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    KeyCode join; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    KeyCode leave; // 0x0024

    // Methods
    void .ctor();  // RVA: 0x485B40
    void Update();  // RVA: 0x4160A0
};

// Namespace: <global>
class m
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t pew; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    AudioClip* pex; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Single[][] pey; // 0x0020

    // Methods
    void .ctor(Single[][] a);  // RVA: 0x48BD30
    void bvv(int32_t a);  // RVA: 0x48BDD0
    void gzh(Single[][] a);  // RVA: 0x48BD70
    void bvu(Single[][] a);  // RVA: 0x48BD70
};

// Namespace: <global>
class o
{
public:
    // Static fields
    // static float pez;
    // static int32_t pfa;
    // static Single[][] pfb;
    // static int32_t pfc;
    // static Single[][] pfd;


    // Methods
    static AudioSource* bwg(AudioClip* a, Vector3 b);  // RVA: 0x48D100
    static int32_t inp(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48F020
    static AudioClip* jxz(int32_t a, q* b);  // RVA: 0x4905A0
    static int32_t bvy(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48C130
    static m* mgu(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x490D20
    static void bwa(int32_t a);  // RVA: 0x4160A0
    static AudioSource* hst(AudioClip* a, Vector3 b, float c);  // RVA: 0x48EF70
    static AudioSource* jhz(AudioClip* a, Vector3 b, float c);  // RVA: 0x48FCC0
    static AudioSource* oiw(AudioClip* a, float b);  // RVA: 0x490EB0
    static AudioClip* bvx(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48C070
    static void hbd(AudioClip* a, AnimationCurve* b, float c);  // RVA: 0x48EB60
    static AudioClip* gz(AnimationCurve* a, int32_t b);  // RVA: 0x48E900
    static AudioClip* bvz(int32_t a, q* b);  // RVA: 0x48C650
    static AudioSource* ejr(AudioClip* a, Vector3 b);  // RVA: 0x48E030
    static void .cctor();  // RVA: 0x48BDE0
    static void bwh(AudioClip* a, AnimationCurve* b, float c);  // RVA: 0x48D230
    static AudioSource* gql(AudioClip* a, float b);  // RVA: 0x48E160
    static void eiv(AudioClip* a, AnimationCurve* b, float c);  // RVA: 0x48DEA0
    static AudioSource* bwd(AudioClip* a);  // RVA: 0x48CF40
    static m* ecf(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48DDD0
    static m* bvw(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48BFA0
    static AudioSource* bwe(AudioClip* a, Vector3 b);  // RVA: 0x48CFE0
    static void nxj(int32_t a);  // RVA: 0x4160A0
    static AudioClip* jct(int32_t a, q* b);  // RVA: 0x48F540
    static AudioClip* ddl(int32_t a, q* b);  // RVA: 0x48D550
    static AudioSource* hhb(AudioClip* a, Vector3 b);  // RVA: 0x48EE40
    static AudioClip* jpd(int32_t a, q* b);  // RVA: 0x48FF00
    static q* hev();  // RVA: 0x48ECF0
    static AudioSource* bwc(AudioClip* a, float b);  // RVA: 0x48CE70
    static int32_t gwu(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48E3E0
    static AudioClip* nyg(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x490DF0
    static void nxg(int32_t a);  // RVA: 0x4160A0
    static void jky(AudioClip* a, AnimationCurve* b, float c);  // RVA: 0x48FD70
    static AudioClip* gwt(AnimationCurve* a, int32_t b);  // RVA: 0x48E230
    static AudioSource* bwf(AudioClip* a, Vector3 b, float c);  // RVA: 0x48D050
    static AudioClip* bwb(AnimationCurve* a, int32_t b);  // RVA: 0x48CCC0
    static AudioSource* lko(AudioClip* a, float b);  // RVA: 0x490C50
    static void cco(int32_t a);  // RVA: 0x4160A0
    static AudioSource* dqm(AudioClip* a, Vector3 b, float c);  // RVA: 0x48DD20
    static q* bkh();  // RVA: 0x48BE50
    static AudioSource* dft(AudioClip* a, Vector3 b);  // RVA: 0x48DBF0
    static void cfo(AudioClip* a, AnimationCurve* b, float c);  // RVA: 0x48D3C0
    static AudioSource* hah(AudioClip* a, Vector3 b, float c);  // RVA: 0x48EAB0
    static q* options();  // RVA: 0x490F80
    void .ctor();  // RVA: 0x427B90
    static m* jev(AnimationCurve* a, AnimationCurve* b, q* c);  // RVA: 0x48FBF0
};

// Namespace: <global>
struct p
{
public:
    // Static fields
    // static p Sine;
    // static p Square;
    // static p Sawtooth;
    // static p Noise;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class q
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    p pfe; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3[][] pff; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Vector3[][] pfg; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    int32_t pfh; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float pfi; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float pfj; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    bool pfk; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    m* pfl; // 0x0038

    // Methods
    q* bwq(float a);  // RVA: 0x491180
    q* gmp();  // RVA: 0x491130
    q* hgm(float a);  // RVA: 0x491180
    q* kld(int32_t a);  // RVA: 0x491100
    q* bwl();  // RVA: 0x491140
    q* bwk();  // RVA: 0x491130
    q* gfv(float a);  // RVA: 0x491170
    q* ipd(int32_t a);  // RVA: 0x491100
    q* bwp(float a);  // RVA: 0x491170
    q* fui();  // RVA: 0x491130
    q* fli(float a);  // RVA: 0x491180
    q* lwm(int32_t a);  // RVA: 0x491100
    q* bwo(p a);  // RVA: 0x4910F0
    q* cho();  // RVA: 0x491130
    q* bwm();  // RVA: 0x491150
    q* bnp(p a);  // RVA: 0x4910F0
    q* bxk(float a);  // RVA: 0x491180
    q* bwi(int32_t a);  // RVA: 0x491100
    q* gvo();  // RVA: 0x491140
    q* kfk(float a);  // RVA: 0x491170
    q* bwn();  // RVA: 0x491160
    q* ocf(p a);  // RVA: 0x4910F0
    q* ota(p a);  // RVA: 0x4910F0
    q* cxc(float a);  // RVA: 0x491170
    q* cje(float a);  // RVA: 0x491180
    q* mtu(float a);  // RVA: 0x491170
    q* caz();  // RVA: 0x491130
    void .ctor();  // RVA: 0x4910D0
    q* bzh(int32_t a);  // RVA: 0x491100
    q* bwj(Vector3[][] a);  // RVA: 0x491110
    q* cbg(p a);  // RVA: 0x4910F0
};

// Namespace: <global>
class s
{
public:

    // Methods
    static Vector3 bwv(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h);  // RVA: 0x491860
    static Color bhp(Color a, Color b, Color c, float d, float e, float f, float g, float h);  // RVA: 0x491190
    static Vector3 bws(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f);  // RVA: 0x4914E0
    static float bwu(float a, float b, float c, float d, float e, float f, float g, float h);  // RVA: 0x491780
    static Vector3 npf(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f);  // RVA: 0x4914E0
    static float hkm(float a, float b, float c, float d, float e, float f, float g, float h);  // RVA: 0x4923F0
    static float bwx(float a, float b, float c, float d);  // RVA: 0x4919E0
    static Vector3 bxb(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491D90
    static Vector3 hiu(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f);  // RVA: 0x4914E0
    static Vector3 goq(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x491A80
    static float bxa(float a, float b, float c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491C70
    static Vector3 gei(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f);  // RVA: 0x4914E0
    void .ctor();  // RVA: 0x427B90
    static float htn(float a, float b, float c, float d, float e, float f);  // RVA: 0x4924D0
    static float ktm(float a, float b, float c, float d);  // RVA: 0x492A70
    static Vector3 hly(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x491A80
    static Color ioc(Color a, Color b, float c);  // RVA: 0x4926F0
    static Color bwt(Color a, Color b, Color c, float d, float e, float f);  // RVA: 0x491610
    static Vector3 coc(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x491A80
    static Color bxk(Color a, Color b, Color c, float d, float e, float f);  // RVA: 0x491610
    static Color bxc(Color a, Color b, Color c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491F30
    static float jtg(float a, float b, float c, float d, float e, float f);  // RVA: 0x4927F0
    static Vector3 hmj(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491D90
    static Vector3 jqd(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491D90
    static Vector3 dzl(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h);  // RVA: 0x491860
    static Vector3 bwy(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x491A80
    static float bwr(float a, float b, float c, float d, float e, float f);  // RVA: 0x491360
    static float imn(float a, float b, float c, float d);  // RVA: 0x492650
    static float mow(float a, float b, float c, float d);  // RVA: 0x492B10
    static Color kct(Color a, Color b, float c);  // RVA: 0x492970
    static Color emz(Color a, Color b, Color c, float d, float e, float f);  // RVA: 0x491610
    static Vector3 mkq(Vector3 a, Vector3 b, Vector3 c, float d, float e, float f, float g, float h, float i);  // RVA: 0x491D90
    static Color jan(Color a, Color b, Color c, float d, float e, float f);  // RVA: 0x491610
    static Color bww(Color a, Color b, Color c, float d, float e, float f, float g, float h);  // RVA: 0x491190
    static Vector3 hqf(Vector3 a, Vector3 b, float c, float d);  // RVA: 0x491A80
    static float dlt(float a, float b, float c, float d, float e, float f, float g, float h);  // RVA: 0x492130
    static Color bwz(Color a, Color b, float c);  // RVA: 0x491B60
    static float fin(float a, float b, float c, float d, float e, float f, float g, float h);  // RVA: 0x492210
    static Color gmy(Color a, Color b, float c);  // RVA: 0x4922F0
};

// Namespace: <global>
class t
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t pfm; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* pfn; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    LeanTester* pfo; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float pfp; // 0x0028

    // Methods
    Il2CppObject* eqr();  // RVA: 0x42A480
    bool MoveNext();  // RVA: 0x492BB0
    Il2CppObject* bxe();  // RVA: 0x42A480
    bool buq();  // RVA: 0x492D60
    Il2CppObject* ihp();  // RVA: 0x42A480
    void bxd();  // RVA: 0x4160A0
    void eee();  // RVA: 0x4160A0
    void bxf();  // RVA: 0x492EE0
    void fvr();  // RVA: 0x4160A0
    void kfw();  // RVA: 0x4160A0
    bool ljp();  // RVA: 0x493220
    void cwq();  // RVA: 0x4160A0
    void .ctor(int32_t a);  // RVA: 0x492D30
    Il2CppObject* bxg();  // RVA: 0x42A480
    bool iqw();  // RVA: 0x4930A0
    bool etg();  // RVA: 0x492F20
    Il2CppObject* kka();  // RVA: 0x42A480
};

// Namespace: <global>
class LeanTester : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float timeout; // 0x0020

    // Methods
    IEnumerator* oty();  // RVA: 0x485D40
    IEnumerator* bxh();  // RVA: 0x485BF0
    void ibi();  // RVA: 0x485B60
    IEnumerator* hxh();  // RVA: 0x485C60
    void hgm();  // RVA: 0x485B60
    void gbv();  // RVA: 0x485B60
    void .ctor();  // RVA: 0x485BE0
    IEnumerator* kgu();  // RVA: 0x485CD0
    void cnm();  // RVA: 0x485B60
    void Start();  // RVA: 0x485B60
};

// Namespace: <global>
class u
{
public:
    // Static fields
    // static int32_t pfq;
    // static int32_t pfr;
    // static int32_t pfs;
    // static float pft;
    // static bool pfu;
    // static bool pfv;


    // Methods
    static Il2CppString* bxl(Il2CppString* a, Il2CppString* b);  // RVA: 0x493C30
    static void faa(Il2CppString* name, bool didPass, Il2CppString* failExplaination);  // RVA: 0x494A80
    static Il2CppString* bxj(int32_t a);  // RVA: 0x493A40
    static void .cctor();  // RVA: 0x4933A0
    static Il2CppString* mnx(Il2CppString* a, Il2CppString* b);  // RVA: 0x496020
    static float me(Il2CppString* a);  // RVA: 0x495EC0
    static Il2CppString* bxm(Il2CppString* a);  // RVA: 0x493CF0
    static void debug(Il2CppString* name, bool didPass, Il2CppString* failExplaination);  // RVA: 0x494340
    void .ctor();  // RVA: 0x427B90
    static float bxk(Il2CppString* a);  // RVA: 0x493AD0
    static Il2CppString* bxn(Il2CppString* a, Il2CppString* b);  // RVA: 0x493D60
    static void hel(bool a, Il2CppString* b, Il2CppString* c);  // RVA: 0x495460
    static void hrb(Il2CppString* name, bool didPass, Il2CppString* failExplaination);  // RVA: 0x495A70
    static void bxo();  // RVA: 0x493E80
    static Il2CppString* zl(Il2CppString* a, Il2CppString* b);  // RVA: 0x496380
    static Il2CppString* oni(int32_t a);  // RVA: 0x496230
    static void eqw(bool a, Il2CppString* b, Il2CppString* c);  // RVA: 0x494470
    static void gg(bool a, Il2CppString* b, Il2CppString* c);  // RVA: 0x494E50
    static Il2CppString* onm(Il2CppString* a, Il2CppString* b);  // RVA: 0x4962C0
    static Il2CppString* nhk(Il2CppString* a, Il2CppString* b);  // RVA: 0x496170
    static Il2CppString* ltj(Il2CppString* a, Il2CppString* b);  // RVA: 0x495DA0
    static float imi(Il2CppString* a);  // RVA: 0x495AE0
    static float cgd(Il2CppString* a);  // RVA: 0x4941E0
    static void bxi(bool a, Il2CppString* b, Il2CppString* c);  // RVA: 0x493430
    static void gck();  // RVA: 0x494AF0
    static float joq(Il2CppString* a);  // RVA: 0x495C40
    static Il2CppString* dzm(Il2CppString* a, Il2CppString* b);  // RVA: 0x4943B0
    static Il2CppString* mxv(int32_t a);  // RVA: 0x4960E0
};

// Namespace: <global>
struct w
{
public:
    // Static fields
    // static w MOVE_X;
    // static w MOVE_Y;
    // static w MOVE_Z;
    // static w MOVE_LOCAL_X;
    // static w MOVE_LOCAL_Y;
    // static w MOVE_LOCAL_Z;
    // static w MOVE_CURVED;
    // static w MOVE_CURVED_LOCAL;
    // static w MOVE_SPLINE;
    // static w MOVE_SPLINE_LOCAL;
    // static w SCALE_X;
    // static w SCALE_Y;
    // static w SCALE_Z;
    // static w ROTATE_X;
    // static w ROTATE_Y;
    // static w ROTATE_Z;
    // static w ROTATE_AROUND;
    // static w ROTATE_AROUND_LOCAL;
    // static w CANVAS_ROTATEAROUND;
    // static w CANVAS_ROTATEAROUND_LOCAL;
    // static w CANVAS_PLAYSPRITE;
    // static w ALPHA;
    // static w TEXT_ALPHA;
    // static w CANVAS_ALPHA;
    // static w CANVASGROUP_ALPHA;
    // static w ALPHA_VERTEX;
    // static w COLOR;
    // static w CALLBACK_COLOR;
    // static w TEXT_COLOR;
    // static w CANVAS_COLOR;
    // static w CANVAS_MOVE_X;
    // static w CANVAS_MOVE_Y;
    // static w CANVAS_MOVE_Z;
    // static w CALLBACK;
    // static w MOVE;
    // static w MOVE_LOCAL;
    // static w MOVE_TO_TRANSFORM;
    // static w ROTATE;
    // static w ROTATE_LOCAL;
    // static w SCALE;
    // static w VALUE3;
    // static w GUI_MOVE;
    // static w GUI_MOVE_MARGIN;
    // static w GUI_SCALE;
    // static w GUI_ALPHA;
    // static w GUI_ROTATE;
    // static w DELAYED_SOUND;
    // static w CANVAS_MOVE;
    // static w CANVAS_SCALE;
    // static w CANVAS_SIZEDELTA;
    // static w FOLLOW;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct ba
{
public:
    // Static fields
    // static ba notUsed;
    // static ba linear;
    // static ba easeOutQuad;
    // static ba easeInQuad;
    // static ba easeInOutQuad;
    // static ba easeInCubic;
    // static ba easeOutCubic;
    // static ba easeInOutCubic;
    // static ba easeInQuart;
    // static ba easeOutQuart;
    // static ba easeInOutQuart;
    // static ba easeInQuint;
    // static ba easeOutQuint;
    // static ba easeInOutQuint;
    // static ba easeInSine;
    // static ba easeOutSine;
    // static ba easeInOutSine;
    // static ba easeInExpo;
    // static ba easeOutExpo;
    // static ba easeInOutExpo;
    // static ba easeInCirc;
    // static ba easeOutCirc;
    // static ba easeInOutCirc;
    // static ba easeInBounce;
    // static ba easeOutBounce;
    // static ba easeInOutBounce;
    // static ba easeInBack;
    // static ba easeOutBack;
    // static ba easeInOutBack;
    // static ba easeInElastic;
    // static ba easeOutElastic;
    // static ba easeInOutElastic;
    // static ba easeSpring;
    // static ba easeShake;
    // static ba punch;
    // static ba once;
    // static ba clamp;
    // static ba pingPong;
    // static ba animationCurve;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct bd
{
public:
    // Static fields
    // static bd position;
    // static bd localPosition;
    // static bd x;
    // static bd y;
    // static bd z;
    // static bd localX;
    // static bd localY;
    // static bd localZ;
    // static bd scale;
    // static bd color;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class be
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bq* pfw; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float pfx; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float pfy; // 0x001C

    // Methods
    void .ctor();  // RVA: 0x427B90
    void bxy();  // RVA: 0x486BA0
    void bxp();  // RVA: 0x485EA0
    void bxx();  // RVA: 0x4869C0
    void bxs();  // RVA: 0x486420
    void bxr();  // RVA: 0x486300
    void jmi();  // RVA: 0x486420
    void enk();  // RVA: 0x486660
    void frm();  // RVA: 0x486540
    void bxw();  // RVA: 0x4868A0
    void dpq();  // RVA: 0x4860D0
    void bxv();  // RVA: 0x486780
    void hna();  // RVA: 0x486420
    void bxu();  // RVA: 0x486660
    void kp();  // RVA: 0x486660
    void ecs();  // RVA: 0x486660
    void bxt();  // RVA: 0x486540
    void gof();  // RVA: 0x486420
    void mat();  // RVA: 0x4860D0
    void mrm();  // RVA: 0x4860D0
    void dpy();  // RVA: 0x486780
    void bxq();  // RVA: 0x4860D0
    void jub();  // RVA: 0x486EC0
    void nkk();  // RVA: 0x486540
    void izv();  // RVA: 0x486420
    void oni();  // RVA: 0x486780
    void cnn();  // RVA: 0x486D30
    void bzn();  // RVA: 0x4860D0
};

// Namespace: <global>
class bf
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bq* pfz; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float pga; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float pgb; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float pgc; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float pgd; // 0x0024

    // Methods
    void heh();  // RVA: 0x487050
    void iah();  // RVA: 0x4874F0
    void bya();  // RVA: 0x487220
    void byb();  // RVA: 0x4873B0
    void .ctor();  // RVA: 0x427B90
    void egq();  // RVA: 0x488010
    void cxs();  // RVA: 0x4878B0
    void ffa();  // RVA: 0x4881C0
    void byg();  // RVA: 0x4879F0
    void bxz();  // RVA: 0x487050
    void ocy();  // RVA: 0x487050
    void eb();  // RVA: 0x487630
    void oid();  // RVA: 0x487630
    void ym();  // RVA: 0x487050
    void bye();  // RVA: 0x487770
    void jiu();  // RVA: 0x487220
    void hgc();  // RVA: 0x4874F0
    void byi();  // RVA: 0x487CB0
    void cfo();  // RVA: 0x487630
    void byc();  // RVA: 0x4874F0
    void fey();  // RVA: 0x4879F0
    void kvo();  // RVA: 0x487630
    void byd();  // RVA: 0x487630
    void byf();  // RVA: 0x4878B0
    void jcc();  // RVA: 0x4879F0
    void byh();  // RVA: 0x487B30
    void jjm();  // RVA: 0x487B30
    void ebz();  // RVA: 0x487E60
    void ccd();  // RVA: 0x487050
};

// Namespace: <global>
class bg
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bq* pge; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float pgf; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float pgg; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float pgh; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float pgi; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    float pgj; // 0x0028

    // Methods
    void lbj();  // RVA: 0x488AF0
    void ncf();  // RVA: 0x488EB0
    void jxg();  // RVA: 0x488550
    void iit();  // RVA: 0x488D70
    void byq();  // RVA: 0x488D70
    void dcw();  // RVA: 0x488550
    void byo();  // RVA: 0x488AF0
    void cog();  // RVA: 0x488C30
    void .ctor();  // RVA: 0x427B90
    void hdt();  // RVA: 0x488C30
    void byr();  // RVA: 0x488EB0
    void giw();  // RVA: 0x488550
    void ljk();  // RVA: 0x488370
    void bys();  // RVA: 0x489040
    void byk();  // RVA: 0x488550
    void kso();  // RVA: 0x488370
    void bym();  // RVA: 0x488870
    void byp();  // RVA: 0x488C30
    void mhb();  // RVA: 0x488870
    void fig();  // RVA: 0x488EB0
    void byj();  // RVA: 0x488370
    void npz();  // RVA: 0x488870
    void byl();  // RVA: 0x488730
    void byn();  // RVA: 0x4889B0
    void lcd();  // RVA: 0x488870
};

// Namespace: <global>
class bh
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    bq* pgk; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float pgl; // 0x0018

    // Methods
    void gfz();  // RVA: 0x48A3D0
    void byv();  // RVA: 0x489720
    void byt();  // RVA: 0x489400
    void kqh();  // RVA: 0x48A9B0
    void dkf();  // RVA: 0x48A000
    void cze();  // RVA: 0x489EA0
    void byy();  // RVA: 0x489930
    void mnh();  // RVA: 0x48AC70
    void bza();  // RVA: 0x489A90
    void kov();  // RVA: 0x48A850
    void .ctor();  // RVA: 0x427B90
    void byx();  // RVA: 0x489880
    void hom();  // RVA: 0x48A530
    void fya();  // RVA: 0x48A210
    void gyh();  // RVA: 0x48A480
    void byz();  // RVA: 0x4899E0
    void byu();  // RVA: 0x4895C0
    void mzu();  // RVA: 0x48AD20
    void bzc();  // RVA: 0x489CA0
    void bzb();  // RVA: 0x489B40
    void nnc();  // RVA: 0x48AE80
    void ilr();  // RVA: 0x48A6F0
    void ohy();  // RVA: 0x48B040
    void bwg();  // RVA: 0x489350
    void jbk();  // RVA: 0x48A7A0
    void lwq();  // RVA: 0x48ABC0
    void dfy();  // RVA: 0x489F50
    void nfc();  // RVA: 0x48ADD0
    void byw();  // RVA: 0x4897D0
    void kub();  // RVA: 0x48AA60
    void fif();  // RVA: 0x48A160
};

// Namespace: <global>
class LeanTween : public MonoBehaviour
{
public:
    // Static fields
    // static bool throwErrors;
    // static float tau;
    // static float PI_DIV2;
    // static bs[][] pgm;
    // static bq[][] pgn;
    // static Int32[][] pgo;
    // static Int32[][] pgp;
    // static bq* pgq;
    // static int32_t pgr;
    // static int32_t pgs;
    // static int32_t pgt;
    // static int32_t pgu;
    // static GameObject* pgv;
    // static float dtEstimated;
    // static float dtManual;
    // static float dtActual;
    // static uint32_t pgw;
    // static int32_t pgx;
    // static int32_t pgy;
    // static int32_t pgz;
    // static AnimationCurve* punch;
    // static AnimationCurve* shake;
    // static int32_t pha;
    // static int32_t startSearch;
    // static bq* d;
    // static Action`1[][] phb;
    // static GameObject[][] phc;
    // static int32_t phd;
    // static int32_t EVENTS_MAX;
    // static int32_t LISTENERS_MAX;
    // static int32_t phe;


    // Methods
    static Vector3 cyg(Vector3 a, Vector3 b, float c);  // RVA: 0x46D940
    static bq* inx(GameObject* a, float b, float c);  // RVA: 0x477F00
    static bq* ccq(AudioClip* a, Vector3 b, float c);  // RVA: 0x467C00
    static bq* niy(float a, System.Action<System.Object> b);  // RVA: 0x481100
    static bool imi(int32_t a, System.Action<bl> b);  // RVA: 0x477D70
    static bq* cce(LTRect* a, float b, float c);  // RVA: 0x467270
    static void reset();  // RVA: 0x4840D0
    static bq* lre(GameObject* a, Vector3 b, float c);  // RVA: 0x47E0A0
    static bq* ewk(RectTransform* rectTrans, Color to, float time);  // RVA: 0x4728C0
    static bq* grp(GameObject* a, Vector3 b, float c, float d);  // RVA: 0x4751F0
    static bq* ccd(GameObject* a, Vector3 b, float c);  // RVA: 0x4671C0
    static bq* dwp(RectTransform* a, float b, float c);  // RVA: 0x46FDD0
    static bq* cpq(CanvasGroup* a, float b, float c);  // RVA: 0x46D180
    static bq* mdp(RectTransform* a, Vector3 b, float c);  // RVA: 0x47EAB0
    static void jay(int32_t a);  // RVA: 0x478AB0
    static bq* bzz(int32_t a);  // RVA: 0x462160
    static bq* gmd(GameObject* a, Vector3[][] b, float c);  // RVA: 0x474D60
    static float cel(float a, float b, float c, float d);  // RVA: 0x4697D0
    static bq* kus(GameObject* gameObject, System.Action<UnityEngine.Color> callOnUpdate, Color from, Color to, float time);  // RVA: 0x47CAB0
    static bq* ccb(GameObject* a, LTSpline* b, float c);  // RVA: 0x466E80
    static bq* det(GameObject* a, Vector3 b, float c);  // RVA: 0x46EAB0
    static bq* ccj(GameObject* a, Vector3 b, float c, float d);  // RVA: 0x467640
    static void bzw(LTRect* a, int32_t b);  // RVA: 0x461D40
    static bq* jbe(GameObject* a, AudioClip* b, Vector3 c, float d);  // RVA: 0x478F00
    static Il2CppObject* ohk(Il2CppString* a);  // RVA: 0x482750
    static bq* fjz(GameObject* gameObject, System.Action<UnityEngine.Color> callOnUpdate, Color from, Color to, float time);  // RVA: 0x4731E0
    static bq* ebo(GameObject* gameObject, System.Action<UnityEngine.Color> callOnUpdate, Color from, Color to, float time);  // RVA: 0x470740
    static float bsq(float a, float b, float c, float d, float e);  // RVA: 0x45F7B0
    static float cea(float a, float b, float c);  // RVA: 0x469220
    static bq* ccw(RectTransform* a, float b, float c);  // RVA: 0x468210
    static void cae();  // RVA: 0x4629E0
    static bq* dar(LTRect* a, Vector2 b, float c);  // RVA: 0x46E610
    static float nhl(float a, float b, float c);  // RVA: 0x480AC0
    static bq* eah(GameObject* a, Transform* b, float c);  // RVA: 0x4703C0
    static bq* value(GameObject* gameObject, System.Action<UnityEngine.Color,System.Object> callOnUpdate, Color from, Color to, float time);  // RVA: 0x485100
    static float zb(float a, float b, float c);  // RVA: 0x485A70
    static void oem(GameObject* a, int32_t b);  // RVA: 0x482340
    static bool olx(RectTransform* a);  // RVA: 0x482850
    static bq* cpb(Transform* a, Transform* b, bd c, float d, float e, float f, float g);  // RVA: 0x46CC50
    static int32_t mww();  // RVA: 0x47FF80
    static bq[][] caa(GameObject* a);  // RVA: 0x4624F0
    static void .cctor();  // RVA: 0x45D100
    static bq* cci(GameObject* a, float b, float c);  // RVA: 0x467580
    static bq* lnk(GameObject* a, float b, float c);  // RVA: 0x47DD60
    static float cul(float a, float b, float c);  // RVA: 0x468FF0
    static bq* nyh(GameObject* gameObject, System.Action<System.Single> callOnUpdate, float from, float to, float time);  // RVA: 0x481BA0
    static bq* noj(GameObject* a, float b, float c);  // RVA: 0x481870
    static void ejz(int32_t a, int32_t b);  // RVA: 0x4710F0
    static bq* cav(RectTransform* a, Sprite[][] b);  // RVA: 0x464310
    static bq* bko(GameObject* a, Vector3[][] b, float c);  // RVA: 0x45E220
    static int32_t lz();  // RVA: 0x47E870
    static Vector3[][] bzo(Vector3[][] a, Vector3 b);  // RVA: 0x461380
    static bq* cax(RectTransform* a, float b, float c);  // RVA: 0x464760
    static void bzq();  // RVA: 0x4615C0
    static bq* cfz(GameObject* gameObject, System.Action<System.Single> callOnUpdate, float from, float to, float time);  // RVA: 0x46BB70
    static bq* nmy(Transform* a, Transform* b, bd c, float d, float e, float f, float g);  // RVA: 0x4813E0
    static bq* ebn(GameObject* a, Vector2 b, float c);  // RVA: 0x470640
    static int32_t npf();  // RVA: 0x481A00
    static bq* cbc(RectTransform* a, Color b, float c);  // RVA: 0x464BB0
    static bq* cbd(float a, Action* b);  // RVA: 0x464CD0
    static bq* caz(CanvasGroup* a, float b, float c);  // RVA: 0x464900
    static bq* cbf(GameObject* a, float b, Action* c);  // RVA: 0x464ED0
    static bq* bor(GameObject* a, float b, Action* c);  // RVA: 0x45F3B0
    static bq* cbh(LTRect* a, float b);  // RVA: 0x4650D0
    static bq* ccx(RectTransform* a, Vector3 b, float c);  // RVA: 0x468360
    static void htp(Scene a, LoadSceneMode b);  // RVA: 0x4769E0
    static bq* brt(RectTransform* a, float b, float c);  // RVA: 0x45F6A0
    static float cdn(float a, float b, float c);  // RVA: 0x468E90
    static bq* options();  // RVA: 0x4831D0
    static Vector3 cdh(Vector3 a, Vector3 b, float c);  // RVA: 0x468B30
    static bool bkd(int32_t a);  // RVA: 0x45E150
    static float ntb(float a, float b, float c);  // RVA: 0x481B60
    static bq* rl(GameObject* a, Vector3 b, float c, bq* d);  // RVA: 0x484280
    static void hot();  // RVA: 0x475E60
    static bool gtf(int32_t a);  // RVA: 0x475300
    static bq* cbt(GameObject* a, float b, float c);  // RVA: 0x4664C0
    static bq* keg(LTRect* a, Vector2 b, float c);  // RVA: 0x47B540
    static void cyl();  // RVA: 0x46DA60
    static float mtz(float a, float b, float c);  // RVA: 0x47F990
    static float dnc(float a, float b, float c);  // RVA: 0x46F5E0
    static void cqs(int32_t a);  // RVA: 0x46D3F0
    static float fbh(float a, float b, float c, float d, float e);  // RVA: 0x472D20
    static float cwp(float a, float b, float c);  // RVA: 0x46D800
    static bq* ccy(RectTransform* a, Vector3 b, float c, float d);  // RVA: 0x4684A0
    static float ceo(float a, float b, float c, float d, float e);  // RVA: 0x4699E0
    static bq* nkl(LTRect* a, Vector2 b, float c);  // RVA: 0x4812F0
    static float ngx(float a, float b, float c);  // RVA: 0x468FF0
    static bq* oah(GameObject* a, Vector3[][] b, float c);  // RVA: 0x481EC0
    static bq* iie(GameObject* a, float b, float c);  // RVA: 0x4773E0
    static bq* ddx(RectTransform* a, float b, float c);  // RVA: 0x46E870
    static bq* gug(CanvasGroup* a, float b, float c);  // RVA: 0x475490
    static bq* vi(GameObject* a, Vector3 b, float c);  // RVA: 0x485400
    static int32_t gdt();  // RVA: 0x474610
    static bq* euv(LTRect* a, float b, float c);  // RVA: 0x4724E0
    static bq* ixz(GameObject* a, Vector3 b, float c);  // RVA: 0x478750
    static bq[][] oen(GameObject* a);  // RVA: 0x482390
    static bq* cco(GameObject* a, float b, float c);  // RVA: 0x467A80
    static float egl(float a, float b, float c, float d);  // RVA: 0x470E10
    static bq* value(GameObject* gameObject, float from, float to, float time);  // RVA: 0x4846E0
    static bq* value(float from, float to, float time);  // RVA: 0x484D20
    static void cox(int32_t a, bool b);  // RVA: 0x46C990
    static GameObject* coh();  // RVA: 0x46C640
    static bq* icr(LTRect* a, Vector2 b, float c);  // RVA: 0x477240
    static bq* value(GameObject* gameObject, System.Action<System.Single> callOnUpdate, float from, float to, float time);  // RVA: 0x4847D0
    static float lyx(float a, float b, float c);  // RVA: 0x47E810
    static float mjx(float a, float b, float c);  // RVA: 0x47EDF0
    static bq* cct(RectTransform* a, float b, float c);  // RVA: 0x467F40
    static float oph(float a, float b, float c);  // RVA: 0x483170
    static bool ooj(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x482C90
    static void qc(int32_t a, int32_t b);  // RVA: 0x484020
    static void mlv();  // RVA: 0x47EF50
    static bq* ktz(GameObject* a, float b, float c);  // RVA: 0x47C9D0
    static int32_t jkm();  // RVA: 0x479A50
    static float ov(bq* a, float b);  // RVA: 0x4688E0
    static float cej(float a, float b, float c);  // RVA: 0x4696B0
    static bq* cdb(RectTransform* a, Vector2 b, float c);  // RVA: 0x4687E0
    static float otl(float a, float b, float c, float d, float e);  // RVA: 0x483C70
    static float eio(float a, float b, float c);  // RVA: 0x470E80
    static float cep(float a, float b, float c, float d, float e);  // RVA: 0x469B00
    static bq* ccz(RectTransform* a, Vector3 b, float c, float d);  // RVA: 0x4685D0
    static bq* cbg(GameObject* a, float b, System.Action<System.Object> c);  // RVA: 0x464FD0
    static bool caq(LTRect* a);  // RVA: 0x463630
    static bq[][] hch(GameObject* a);  // RVA: 0x475A00
    static float iby(float a, float b, float c);  // RVA: 0x4771A0
    static bq* ecz(RectTransform* a, Vector2 b, float c);  // RVA: 0x4709D0
    static bq* jwh(GameObject* a, Vector3 b, float c, float d);  // RVA: 0x47A830
    static bq* klc(Transform* a, Transform* b, bd c, float d, float e, float f, float g);  // RVA: 0x47C280
    static void ojj();  // RVA: 0x482800
    static float cdg(float a, float b, float c);  // RVA: 0x468AD0
    static bq* cbs(GameObject* a, float b, float c);  // RVA: 0x466400
    static float cdi(float a, float b, float c);  // RVA: 0x468C60
    static void cad(GameObject* a);  // RVA: 0x462870
    static float cdk(float a, float b, float c);  // RVA: 0x468D50
    static float cdu(float a, float b, float c);  // RVA: 0x469050
    static float cdm(float a, float b, float c);  // RVA: 0x468E60
    static bq* lzy(RectTransform* a, float b, float c);  // RVA: 0x47E8C0
    static bq* cer(Transform* a, Transform* b, bd c, float d, float e, float f, float g);  // RVA: 0x46A080
    static void bzu(RectTransform* a);  // RVA: 0x461A10
    static bq* lew(RectTransform* a, Sprite[][] b);  // RVA: 0x47D900
    static bq* lbb(GameObject* a, float b, float c);  // RVA: 0x47D230
    static void jvh(int32_t a, bool b);  // RVA: 0x47A4C0
    static bq* hoz(LTRect* a, float b);  // RVA: 0x476400
    static float gaj(float a, float b, float c);  // RVA: 0x474050
    static float gfn(float a, float b, float c, float d);  // RVA: 0x474660
    static bq* value(GameObject* gameObject, System.Action<UnityEngine.Vector2> callOnUpdate, Vector2 from, Vector2 to, float time);  // RVA: 0x4852A0
    static float cdx(float a, float b, float c);  // RVA: 0x469120
    static float cdy(float a, float b, float c);  // RVA: 0x469190
    static float cec(float a, float b, float c);  // RVA: 0x4692D0
    static bq* hjr(float a, System.Action<System.Object> b);  // RVA: 0x475D10
    static bq* ces(Transform* a, Transform* b, bd c, float d, float e, float f, float g, float h);  // RVA: 0x46A4A0
    static float cdz(float a, float b, float c);  // RVA: 0x4691E0
    static void icf(int32_t a);  // RVA: 0x4771E0
    static bq* alpha(GameObject* gameObject, float to, float time);  // RVA: 0x45D9B0
    static bq* nad(GameObject* a, LTSpline* b, float c);  // RVA: 0x4804D0
    static bq* cba(GameObject* a, float b, float c);  // RVA: 0x4649D0
    static void lr(bool a);  // RVA: 0x47DE90
    static float cei(float a, float b, float c);  // RVA: 0x4695E0
    static void lbz(GameObject* a);  // RVA: 0x47D310
    static bq* cbk(GameObject* a, Vector3[][] b, float c);  // RVA: 0x465390
    static bq* bvp(GameObject* a, Vector3[][] b, float c);  // RVA: 0x45FAF0
    static bool cap(int32_t a);  // RVA: 0x463530
    static bq* coe(LTRect* a, Vector2 b, float c);  // RVA: 0x46C550
    static bq* cch(GameObject* a, float b, float c);  // RVA: 0x4674C0
    static bq* mtw(GameObject* gameObject, System.Action<System.Single,System.Object> callOnUpdate, float from, float to, float time);  // RVA: 0x47F810
    static bq* mwg(GameObject* a, float b, float c);  // RVA: 0x47FEA0
    static float cdo(float a, float b, float c, float d);  // RVA: 0x468F00
    static GameObject* gto();  // RVA: 0x4753D0
    static bq* eab(GameObject* gameObject, Vector2 from, Vector2 to, float time);  // RVA: 0x470260
    static float cee(float a, float b, float c);  // RVA: 0x4693C0
    static void bnw(bool a);  // RVA: 0x45F030
    static void bzs(GameObject* a);  // RVA: 0x461820
    static bool cex(int32_t a);  // RVA: 0x46B270
    static bq* fvz(GameObject* a, bk* b, float c);  // RVA: 0x473A90
    static void ora(GameObject* a, bool b);  // RVA: 0x4837D0
    static bq* cck(GameObject* a, Vector3 b, float c, float d);  // RVA: 0x467730
    static void bmn(Vector3 a, Vector3 b, Vector3 c, Vector3 d, float e, Transform* f);  // RVA: 0x45E600
    static bq* cbi(GameObject* a, Vector3 b, float c);  // RVA: 0x4651E0
    static bool jeg(LTRect* a);  // RVA: 0x4797C0
    static bq* yh(GameObject* a, Vector3[][] b, float c);  // RVA: 0x4855E0
    static bq* gzl(GameObject* a, float b, float c);  // RVA: 0x4757A0
    static void jvo(int32_t a, int32_t b);  // RVA: 0x47A780
    static bq* mik(GameObject* gameObject, System.Action<System.Single,System.Object> callOnUpdate, float from, float to, float time);  // RVA: 0x47EC70
    static float cdj(float a, float b, float c);  // RVA: 0x468CA0
    static bq* value(GameObject* gameObject, Color from, Color to, float time);  // RVA: 0x484B90
    static bq* ejk(LTRect* a, Vector2 b, float c);  // RVA: 0x470EE0
    static bs* caw(bool a);  // RVA: 0x464440
    static float ebh(float a, float b, float c, float d, float e);  // RVA: 0x4704C0
    static bq* gay(Transform* a, Transform* b, bd c, float d, float e, float f, float g, float h);  // RVA: 0x474100
    static bq* ewo(GameObject* a, float b, float c);  // RVA: 0x472A10
    static bool ejo(LTRect* a);  // RVA: 0x470FD0
    static bq* cob(GameObject* gameObject, System.Action<System.Single,System.Object> callOnUpdate, float from, float to, float time);  // RVA: 0x46C3D0
    static int32_t bzf();  // RVA: 0x460120
    static bq* dfc(GameObject* a, float b, float c);  // RVA: 0x46EB60
    static bq* dro(GameObject* gameObject, Vector3 from, Vector3 to, float time);  // RVA: 0x46F720
    static float bzp(float a, float b);  // RVA: 0x461500
    static bq* kvd(GameObject* a, float b, float c);  // RVA: 0x47CC70
    static void cai(GameObject* a);  // RVA: 0x462C80
    static Il2CppObject* cas(Il2CppString* a);  // RVA: 0x464040
    static void bzm(int32_t a, int32_t b);  // RVA: 0x460E80
    static float dyz(float a, float b, float c, float d);  // RVA: 0x46FEC0
    static bq* kxx(Transform* a, Transform* b, bd c, float d, float e, float f, float g, float h);  // RVA: 0x47CE40
    static bool omd(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x4828C0
    static bq* cbv(GameObject* a, Vector3 b, float c);  // RVA: 0x466640
    static bq* ceq(Transform* a, Transform* b, bd c, float d, float e);  // RVA: 0x469C80
    static bq* def(RectTransform* a, Vector2 b, float c);  // RVA: 0x46E960
    static float kem(float a, float b, float c);  // RVA: 0x47B630
    static bool cey(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x46B340
    static float isx(float a, float b, float c);  // RVA: 0x478320
    static void cac(int32_t a);  // RVA: 0x4627A0
    static bool cew(int32_t a, System.Action<bl> b);  // RVA: 0x46B200
    static float bmv(float a, float b, float c);  // RVA: 0x45EF10
    static bq* nja(int32_t uniqueId);  // RVA: 0x481200
    static bool no(RectTransform* a);  // RVA: 0x481800
    static bq* cbo(GameObject* a, LTSpline* b, float c);  // RVA: 0x465D80
    static bq* fxq(LTRect* a, Vector2 b, float c);  // RVA: 0x473DA0
    static bq* dvh(LTRect* a, Vector2 b, float c);  // RVA: 0x46FCE0
    static void bzv(GameObject* a, int32_t b, bool c);  // RVA: 0x461A80
    static bq* egj(GameObject* a, bk* b, float c);  // RVA: 0x470BC0
    static float ced(float a, float b, float c);  // RVA: 0x469330
    static void iko(bool a);  // RVA: 0x477710
    static void fml(GameObject* a, bool b);  // RVA: 0x4734B0
    static bq* ccr(GameObject* a, AudioClip* b, Vector3 c, float d);  // RVA: 0x467D30
    static bs* dze(bool a);  // RVA: 0x46FF80
    static bq* ccu(RectTransform* a, float b, float c);  // RVA: 0x468030
    static float khw(float a, float b, float c, float d, float e);  // RVA: 0x47B810
    static bq* fzd(GameObject* a, float b, float c);  // RVA: 0x473E90
    static float fpi(float a, float b, float c);  // RVA: 0x473750
    static bq* cbp(GameObject* a, Vector3[][] b, float c);  // RVA: 0x465FC0
    static float cdp(float a, float b, float c);  // RVA: 0x468F40
    static void mzk(GameObject* a, int32_t b, bool c);  // RVA: 0x480220
    static bq* niw(int32_t a);  // RVA: 0x480E50
    static void bzj(Scene a, LoadSceneMode b);  // RVA: 0x460820
    static float bka(float a, float b, float c);  // RVA: 0x45E0F0
    static bq* ghh(RectTransform* a, float b, float c);  // RVA: 0x4747B0
    static bq* bcn(RectTransform* a, Vector3 b, float c);  // RVA: 0x45DAC0
    static void kgx(int32_t a, int32_t b);  // RVA: 0x47B760
    static bq* crh(LTRect* a, float b, float c);  // RVA: 0x46D440
    static float egg(bq* a, float b);  // RVA: 0x4688E0
    static void bzi(int32_t a, int32_t b);  // RVA: 0x460290
    static bq* kih(GameObject* gameObject, Vector3 from, Vector3 to, float time);  // RVA: 0x47B980
    static bq[][] ise(GameObject* a);  // RVA: 0x4780C0
    static Il2CppObject* bil(Il2CppString* a);  // RVA: 0x45DDA0
    static void jzx();  // RVA: 0x47B420
    static bool cak(RectTransform* a);  // RVA: 0x4630C0
    static bq* jwz(GameObject* a, Vector3[][] b, float c);  // RVA: 0x47AE40
    static bq* cfo(GameObject* a, Vector3[][] b, float c);  // RVA: 0x46B850
    static void eyu();  // RVA: 0x472C60
    static float ceb(float a, float b, float c);  // RVA: 0x469280
    static bq* kkl(RectTransform* a, Vector3 b, float c);  // RVA: 0x47C1A0
    static void bzn(int32_t a);  // RVA: 0x460F30
    static bq* eqf(RectTransform* rectTrans, Color to, float time);  // RVA: 0x4722B0
    static bq* options(bq* seed);  // RVA: 0x483690
    static bq* cay(RectTransform* a, float b, float c);  // RVA: 0x464830
    static bq* cbu(GameObject* a, float b, float c);  // RVA: 0x466580
    static bq* jpm(GameObject* a, LTSpline* b, float c);  // RVA: 0x479C80
    static bool cgi(int32_t a);  // RVA: 0x46BCF0
    static bq* jcv(GameObject* a, bk* b, float c);  // RVA: 0x479030
    static void kiv();  // RVA: 0x47BB50
    static int32_t loi();  // RVA: 0x47DE40
    static int32_t ldg();  // RVA: 0x47D4A0
    static bq* ijr(GameObject* a, float b, float c);  // RVA: 0x4774C0
    static bool cao(RectTransform* a);  // RVA: 0x4634C0
    static bool caj(GameObject* a);  // RVA: 0x462DF0
    static void oaz(bool a);  // RVA: 0x482130
    static bq* evr(GameObject* gameObject, System.Action<UnityEngine.Vector2> callOnUpdate, Vector2 from, Vector2 to, float time);  // RVA: 0x4725E0
    static bq* ldy(GameObject* a, Vector3[][] b, float c);  // RVA: 0x47D560
    static void ceu(int32_t a, System.Action<bl> b);  // RVA: 0x46AC50
    static int32_t blr();  // RVA: 0x45E540
    static bq* cby(GameObject* a, float b, float c);  // RVA: 0x466AC0
    static bq* lus(GameObject* gameObject, Vector2 from, Vector2 to, float time);  // RVA: 0x47E4C0
    static GameObject* czq();  // RVA: 0x46E0B0
    static bq* nhq(GameObject* a, Vector3 b, float c, bq* d);  // RVA: 0x480B60
    static float ghn(float a, float b, float c);  // RVA: 0x468FF0
    static bq* bys(GameObject* a, AudioClip* b, Vector3 c, float d);  // RVA: 0x45FF00
    static void cfa(int32_t a, Il2CppObject* b);  // RVA: 0x46B610
    static bq* myd(RectTransform* a, Vector3 b, float c, float d);  // RVA: 0x4800D0
    static bq* cbm(GameObject* a, LTSpline* b, float c);  // RVA: 0x4658E0
    static Vector3 cdd(bq* a, float b);  // RVA: 0x468940
    static bq* jjq(float a, System.Action<System.Object> b);  // RVA: 0x479950
    static bq* kwa(RectTransform* a, float b, float c);  // RVA: 0x47CD50
    static void cnn(GameObject* a, int32_t b, bool c);  // RVA: 0x46C110
    static bq* ccn(GameObject* a, float b, float c);  // RVA: 0x4679C0
    static void nys();  // RVA: 0x481D20
    static bool jjk(int32_t a, System.Action<bl> b);  // RVA: 0x4798E0
    static bool int(LTRect* a);  // RVA: 0x477DE0
    static void mvf(int32_t a, System.Action<bl> b);  // RVA: 0x47FD10
    static void hxb(Scene a, LoadSceneMode b);  // RVA: 0x476A70
    static void njx();  // RVA: 0x481250
    static bq* ccv(RectTransform* a, float b, float c);  // RVA: 0x468120
    static bq* gle(RectTransform* a, Color b, float c);  // RVA: 0x474B20
    static bq* gab(GameObject* gameObject, Vector3 from, Vector3 to, float time);  // RVA: 0x473F70
    static bq* fdn(float a, System.Action<System.Object> b);  // RVA: 0x472E90
    static bq* hyw(RectTransform* a, float b, float c);  // RVA: 0x476B00
    static float gnj(float a, float b, float c);  // RVA: 0x475080
    static bq* ivs(RectTransform* a, float b, float c);  // RVA: 0x478640
    static bq* mxb(GameObject* a, Vector2 b, float c);  // RVA: 0x47FFD0
    static bq* eov(Transform* a, Transform* b, bd c, float d, float e, float f, float g);  // RVA: 0x471D30
    static bq* hss(GameObject* a, float b, float c);  // RVA: 0x476900
    static bq* fog(GameObject* a, float b, Action* c);  // RVA: 0x473650
    static bq* cet(Transform* a, Transform* b, bd c, float d);  // RVA: 0x46A890
    static bq* yz(GameObject* a, Vector2 b, float c);  // RVA: 0x485970
    static float cdv(float a, float b, float c);  // RVA: 0x4690C0
    static bq* dai(GameObject* a, Vector3[][] b, float c);  // RVA: 0x46E2F0
    static bq* kot(GameObject* a, LTSpline* b, float c);  // RVA: 0x47C780
    static void bzk(int32_t a);  // RVA: 0x4608B0
    static bq* cbj(GameObject* a, Vector2 b, float c);  // RVA: 0x465290
    static bq* ccf(GameObject* a, Vector3 b, float c);  // RVA: 0x467350
    static bq* dvf(GameObject* a, Vector3[][] b, float c);  // RVA: 0x46FA70
    static bq* ccp(GameObject* a, float b, float c);  // RVA: 0x467B40
    static bq* description(int32_t uniqueId);  // RVA: 0x46EA60
    static float ffo(float a, float b, float c);  // RVA: 0x472F90
    static bq* value(GameObject* gameObject, System.Action<UnityEngine.Color> callOnUpdate, Color from, Color to, float time);  // RVA: 0x484E20
    static bq* kir(LTRect* a, Vector2 b, float c);  // RVA: 0x47BA60
    static bq* cxq(GameObject* a, float b, float c);  // RVA: 0x46D860
    static bq* luu(GameObject* a, float b, float c);  // RVA: 0x47E620
    void idj();  // RVA: 0x477330
    static float bnd(float a, float b, float c);  // RVA: 0x45F000
    static bool can(GameObject* a);  // RVA: 0x4632A0
    static bq* value(GameObject* gameObject, Vector2 from, Vector2 to, float time);  // RVA: 0x484A50
    static bq* dil(int32_t uniqueId);  // RVA: 0x46F350
    static void ikh(GameObject* a);  // RVA: 0x4775A0
    static bool osm(GameObject* a);  // RVA: 0x4839A0
    static float fxb(float a, float b, float c, float d);  // RVA: 0x473CE0
    static bq* ohg(GameObject* a, float b, float c);  // RVA: 0x482670
    static bq* dgh(RectTransform* a, Sprite[][] b);  // RVA: 0x46EDB0
    static void jpv(int32_t a, System.Action<bl> b);  // RVA: 0x479ED0
    static bq* alpha(RectTransform* rectTrans, float to, float time);  // RVA: 0x45D8C0
    static void nqu(GameObject* a, int32_t b);  // RVA: 0x481A50
    static float cdw(float a, float b, float c);  // RVA: 0x4690E0
    static float jsc(float a, float b, float c, float d);  // RVA: 0x479F40
    static bq* do(LTRect* a, float b, float c);  // RVA: 0x46F620
    static bq* nfx(GameObject* a, LTSpline* b, float c);  // RVA: 0x480720
    static float mpw(float a, float b, float c);  // RVA: 0x47F640
    static GameObject* cat();  // RVA: 0x4640F0
    static void lst(GameObject* a, bool b);  // RVA: 0x47E150
    static bq* msc(GameObject* a, float b, float c);  // RVA: 0x47F730
    static void ibw(int32_t a, int32_t b);  // RVA: 0x476C10
    static bq* gkc(GameObject* gameObject, System.Action<UnityEngine.Vector3> callOnUpdate, Vector3 from, Vector3 to, float time);  // RVA: 0x474A00
    static bq* cda(RectTransform* a, Vector3 b, float c);  // RVA: 0x468700
    static void bzh(int32_t a);  // RVA: 0x460230
    static bool cal(int32_t a);  // RVA: 0x463130
    static bq* hpk(GameObject* a, LTSpline* b, float c);  // RVA: 0x4765D0
    static bq* dtl(GameObject* a, Transform* b, float c);  // RVA: 0x46F800
    static bq* cbx(GameObject* a, float b, float c);  // RVA: 0x466A00
    static bq* kkg(GameObject* a, Vector3 b, float c);  // RVA: 0x47C0F0
    static bq* efc(CanvasGroup* a, float b, float c);  // RVA: 0x470AD0
    static float ceh(float a, float b, float c);  // RVA: 0x469550
    static float jlh(float a, float b, float c);  // RVA: 0x479AA0
    static void jaq(GameObject* a, int32_t b, bool c);  // RVA: 0x478800
    static float cek(float a, float b, float c, float d);  // RVA: 0x469790
    static bs* cgq(bool a);  // RVA: 0x46BE00
    static float cem(float a, float b, float c, float d);  // RVA: 0x469820
    static bq* color(RectTransform* rectTrans, Color to, float time);  // RVA: 0x46C850
    static bq* fve(RectTransform* a, Vector2 b, float c);  // RVA: 0x473990
    static bq* cbw(GameObject* a, Vector3[][] b, float c);  // RVA: 0x4666F0
    static bq* bjz(int32_t uniqueId);  // RVA: 0x45E0A0
    static bq* bis(GameObject* a, bk* b, float c);  // RVA: 0x45DE50
    static float cip(float a, float b, float c);  // RVA: 0x468C60
    static bq* hqs(GameObject* a, float b, float c);  // RVA: 0x476820
    static bq* bqr(RectTransform* a, float b, float c);  // RVA: 0x45F590
    static void mqy();  // RVA: 0x47F6E0
    static bq* ccg(GameObject* a, float b, float c);  // RVA: 0x467400
    static float cds(float a, float b, float c);  // RVA: 0x468FF0
    static float ceg(float a, float b, float c);  // RVA: 0x469490
    static void jdm(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x479280
    void Update();  // RVA: 0x45D0C0
    static bq* cca(GameObject* a, bk* b, float c);  // RVA: 0x466C40
    static bq* ftl(LTRect* a, float b, float c);  // RVA: 0x4737B0
    static bq* ca(GameObject* a, float b, float c);  // RVA: 0x462410
    static bq* nzk(GameObject* a, float b, float c);  // RVA: 0x481DE0
    static bq* emc(GameObject* gameObject, System.Action<UnityEngine.Vector2> callOnUpdate, Vector2 from, Vector2 to, float time);  // RVA: 0x471BC0
    static void dud(GameObject* a);  // RVA: 0x46F900
    static void cev(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x46ACC0
    static bq* irl(GameObject* a, float b, float c);  // RVA: 0x477FE0
    static bq* gus(GameObject* a, float b, float c);  // RVA: 0x475580
    static bq* cbb(RectTransform* a, Color b, float c);  // RVA: 0x464A90
    static bq* dhw(GameObject* a, float b, float c);  // RVA: 0x46F270
    static bq* gcf(GameObject* gameObject, float from, float to, float time);  // RVA: 0x4744F0
    static bq* color(GameObject* gameObject, Color to, float time);  // RVA: 0x46C700
    static void cab(GameObject* a, int32_t b);  // RVA: 0x462750
    static bq* oov(GameObject* a, float b, float c);  // RVA: 0x483090
    static float fs(float a, float b, float c);  // RVA: 0x468E40
    static void car(Vector3 a, Vector3 b, Vector3 c, Vector3 d, float e, Transform* f);  // RVA: 0x463750
    static bq* value(GameObject* gameObject, System.Action<System.Single,System.Object> callOnUpdate, float from, float to, float time);  // RVA: 0x484FC0
    static bq* eto(RectTransform* a, Vector3 b, float c);  // RVA: 0x472400
    static float kck(float a, float b, float c);  // RVA: 0x47B470
    static bq* ccm(LTRect* a, Vector2 b, float c);  // RVA: 0x4678D0
    static bq* fie(GameObject* gameObject, float from, float to, float time);  // RVA: 0x4730C0
    static float ivg(float a, float b, float c, float d, float e);  // RVA: 0x478410
    static bq* jui(RectTransform* a, Vector3 b, float c);  // RVA: 0x47A3E0
    static void bzt(GameObject* a, bool b);  // RVA: 0x461870
    static bq* bvg(GameObject* gameObject, Vector3 from, Vector3 to, float time);  // RVA: 0x45F930
    static float cen(float a, float b, float c, float d, float e);  // RVA: 0x4698C0
    static void bzx(int32_t a);  // RVA: 0x461E50
    static void bxv();  // RVA: 0x45FE60
    static bq* ouo(bq* seed);  // RVA: 0x483FA0
    static void xw(Scene a, LoadSceneMode b);  // RVA: 0x485550
    static float cdt(float a, float b, float c);  // RVA: 0x469010
    static float iga(float a, float b, float c);  // RVA: 0x477370
    static float lee(float a, float b, float c);  // RVA: 0x47D8A0
    static int32_t bzg();  // RVA: 0x460170
    static bq* gln(GameObject* gameObject, System.Action<UnityEngine.Vector3> callOnUpdate, Vector3 from, Vector3 to, float time);  // RVA: 0x474C40
    static bq* moy(GameObject* a, float b, float c);  // RVA: 0x47F560
    static bq* llb(AudioClip* a, Vector3 b, float c);  // RVA: 0x47DC30
    static bq* jnk(GameObject* a, AudioClip* b, Vector3 c, float d);  // RVA: 0x479B00
    static bq* ey(GameObject* a, Vector3 b, float c, bq* d);  // RVA: 0x472AF0
    static int32_t bze();  // RVA: 0x4600D0
    static void bzy(int32_t a, bool b);  // RVA: 0x461EA0
    static void ggu(LTRect* a, int32_t b);  // RVA: 0x4746B0
    static float gao(float a, float b, float c);  // RVA: 0x4740D0
    static bq* ccs(RectTransform* a, Vector3 b, float c);  // RVA: 0x467E60
    static bq* omq(GameObject* a, float b, float c);  // RVA: 0x482B40
    static bq* bdy(RectTransform* a, float b, float c);  // RVA: 0x45DBA0
    static bq* noq(GameObject* a, Vector3 b, float c);  // RVA: 0x481950
    static float eoz(float a, float b, float c, float d);  // RVA: 0x472150
    static bq* ivq(GameObject* a, Vector3 b, float c);  // RVA: 0x478590
    static void bzl();  // RVA: 0x4608F0
    static bq* haa(GameObject* gameObject, System.Action<System.Single> callOnUpdate, float from, float to, float time);  // RVA: 0x475880
    static void cah(int32_t a);  // RVA: 0x462BB0
    static bq* ddp(GameObject* gameObject, System.Action<UnityEngine.Vector3> callOnUpdate, Vector3 from, Vector3 to, float time);  // RVA: 0x46E750
    static void mne(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x47EFF0
    static Vector3[][] d(Vector3[][] a, Vector3 b);  // RVA: 0x46E170
    static bq* cpn(RectTransform* a, float b, float c);  // RVA: 0x46D070
    static bq* gz(RectTransform* a, Vector3 b, float c);  // RVA: 0x475660
    void muj();  // RVA: 0x47FCD0
    static float vd(float a, float b, float c);  // RVA: 0x468E40
    static bq* fud(GameObject* a, float b, float c);  // RVA: 0x4738B0
    static bq* mfp(GameObject* a, float b, float c);  // RVA: 0x47EB90
    static float cdl(float a, float b, float c);  // RVA: 0x468E40
    static bq* cbl(GameObject* a, bk* b, float c);  // RVA: 0x4656A0
    static float lcp(float a, float b, float c);  // RVA: 0x47D440
    static void kdt(int32_t a, int32_t b);  // RVA: 0x47B490
    static Vector3[][] cqk(Vector3[][] a, Vector3 b);  // RVA: 0x46D270
    static bq* ccc(GameObject* a, Transform* b, float c);  // RVA: 0x4670C0
    static bq* cbe(float a, System.Action<System.Object> b);  // RVA: 0x464DD0
    static int32_t dce();  // RVA: 0x46E700
    static bq* gjl(GameObject* a, float b, float c);  // RVA: 0x474920
    static Il2CppObject* czo(Il2CppString* a);  // RVA: 0x46E000
    static bq* epi(RectTransform* a, float b, float c);  // RVA: 0x4721A0
    static Vector3 ltm(Vector3 a, Vector3 b, float c);  // RVA: 0x47E340
    static bq* kok(GameObject* a, float b, float c);  // RVA: 0x47C6A0
    static void ilq(int32_t a);  // RVA: 0x477920
    static float eij(float a, float b, float c);  // RVA: 0x470E60
    static float kgw(float a, float b, float c);  // RVA: 0x47B670
    static float bgf(float a, float b, float c);  // RVA: 0x45DCB0
    static void cez(int32_t a);  // RVA: 0x46B5C0
    static float lhb(float a, float b, float c);  // RVA: 0x468E40
    static bq* lch(GameObject* a, float b, float c);  // RVA: 0x47D360
    static float iyz(float a, float b, float c);  // RVA: 0x468E40
    static float cdr(float a, float b, float c);  // RVA: 0x468F90
    static bq* ccl(GameObject* a, Vector3 b, float c);  // RVA: 0x467820
    static float orb(float a, float b, float c);  // RVA: 0x483970
    static void cty(int32_t a, bool b);  // RVA: 0x46D540
    static float hlz(float a, float b, float c, float d);  // RVA: 0x475E10
    static float le(float a, float b, float c);  // RVA: 0x47D7D0
    static bq* ogz(bq* seed);  // RVA: 0x4825F0
    static float eow(bq* a, float b);  // RVA: 0x4688E0
    static float mod(float a, float b, float c);  // RVA: 0x47F530
    static bq* alpha(LTRect* ltRect, float to, float time);  // RVA: 0x45D7D0
    static float evu(float a, float b, float c, float d, float e);  // RVA: 0x472750
    static bq* cbq(LTRect* a, Vector2 b, float c);  // RVA: 0x466220
    static GameObject* oqt();  // RVA: 0x483710
    static bq* dg(GameObject* gameObject, System.Action<UnityEngine.Vector2> callOnUpdate, Vector2 from, Vector2 to, float time);  // RVA: 0x46EC40
    static void ell(GameObject* a, int32_t b, System.Action<bl> c);  // RVA: 0x471680
    static void job(GameObject* a, int32_t b);  // RVA: 0x479C30
    static void bzd();  // RVA: 0x460030
    static bq* cau(GameObject* a, Vector3 b, float c, bq* d);  // RVA: 0x4641B0
    static Il2CppObject* hji(Il2CppString* a);  // RVA: 0x475C60
    static bq* cbn(GameObject* a, Vector3[][] b, float c);  // RVA: 0x465B20
    static bool mvg(LTRect* a);  // RVA: 0x47FD80
    static bq* fme(RectTransform* rectTrans, float to, float time);  // RVA: 0x4733A0
    static float luq(float a, float b, float c);  // RVA: 0x47E460
    static float gim(float a, float b, float c);  // RVA: 0x4748C0
    static bq* grl(RectTransform* a, float b, float c);  // RVA: 0x4750E0
    static bs* muf(bool a);  // RVA: 0x47F9C0
