// ============================================================
// Image: Cinemachine.dll
// ============================================================

// Namespace: <global>
class CinemachineCameraOffset : public CinemachineExtension
{
public:
    uint8_t pad_0000[0x30]; // 0x0000
    Vector3 m_Offset; // 0x0030
    uint8_t pad_0031[0xB]; // 0x0031
    Stage m_ApplyAfter; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    bool m_PreserveComposition; // 0x0040

    // Methods
    void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF4A400
    void .ctor();  // RVA: 0xF4A730
};

// Namespace: <global>
class CinemachineRecomposer : public CinemachineExtension
{
public:
    uint8_t pad_0000[0x30]; // 0x0000
    Stage m_ApplyAfter; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float m_Tilt; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    float m_Pan; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float m_Dutch; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    float m_ZoomScale; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float m_FollowAttachment; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    float m_LookAtAttachment; // 0x0048

    // Methods
    void Reset();  // RVA: 0xF5D4B0
    void OnValidate();  // RVA: 0xF5CF30
    void PrePipelineMutateCameraStateCallback(CinemachineVirtualCameraBase* vcam, CameraState curState, float deltaTime);  // RVA: 0xF5D490
    void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF5CF90
    void .ctor();  // RVA: 0x697550
};

// Namespace: <global>
class CinemachineTouchInputMapper : public MonoBehaviour
{
public:
    uint8_t pad_0000[0x20]; // 0x0000
    float TouchSensitivityX; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float TouchSensitivityY; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    Il2CppString* TouchXInputMapTo; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Il2CppString* TouchYInputMapTo; // 0x0030

    // Methods
    void Start();  // RVA: 0xF5D900
    float GetInputAxis(Il2CppString* axisName);  // RVA: 0xF5D820
    void .ctor();  // RVA: 0xF5D9C0
};

// Namespace: <global>
class MasterDirectorDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0xF5DCE0
    PlayableDirector* Invoke();  // RVA: 0xF5DCD0
    IAsyncResult* BeginInvoke(AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x426AA0
    PlayableDirector* EndInvoke(IAsyncResult* result);  // RVA: 0x426AD0
};

// Namespace: <global>
class CinemachineMixer : public PlayableBehaviour
{
public:
    // Static fields
    // static MasterDirectorDelegate* GetMasterPlayableDirector;

    uint8_t pad_0000[0x10]; // 0x0000
    ICameraOverrideStack* m_BrainOverrideStack; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    int32_t m_BrainOverrideId; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    bool m_PreviewPlay; // 0x001C

    // Methods
    void OnPlayableDestroy(Playable playable);  // RVA: 0xF5A0F0
    void PrepareFrame(Playable playable, FrameData info);  // RVA: 0x9CAC70
    void ProcessFrame(Playable playable, FrameData info, Il2CppObject* playerData);  // RVA: 0xF5A1C0
    float GetDeltaTime(float deltaTime);  // RVA: 0xF5A030
    void .ctor();  // RVA: 0xF5A900
};

// Namespace: <global>
class CinemachineShot : public PlayableAsset
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    Il2CppString* DisplayName; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    UnityEngine.ExposedReference<Cinemachine.CinemachineVirtualCameraBase> VirtualCamera; // 0x0020

    // Methods
    Playable CreatePlayable(PlayableGraph graph, GameObject* owner);  // RVA: 0xF5D530
    void GatherProperties(PlayableDirector* director, IPropertyCollector* driver);  // RVA: 0xF5D680
    void .ctor();  // RVA: 0x9F14D0
};

// Namespace: <global>
class CinemachineShotPlayable : public PlayableBehaviour
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    CinemachineVirtualCameraBase* VirtualCamera; // 0x0010

    // Methods
    bool get_IsValid();  // RVA: 0xF5D4E0
    void .ctor();  // RVA: 0x485B30
};

// Namespace: <global>
class CinemachineTrack : public TrackAsset
{
public:

    // Methods
    Playable CreateTrackMixer(PlayableGraph graph, GameObject* go, int32_t inputCount);  // RVA: 0xF5DA50
    void .ctor();  // RVA: 0xF5DB40
};

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class UnitySourceGeneratedAssemblyMonoScriptTypes_v1
{
public:

    // Methods
    static MonoScriptData Get();  // RVA: 0xF5EB10
    void .ctor();  // RVA: 0x427B90
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class Cinemachine3rdPersonAim : public CinemachineExtension
    {
    public:
        uint8_t pad_0000[0x30]; // 0x0000
        LayerMask AimCollisionFilter; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Il2CppString* IgnoreTag; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        float AimDistance; // 0x0040
        uint8_t pad_0041[0x7]; // 0x0041
        RectTransform* AimTargetReticle; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        Vector3 <AimTarget>k__BackingField; // 0x0050
    
        // Methods
        Vector3 get_AimTarget();  // RVA: 0xF448F0
        void set_AimTarget(Vector3 value);  // RVA: 0xF44910
        void OnValidate();  // RVA: 0xF44440
        void Reset();  // RVA: 0xF44850
        bool OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF44310
        void DrawReticle(CinemachineBrain* brain);  // RVA: 0xF43FA0
        Vector3 ComputeLookAtPoint(Vector3 camPos, Transform* player);  // RVA: 0xF43BD0
        Vector3 ComputeAimTarget(Vector3 cameraLookAt, Transform* player);  // RVA: 0xF439B0
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF44460
        void .ctor();  // RVA: 0xF448B0
    };

} // namespace Cinemachine

// Namespace: <global>
struct Instruction
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    CinemachineVirtualCameraBase* m_VirtualCamera; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float m_Hold; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CinemachineBlendDefinition m_Blend; // 0x0020
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineBlendListCamera : public CinemachineVirtualCameraBase
    {
    public:
        uint8_t pad_0000[0xA8]; // 0x0000
        Transform* m_LookAt; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        Transform* m_Follow; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        bool m_ShowDebugText; // 0x00B8
        bool m_Loop; // 0x00B9
        uint8_t pad_00BA[0x6]; // 0x00BA
        CinemachineVirtualCameraBase[][] m_ChildCameras; // 0x00C0
        uint8_t pad_00C1[0x7]; // 0x00C1
        Instruction[][] m_Instructions; // 0x00C8
        uint8_t pad_00C9[0x7]; // 0x00C9
        ICinemachineCamera* <LiveChild>k__BackingField; // 0x00D0
        uint8_t pad_00D1[0x7]; // 0x00D1
        ICinemachineCamera* m_TransitioningFrom; // 0x00D8
        uint8_t pad_00D9[0x7]; // 0x00D9
        CameraState m_State; // 0x00E0
        uint8_t pad_00E1[0xE7]; // 0x00E1
        float mActivationTime; // 0x01C8
        uint8_t pad_01C9[0x3]; // 0x01C9
        int32_t mCurrentInstruction; // 0x01CC
        uint8_t pad_01CD[0x3]; // 0x01CD
        CinemachineBlend* mActiveBlend; // 0x01D0
    
        // Methods
        Il2CppString* get_Description();  // RVA: 0xF46020
        void Reset();  // RVA: 0xF459D0
        ICinemachineCamera* get_LiveChild();  // RVA: 0x6C7E90
        void set_LiveChild(ICinemachineCamera* value);  // RVA: 0x42C3A0
        bool IsLiveChild(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF45260
        CameraState get_State();  // RVA: 0xF46180
        Transform* get_LookAt();  // RVA: 0xF46170
        void set_LookAt(Transform* value);  // RVA: 0x58CBE0
        Transform* get_Follow();  // RVA: 0xF46150
        void set_Follow(Transform* value);  // RVA: 0x58CC10
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF457A0
        void ForceCameraPosition(Vector3 pos, Quaternion rot);  // RVA: 0xF44B40
        void OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF45880
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF44C30
        void OnEnable();  // RVA: 0xF453C0
        void OnDisable();  // RVA: 0xF45290
        void OnTransformChildrenChanged();  // RVA: 0xF45220
        void OnGuiHandler();  // RVA: 0xF45620
        CinemachineVirtualCameraBase[][] get_ChildCameras();  // RVA: 0xF46000
        bool get_IsBlending();  // RVA: 0xF46160
        void InvalidateListOfChildren();  // RVA: 0xF45220
        void UpdateListOfChildren();  // RVA: 0xF45A50
        void ValidateInstructions();  // RVA: 0xF45C20
        void AdvanceCurrentInstruction(float deltaTime);  // RVA: 0xF44920
        void .ctor();  // RVA: 0xF45E70
    };

    // Namespace: Cinemachine
    class ICameraOverrideStack
    {
    public:
    
        // Methods
        int32_t SetCameraOverride(int32_t overrideId, ICinemachineCamera* camA, ICinemachineCamera* camB, float weightB, float deltaTime);
        void ReleaseCameraOverride(int32_t overrideId);  // RVA: 0x26E4D0
        Vector3 get_DefaultWorldUp();
    };

} // namespace Cinemachine

// Namespace: <global>
struct UpdateMethod
{
public:
    // Static fields
    // static UpdateMethod FixedUpdate;
    // static UpdateMethod LateUpdate;
    // static UpdateMethod SmartUpdate;
    // static UpdateMethod ManualUpdate;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct BrainUpdateMethod
{
public:
    // Static fields
    // static BrainUpdateMethod FixedUpdate;
    // static BrainUpdateMethod LateUpdate;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class BrainEvent : public UnityEvent`1
{
public:

    // Methods
    void .ctor();  // RVA: 0xF43840
};

// Namespace: <global>
class VcamActivatedEvent : public UnityEvent`2
{
public:

    // Methods
    void .ctor();  // RVA: 0xF5EBF0
};

// Namespace: <global>
class BrainFrame
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t id; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    CinemachineBlend* blend; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CinemachineBlend* workingBlend; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    BlendSourceVirtualCamera* workingBlendSource; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float deltaTimeOverride; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float blendStartPosition; // 0x0034

    // Methods
    bool get_Active();  // RVA: 0xF43990
    void .ctor();  // RVA: 0xF43880
};

// Namespace: <global>
class <AfterPhysics>d__38
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CinemachineBrain* <>4__this; // 0x0020

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x492D30
    void System.IDisposable.Dispose();  // RVA: 0x4160A0
    bool MoveNext();  // RVA: 0xF5E910
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x42A480
    void System.Collections.IEnumerator.Reset();  // RVA: 0xF5EA40
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x42A480
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineBrain : public MonoBehaviour
    {
    public:
        // Static fields
        // static ICinemachineCamera* mSoloCamera;
        // static AnimationCurve* mDefaultLinearAnimationCurve;
    
        uint8_t pad_0000[0x20]; // 0x0000
        bool m_ShowDebugText; // 0x0020
        bool m_ShowCameraFrustum; // 0x0021
        bool m_IgnoreTimeScale; // 0x0022
        uint8_t pad_0023[0x5]; // 0x0023
        Transform* m_WorldUpOverride; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        UpdateMethod m_UpdateMethod; // 0x0030
        uint8_t pad_0031[0x3]; // 0x0031
        BrainUpdateMethod m_BlendUpdateMethod; // 0x0034
        uint8_t pad_0035[0x3]; // 0x0035
        CinemachineBlendDefinition m_DefaultBlend; // 0x0038
        uint8_t pad_0039[0xF]; // 0x0039
        CinemachineBlenderSettings* m_CustomBlends; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        Camera* m_OutputCamera; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        GameObject* m_TargetOverride; // 0x0058
        uint8_t pad_0059[0x7]; // 0x0059
        BrainEvent* m_CameraCutEvent; // 0x0060
        uint8_t pad_0061[0x7]; // 0x0061
        VcamActivatedEvent* m_CameraActivatedEvent; // 0x0068
        uint8_t pad_0069[0x7]; // 0x0069
        Coroutine* mPhysicsCoroutine; // 0x0070
        uint8_t pad_0071[0x7]; // 0x0071
        int32_t m_LastFrameUpdated; // 0x0078
        uint8_t pad_0079[0x7]; // 0x0079
        WaitForFixedUpdate* mWaitForFixedUpdate; // 0x0080
        uint8_t pad_0081[0x7]; // 0x0081
        System.Collections.Generic.List<Cinemachine.CinemachineBrain.BrainFrame> mFrameStack; // 0x0088
        uint8_t pad_0089[0x7]; // 0x0089
        int32_t mNextFrameId; // 0x0090
        uint8_t pad_0091[0x7]; // 0x0091
        CinemachineBlend* mCurrentLiveCameras; // 0x0098
        uint8_t pad_0099[0x7]; // 0x0099
        ICinemachineCamera* mActiveCameraPreviousFrame; // 0x00A0
        uint8_t pad_00A1[0x7]; // 0x00A1
        GameObject* mActiveCameraPreviousFrameGameObject; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        CameraState <CurrentCameraState>k__BackingField; // 0x00B0
    
        // Methods
        Camera* get_OutputCamera();  // RVA: 0xF49FA0
        GameObject* get_ControlledObject();  // RVA: 0xF49D80
        void set_ControlledObject(GameObject* value);  // RVA: 0xF4A170
        static ICinemachineCamera* get_SoloCamera();  // RVA: 0xF4A070
        static void set_SoloCamera(ICinemachineCamera* value);  // RVA: 0xF4A2A0
        static Color GetSoloGUIColor();  // RVA: 0xF46BC0
        Vector3 get_DefaultWorldUp();  // RVA: 0xF49EA0
        void OnEnable();  // RVA: 0xF47570
        void OnDisable();  // RVA: 0xF47310
        void OnSceneLoaded(Scene scene, LoadSceneMode mode);  // RVA: 0xF47C90
        void OnSceneUnloaded(Scene scene);  // RVA: 0xF47CF0
        void Awake();  // RVA: 0xF46290
        void Start();  // RVA: 0xF48C80
        void OnGuiHandler();  // RVA: 0xF47940
        IEnumerator* AfterPhysics();  // RVA: 0xF46220
        void LateUpdate();  // RVA: 0xF46EF0
        void ManualUpdate();  // RVA: 0xF470E0
        float GetEffectiveDeltaTime(bool fixedDelta);  // RVA: 0xF469A0
        void UpdateVirtualCameras(UpdateFilter updateFilter, float deltaTime);  // RVA: 0xF49580
        ICinemachineCamera* get_ActiveVirtualCamera();  // RVA: 0xF49BD0
        static ICinemachineCamera* DeepCamBFromBlend(CinemachineBlend* blend);  // RVA: 0xF467D0
        bool IsLiveInBlend(ICinemachineCamera* vcam);  // RVA: 0xF46BE0
        bool get_IsBlending();  // RVA: 0xF49F80
        CinemachineBlend* get_ActiveBlend();  // RVA: 0xF49AF0
        void set_ActiveBlend(CinemachineBlend* value);  // RVA: 0xF4A0C0
        int32_t GetBrainFrame(int32_t withId);  // RVA: 0xF46880
        int32_t SetCameraOverride(int32_t overrideId, ICinemachineCamera* camA, ICinemachineCamera* camB, float weightB, float deltaTime);  // RVA: 0xF48920
        void ReleaseCameraOverride(int32_t overrideId);  // RVA: 0xF48850
        void ProcessActiveCamera(float deltaTime);  // RVA: 0xF47D50
        void UpdateFrame0(float deltaTime);  // RVA: 0xF48E40
        void ComputeCurrentBlend(CinemachineBlend* outputBlend, int32_t numTopLayersToExclude);  // RVA: 0xF462F0
        bool IsLive(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF46D20
        CameraState get_CurrentCameraState();  // RVA: 0xF49E00
        void set_CurrentCameraState(CameraState value);  // RVA: 0xF4A1F0
        ICinemachineCamera* TopCameraFromPriorityQueue();  // RVA: 0xF48CA0
        CinemachineBlendDefinition LookupBlend(ICinemachineCamera* fromKey, ICinemachineCamera* toKey);  // RVA: 0xF46F00
        void PushStateToUnityCamera(CameraState state);  // RVA: 0xF48380
        void .ctor();  // RVA: 0xF498E0
        static void .cctor();  // RVA: 0xF49870
    };

} // namespace Cinemachine

// Namespace: <global>
struct Pair
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t a; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float b; // 0x0014
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static System.Comparison<Cinemachine.CinemachineClearShot.Pair> <>9__49_0;


    // Methods
    static void .cctor();  // RVA: 0xF5EAA0
    void .ctor();  // RVA: 0x427B90
    int32_t <Randomize>b__49_0(Pair p1, Pair p2);  // RVA: 0xF5EA80
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineClearShot : public CinemachineVirtualCameraBase
    {
    public:
        uint8_t pad_0000[0xA8]; // 0x0000
        Transform* m_LookAt; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        Transform* m_Follow; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        bool m_ShowDebugText; // 0x00B8
        uint8_t pad_00B9[0x7]; // 0x00B9
        CinemachineVirtualCameraBase[][] m_ChildCameras; // 0x00C0
        uint8_t pad_00C1[0x7]; // 0x00C1
        float m_ActivateAfter; // 0x00C8
        uint8_t pad_00C9[0x3]; // 0x00C9
        float m_MinDuration; // 0x00CC
        uint8_t pad_00CD[0x3]; // 0x00CD
        bool m_RandomizeChoice; // 0x00D0
        uint8_t pad_00D1[0x7]; // 0x00D1
        CinemachineBlendDefinition m_DefaultBlend; // 0x00D8
        uint8_t pad_00D9[0xF]; // 0x00D9
        CinemachineBlenderSettings* m_CustomBlends; // 0x00E8
        uint8_t pad_00E9[0x7]; // 0x00E9
        ICinemachineCamera* <LiveChild>k__BackingField; // 0x00F0
        uint8_t pad_00F1[0x7]; // 0x00F1
        CameraState m_State; // 0x00F8
        uint8_t pad_00F9[0xE7]; // 0x00F9
        float mActivationTime; // 0x01E0
        uint8_t pad_01E1[0x3]; // 0x01E1
        float mPendingActivationTime; // 0x01E4
        uint8_t pad_01E5[0x3]; // 0x01E5
        ICinemachineCamera* mPendingCamera; // 0x01E8
        uint8_t pad_01E9[0x7]; // 0x01E9
        CinemachineBlend* mActiveBlend; // 0x01F0
        uint8_t pad_01F1[0x7]; // 0x01F1
        bool mRandomizeNow; // 0x01F8
        uint8_t pad_01F9[0x7]; // 0x01F9
        CinemachineVirtualCameraBase[][] m_RandomizedChilden; // 0x0200
        uint8_t pad_0201[0x7]; // 0x0201
        ICinemachineCamera* m_TransitioningFrom; // 0x0208
    
        // Methods
        Il2CppString* get_Description();  // RVA: 0xF4C820
        ICinemachineCamera* get_LiveChild();  // RVA: 0x7F9630
        void set_LiveChild(ICinemachineCamera* value);  // RVA: 0x97A0D0
        CameraState get_State();  // RVA: 0xF4C960
        bool IsLiveChild(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF4B790
        Transform* get_LookAt();  // RVA: 0xF46170
        void set_LookAt(Transform* value);  // RVA: 0x58CBE0
        Transform* get_Follow();  // RVA: 0xF46150
        void set_Follow(Transform* value);  // RVA: 0x58CC10
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF4BEB0
        void ForceCameraPosition(Vector3 pos, Quaternion rot);  // RVA: 0xF4B000
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF4B0F0
        void OnEnable();  // RVA: 0xF4BAD0
        void OnDisable();  // RVA: 0xF4B9A0
        void OnTransformChildrenChanged();  // RVA: 0xF4BF90
        void OnGuiHandler();  // RVA: 0xF4BD30
        bool get_IsBlending();  // RVA: 0xF4C950
        CinemachineBlend* get_ActiveBlend();  // RVA: 0x945ED0
        CinemachineVirtualCameraBase[][] get_ChildCameras();  // RVA: 0xF4C800
        void InvalidateListOfChildren();  // RVA: 0xF4B730
        void ResetRandomization();  // RVA: 0xF4C3F0
        void UpdateListOfChildren();  // RVA: 0xF4C420
        ICinemachineCamera* ChooseCurrentCamera(Vector3 worldUp);  // RVA: 0xF4A790
        CinemachineVirtualCameraBase[][] Randomize(CinemachineVirtualCameraBase[][] src);  // RVA: 0xF4C110
        CinemachineBlendDefinition LookupBlend(ICinemachineCamera* fromKey, ICinemachineCamera* toKey);  // RVA: 0xF4B7C0
        void OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF4C000
        void .ctor();  // RVA: 0xF4C640
    };

} // namespace Cinemachine

// Namespace: <global>
struct ResolutionStrategy
{
public:
    // Static fields
    // static ResolutionStrategy PullCameraForward;
    // static ResolutionStrategy PreserveCameraHeight;
    // static ResolutionStrategy PreserveCameraDistance;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class VcamExtraState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 previousDisplacement; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    Vector3 previousCameraOffset; // 0x001C
    uint8_t pad_001D[0xB]; // 0x001D
    Vector3 previousCameraPosition; // 0x0028
    uint8_t pad_0029[0xB]; // 0x0029
    float previousDampTime; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    bool targetObscured; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float occlusionStartTime; // 0x003C
    uint8_t pad_003D[0x3]; // 0x003D
    System.Collections.Generic.List<UnityEngine.Vector3> debugResolutionPath; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    float m_SmoothedDistance; // 0x0048
    uint8_t pad_0049[0x3]; // 0x0049
    float m_SmoothedTime; // 0x004C

    // Methods
    void AddPointToDebugPath(Vector3 p);  // RVA: 0x4160A0
    float ApplyDistanceSmoothing(float distance, float smoothingTime);  // RVA: 0xF5EC30
    void UpdateDistanceSmoothing(float distance);  // RVA: 0xF5ED30
    void ResetDistanceSmoothing(float smoothingTime);  // RVA: 0xF5ECC0
    void .ctor();  // RVA: 0x427B90
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineCollider : public CinemachineExtension
    {
    public:
        // Static fields
        // static float k_PrecisionSlush;
        // static float k_AngleThreshold;
        // static Collider[][] s_ColliderBuffer;
    
        uint8_t pad_0000[0x30]; // 0x0000
        LayerMask m_CollideAgainst; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Il2CppString* m_IgnoreTag; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        LayerMask m_TransparentLayers; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        float m_MinimumDistanceFromTarget; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        bool m_AvoidObstacles; // 0x0048
        uint8_t pad_0049[0x3]; // 0x0049
        float m_DistanceLimit; // 0x004C
        uint8_t pad_004D[0x3]; // 0x004D
        float m_MinimumOcclusionTime; // 0x0050
        uint8_t pad_0051[0x3]; // 0x0051
        float m_CameraRadius; // 0x0054
        uint8_t pad_0055[0x3]; // 0x0055
        ResolutionStrategy m_Strategy; // 0x0058
        uint8_t pad_0059[0x3]; // 0x0059
        int32_t m_MaximumEffort; // 0x005C
        uint8_t pad_005D[0x3]; // 0x005D
        float m_SmoothingTime; // 0x0060
        uint8_t pad_0061[0x3]; // 0x0061
        float m_Damping; // 0x0064
        uint8_t pad_0065[0x3]; // 0x0065
        float m_DampingWhenOccluded; // 0x0068
        uint8_t pad_0069[0x3]; // 0x0069
        float m_OptimalTargetDistance; // 0x006C
        uint8_t pad_006D[0x3]; // 0x006D
        RaycastHit[][] m_CornerBuffer; // 0x0070
    
        // Methods
        bool IsTargetObscured(ICinemachineCamera* vcam);  // RVA: 0xF4E4C0
        bool CameraWasDisplaced(ICinemachineCamera* vcam);  // RVA: 0xF4CA00
        float GetCameraDisplacementDistance(ICinemachineCamera* vcam);  // RVA: 0xF4D8B0
        void OnValidate();  // RVA: 0xF4EBC0
        void OnDestroy();  // RVA: 0xF4EAA0
        System.Collections.Generic.List<System.Collections.Generic.List<UnityEngine.Vector3>> get_DebugPaths();  // RVA: 0xF51C40
        float GetMaxDampTime();  // RVA: 0xF4D910
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF4EAF0
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF4EC10
        Vector3 PreserveLineOfSight(CameraState state, VcamExtraState* extra);  // RVA: 0xF4FCB0
        Vector3 PullCameraInFrontOfNearestObstacle(Vector3 cameraPos, Vector3 lookAtPos, int32_t layerMask, RaycastHit hitInfo);  // RVA: 0xF501B0
        Vector3 PushCameraBack(Vector3 currentPos, Vector3 pushDir, RaycastHit obstacle, Vector3 lookAtPos, Plane startPlane, float targetDistance, int32_t iterations, VcamExtraState* extra);  // RVA: 0xF506B0
        bool GetWalkingDirection(Vector3 pos, Vector3 pushDir, RaycastHit obstacle, Vector3 outDir);  // RVA: 0xF4DBB0
        float GetPushBackDistance(Ray ray, Plane startPlane, float targetDistance, Vector3 lookAtPos);  // RVA: 0xF4D930
        static float ClampRayToBounds(Ray ray, float distance, Bounds bounds);  // RVA: 0xF4CE00
        Vector3 RespectCameraRadius(Vector3 cameraPos, Vector3 lookAtPos);  // RVA: 0xF51050
        bool CheckForTargetObstructions(CameraState state);  // RVA: 0xF4CA70
        static bool IsTargetOffscreen(CameraState state);  // RVA: 0xF4E520
        void .ctor();  // RVA: 0xF51B90
        static void .cctor();  // RVA: 0xF51B20
    };

} // namespace Cinemachine

// Namespace: <global>
struct Mode
{
public:
    // Static fields
    // static Mode Confine2D;
    // static Mode Confine3D;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class VcamExtraState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 m_previousDisplacement; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    float confinerDisplacement; // 0x001C

    // Methods
    void .ctor();  // RVA: 0x427B90
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineConfiner : public CinemachineExtension
    {
    public:
        uint8_t pad_0000[0x30]; // 0x0000
        Mode m_ConfineMode; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Collider* m_BoundingVolume; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        Collider2D* m_BoundingShape2D; // 0x0040
        uint8_t pad_0041[0x7]; // 0x0041
        Collider2D* m_BoundingShape2DCache; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        bool m_ConfineScreenEdges; // 0x0050
        uint8_t pad_0051[0x3]; // 0x0051
        float m_Damping; // 0x0054
        uint8_t pad_0055[0x3]; // 0x0055
        System.Collections.Generic.List<System.Collections.Generic.List<UnityEngine.Vector2>> m_pathCache; // 0x0058
        uint8_t pad_0059[0x7]; // 0x0059
        int32_t m_pathTotalPointCount; // 0x0060
    
        // Methods
        bool CameraWasDisplaced(CinemachineVirtualCameraBase* vcam);  // RVA: 0xF52790
        float GetCameraDisplacementDistance(CinemachineVirtualCameraBase* vcam);  // RVA: 0xF532F0
        void OnValidate();  // RVA: 0xF533A0
        void ConnectToVcam(bool connect);  // RVA: 0xF532E0
        bool get_IsValid();  // RVA: 0xF53CF0
        float GetMaxDampTime();  // RVA: 0xF53350
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF533B0
        void InvalidatePathCache();  // RVA: 0xF53360
        bool ValidatePathCache();  // RVA: 0xF53760
        Vector3 ConfinePoint(Vector3 camPos);  // RVA: 0xF52800
        Vector3 ConfineScreenEdges(CameraState state);  // RVA: 0xF52D10
        void .ctor();  // RVA: 0xF53CE0
    };

} // namespace Cinemachine

// Namespace: <global>
class VcamExtraState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 m_PreviousDisplacement; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    Vector3 m_DampedDisplacement; // 0x001C
    uint8_t pad_001D[0xB]; // 0x001D
    BakedSolution* m_BakedSolution; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    CinemachineVirtualCameraBase* m_vcam; // 0x0030

    // Methods
    void .ctor();  // RVA: 0x427B90
};

// Namespace: <global>
struct ShapeCache
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ConfinerOven* m_confinerOven; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    System.Collections.Generic.List<System.Collections.Generic.List<UnityEngine.Vector2>> m_OriginalPath; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Matrix4x4 m_DeltaWorldToBaked; // 0x0020
    uint8_t pad_0021[0x3F]; // 0x0021
    Matrix4x4 m_DeltaBakedToWorld; // 0x0060
    uint8_t pad_0061[0x3F]; // 0x0061
    float m_aspectRatio; // 0x00A0
    uint8_t pad_00A1[0x3]; // 0x00A1
    float m_maxWindowSize; // 0x00A4
    uint8_t pad_00A5[0x3]; // 0x00A5
    float m_skeletonPadding; // 0x00A8
    uint8_t pad_00A9[0x3]; // 0x00A9
    float m_maxComputationTimePerFrameInSeconds; // 0x00AC
    uint8_t pad_00AD[0x3]; // 0x00AD
    Matrix4x4 m_bakedToWorld; // 0x00B0
    uint8_t pad_00B1[0x3F]; // 0x00B1
    Collider2D* m_boundingShape2D; // 0x00F0

    // Methods
    void Invalidate();  // RVA: 0xF5DF80
    bool ValidateCache(Collider2D* boundingShape2D, float maxWindowSize, float aspectRatio, float skeletonPadding, bool confinerStateChanged);  // RVA: 0xF5E1B0
    bool IsValid(Collider2D* boundingShape2D, float aspectRatio, float maxOrthoSize, float padding);  // RVA: 0xF5E050
    void CalculateDeltaTransformationMatrix();  // RVA: 0xF5DDA0
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineConfiner2D : public CinemachineExtension
    {
    public:
        // Static fields
        // static float k_cornerAngleTreshold;
    
        uint8_t pad_0000[0x30]; // 0x0000
        Collider2D* m_BoundingShape2D; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        float m_Damping; // 0x0038
        uint8_t pad_0039[0x3]; // 0x0039
        float m_MaxWindowSize; // 0x003C
        uint8_t pad_003D[0x3]; // 0x003D
        float m_Padding; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        float m_MaxComputationTimePerFrameInSeconds; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        ShapeCache m_shapeCache; // 0x0048
    
        // Methods
        void InvalidateCache();  // RVA: 0xF51EB0
        bool ValidateCache(float cameraAspectRatio);  // RVA: 0xF52730
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF51EE0
        float CalculateHalfFrustumHeight(CameraState state, float cameraPosLocalZ);  // RVA: 0xF51DF0
        void OnValidate();  // RVA: 0xF51EC0
        void Reset();  // RVA: 0xF52720
        void .ctor();  // RVA: 0xF52780
    };

} // namespace Cinemachine

// Namespace: <global>
struct UpdateMethod
{
public:
    // Static fields
    // static UpdateMethod Update;
    // static UpdateMethod FixedUpdate;
    // static UpdateMethod LateUpdate;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineDollyCart : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        CinemachinePathBase* m_Path; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        UpdateMethod m_UpdateMethod; // 0x0028
        uint8_t pad_0029[0x3]; // 0x0029
        PositionUnits m_PositionUnits; // 0x002C
        uint8_t pad_002D[0x3]; // 0x002D
        float m_Speed; // 0x0030
        uint8_t pad_0031[0x3]; // 0x0031
        float m_Position; // 0x0034
    
        // Methods
        void FixedUpdate();  // RVA: 0xF53E20
        void Update();  // RVA: 0xF54060
        void LateUpdate();  // RVA: 0xF53E70
        void SetCartPosition(float distanceAlongPath);  // RVA: 0xF53F20
        void .ctor();  // RVA: 0xF54100
    };

    // Namespace: Cinemachine
    class CinemachineExternalCamera : public CinemachineVirtualCameraBase
    {
    public:
        uint8_t pad_0000[0xA8]; // 0x0000
        Transform* m_LookAt; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        Camera* m_Camera; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        CameraState m_State; // 0x00B8
        uint8_t pad_00B9[0xE7]; // 0x00B9
        Transform* <Follow>k__BackingField; // 0x01A0
        uint8_t pad_01A1[0x7]; // 0x01A1
        BlendHint m_BlendHint; // 0x01A8
    
        // Methods
        CameraState get_State();  // RVA: 0xF54A10
        Transform* get_LookAt();  // RVA: 0x589F00
        void set_LookAt(Transform* value);  // RVA: 0x58CBE0
        Transform* get_Follow();  // RVA: 0x98D440
        void set_Follow(Transform* value);  // RVA: 0xF54AB0
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF54110
        void .ctor();  // RVA: 0xF54890
    };

} // namespace Cinemachine

// Namespace: <global>
class VcamExtraState
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float m_previousFrameZoom; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x427B90
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineFollowZoom : public CinemachineExtension
    {
    public:
        uint8_t pad_0000[0x30]; // 0x0000
        float m_Width; // 0x0030
        uint8_t pad_0031[0x3]; // 0x0031
        float m_Damping; // 0x0034
        uint8_t pad_0035[0x3]; // 0x0035
        float m_MinFOV; // 0x0038
        uint8_t pad_0039[0x3]; // 0x0039
        float m_MaxFOV; // 0x003C
    
        // Methods
        void OnValidate();  // RVA: 0xF54AD0
        float GetMaxDampTime();  // RVA: 0x7BE750
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF54B30
        void .ctor();  // RVA: 0xF54F00
    };

} // namespace Cinemachine

// Namespace: <global>
struct Orbit
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float m_Height; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float m_Radius; // 0x0014

    // Methods
    void .ctor(float h, float r);  // RVA: 0xF5DD90
};

// Namespace: <global>
class CreateRigDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0xF5DBB0
    CinemachineVirtualCamera* Invoke(CinemachineFreeLook* vcam, Il2CppString* name, CinemachineVirtualCamera* copyFrom);  // RVA: 0xF5DB90
    IAsyncResult* BeginInvoke(CinemachineFreeLook* vcam, Il2CppString* name, CinemachineVirtualCamera* copyFrom, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x801D60
    CinemachineVirtualCamera* EndInvoke(IAsyncResult* result);  // RVA: 0x426AD0
};

// Namespace: <global>
class DestroyRigDelegate : public MulticastDelegate
{
public:

    // Methods
    void .ctor(Il2CppObject* object, intptr_t method);  // RVA: 0x4166D0
    void Invoke(GameObject* rig);  // RVA: 0x416250
    IAsyncResult* BeginInvoke(GameObject* rig, AsyncCallback* callback, Il2CppObject* object);  // RVA: 0x453BA0
    void EndInvoke(IAsyncResult* result);  // RVA: 0x426AD0
};

// Namespace: <global>
struct <>c__DisplayClass47_0
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    CinemachineFreeLook* <>4__this; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector3 cameraOffset; // 0x0018
};

// Namespace: <global>
struct <>c__DisplayClass47_1
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    float bestAngle; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    float best; // 0x0014
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineFreeLook : public CinemachineVirtualCameraBase
    {
    public:
        // Static fields
        // static CreateRigDelegate* CreateRigOverride;
        // static DestroyRigDelegate* DestroyRigOverride;
    
        uint8_t pad_0000[0xA8]; // 0x0000
        Transform* m_LookAt; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        Transform* m_Follow; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        bool m_CommonLens; // 0x00B8
        uint8_t pad_00B9[0x3]; // 0x00B9
        LensSettings m_Lens; // 0x00BC
        uint8_t pad_00BD[0x33]; // 0x00BD
        TransitionParams m_Transitions; // 0x00F0
        uint8_t pad_00F1[0xF]; // 0x00F1
        BlendHint m_LegacyBlendHint; // 0x0100
        uint8_t pad_0101[0x7]; // 0x0101
        AxisState m_YAxis; // 0x0108
        uint8_t pad_0109[0x6F]; // 0x0109
        Recentering m_YAxisRecentering; // 0x0178
        uint8_t pad_0179[0x1F]; // 0x0179
        AxisState m_XAxis; // 0x0198
        uint8_t pad_0199[0x6F]; // 0x0199
        Heading m_Heading; // 0x0208
        uint8_t pad_0209[0xB]; // 0x0209
        Recentering m_RecenterToTargetHeading; // 0x0214
        uint8_t pad_0215[0x1F]; // 0x0215
        BindingMode m_BindingMode; // 0x0234
        uint8_t pad_0235[0x3]; // 0x0235
        float m_SplineCurvature; // 0x0238
        uint8_t pad_0239[0x7]; // 0x0239
        Orbit[][] m_Orbits; // 0x0240
        uint8_t pad_0241[0x7]; // 0x0241
        float m_LegacyHeadingBias; // 0x0248
        uint8_t pad_0249[0x3]; // 0x0249
        bool mUseLegacyRigDefinitions; // 0x024C
        bool mIsDestroyed; // 0x024D
        uint8_t pad_024E[0x2]; // 0x024E
        CameraState m_State; // 0x0250
        uint8_t pad_0251[0xE7]; // 0x0251
        CinemachineVirtualCamera[][] m_Rigs; // 0x0338
        uint8_t pad_0339[0x7]; // 0x0339
        CinemachineOrbitalTransposer[][] mOrbitals; // 0x0340
        uint8_t pad_0341[0x7]; // 0x0341
        CinemachineBlend* mBlendA; // 0x0348
        uint8_t pad_0349[0x7]; // 0x0349
        CinemachineBlend* mBlendB; // 0x0350
        uint8_t pad_0351[0x7]; // 0x0351
        float m_CachedXAxisHeading; // 0x0358
        uint8_t pad_0359[0x3]; // 0x0359
        float m_LastHeadingUpdateFrame; // 0x035C
        uint8_t pad_035D[0x3]; // 0x035D
        Orbit[][] m_CachedOrbits; // 0x0360
        uint8_t pad_0361[0x7]; // 0x0361
        float m_CachedTension; // 0x0368
        uint8_t pad_0369[0x7]; // 0x0369
        Vector4[][] m_CachedKnots; // 0x0370
        uint8_t pad_0371[0x7]; // 0x0371
        Vector4[][] m_CachedCtrl1; // 0x0378
        uint8_t pad_0379[0x7]; // 0x0379
        Vector4[][] m_CachedCtrl2; // 0x0380
    
        // Methods
        void OnValidate();  // RVA: 0xF57FB0
        CinemachineVirtualCamera* GetRig(int32_t i);  // RVA: 0xF565C0
        bool get_RigsAreCreated();  // RVA: 0xF59E60
        static String[][] get_RigNames();  // RVA: 0xF59D90
        void OnEnable();  // RVA: 0xF579C0
        void UpdateInputAxisProvider();  // RVA: 0xF591D0
        void OnDestroy();  // RVA: 0xF57880
        void OnTransformChildrenChanged();  // RVA: 0xF57200
        void Reset();  // RVA: 0xF587C0
        bool get_PreviousStateIsValid();  // RVA: 0x45A6E0
        void set_PreviousStateIsValid(bool value);  // RVA: 0xF59F20
        CameraState get_State();  // RVA: 0xF59E80
        Transform* get_LookAt();  // RVA: 0xF46170
        void set_LookAt(Transform* value);  // RVA: 0x58CBE0
        Transform* get_Follow();  // RVA: 0xF46150
        void set_Follow(Transform* value);  // RVA: 0x58CC10
        bool IsLiveChild(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF57220
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF57A70
        void ForceCameraPosition(Vector3 pos, Quaternion rot);  // RVA: 0xF56110
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF56AA0
        void OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF57B50
        bool RequiresUserInput();  // RVA: 0x53A800
        float GetYAxisClosestValue(Vector3 cameraPos, Vector3 up);  // RVA: 0xF56620
        float SteepestDescent(Vector3 cameraOffset);  // RVA: 0xF587E0
        void InvalidateRigCache();  // RVA: 0xF57200
        void DestroyRigs();  // RVA: 0xF55BF0
        CinemachineVirtualCamera[][] CreateRigs(CinemachineVirtualCamera[][] copyFrom);  // RVA: 0xF551E0
        bool UpdateRigCache();  // RVA: 0xF59250
        System.Collections.Generic.List<Cinemachine.CinemachineVirtualCamera> LocateExistingRigs(bool forceOrbital);  // RVA: 0xF57330
        float UpdateXAxisHeading(CinemachineOrbitalTransposer* orbital, float deltaTime, Vector3 up);  // RVA: 0xF59640
        void PushSettingsToRigs();  // RVA: 0xF580F0
        float GetYAxisValue();  // RVA: 0xF56A70
        CameraState CalculateNewState(Vector3 worldUp, float deltaTime);  // RVA: 0xF54F30
        Vector3 GetLocalPositionForCameraFromInput(float t);  // RVA: 0xF56330
        void UpdateCachedSpline();  // RVA: 0xF58C80
        void OnBeforeSerialize();  // RVA: 0xF577B0
        void .ctor();  // RVA: 0xF59810
        float <SteepestDescent>g__AngleFunction|47_0(float input, <>c__DisplayClass47_0 param1);  // RVA: 0xF58A00
        float <SteepestDescent>g__SlopeOfAngleFunction|47_1(float input, <>c__DisplayClass47_0 param1);  // RVA: 0xF58C10
        float <SteepestDescent>g__InitialGuess|47_2(<>c__DisplayClass47_0 param0);  // RVA: 0xF58B00
        void <SteepestDescent>g__ChooseBestAngle|47_3(float referenceAngle, <>c__DisplayClass47_0 param1, <>c__DisplayClass47_1 param2);  // RVA: 0xF58AC0
    };

    // Namespace: Cinemachine
    class CinemachineMixingCamera : public CinemachineVirtualCameraBase
    {
    public:
        // Static fields
        // static int32_t MaxCameras;
    
        uint8_t pad_0000[0xA8]; // 0x0000
        float m_Weight0; // 0x00A8
        uint8_t pad_00A9[0x3]; // 0x00A9
        float m_Weight1; // 0x00AC
        uint8_t pad_00AD[0x3]; // 0x00AD
        float m_Weight2; // 0x00B0
        uint8_t pad_00B1[0x3]; // 0x00B1
        float m_Weight3; // 0x00B4
        uint8_t pad_00B5[0x3]; // 0x00B5
        float m_Weight4; // 0x00B8
        uint8_t pad_00B9[0x3]; // 0x00B9
        float m_Weight5; // 0x00BC
        uint8_t pad_00BD[0x3]; // 0x00BD
        float m_Weight6; // 0x00C0
        uint8_t pad_00C1[0x3]; // 0x00C1
        float m_Weight7; // 0x00C4
        uint8_t pad_00C5[0x3]; // 0x00C5
        CameraState m_State; // 0x00C8
        uint8_t pad_00C9[0xE7]; // 0x00C9
        ICinemachineCamera* <LiveChild>k__BackingField; // 0x01B0
        uint8_t pad_01B1[0x7]; // 0x01B1
        Transform* <LookAt>k__BackingField; // 0x01B8
        uint8_t pad_01B9[0x7]; // 0x01B9
        Transform* <Follow>k__BackingField; // 0x01C0
        uint8_t pad_01C1[0x7]; // 0x01C1
        CinemachineVirtualCameraBase[][] m_ChildCameras; // 0x01C8
        uint8_t pad_01C9[0x7]; // 0x01C9
        System.Collections.Generic.Dictionary<Cinemachine.CinemachineVirtualCameraBase,System.Int32> m_indexMap; // 0x01D0
    
        // Methods
        float GetWeight(int32_t index);  // RVA: 0xF5AC50
        void SetWeight(int32_t index, float w);  // RVA: 0xF5BA90
        float GetWeight(CinemachineVirtualCameraBase* vcam);  // RVA: 0xF5AA00
        void SetWeight(CinemachineVirtualCameraBase* vcam, float w);  // RVA: 0xF5B810
        ICinemachineCamera* get_LiveChild();  // RVA: 0x98D470
        void set_LiveChild(ICinemachineCamera* value);  // RVA: 0x935CE0
        CameraState get_State();  // RVA: 0xF5C040
        Transform* get_LookAt();  // RVA: 0x98D480
        void set_LookAt(Transform* value);  // RVA: 0xF5C100
        Transform* get_Follow();  // RVA: 0x98D120
        void set_Follow(Transform* value);  // RVA: 0xF5C0E0
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF5B580
        void ForceCameraPosition(Vector3 pos, Quaternion rot);  // RVA: 0xF5A910
        void OnEnable();  // RVA: 0xF5B520
        void OnTransformChildrenChanged();  // RVA: 0xF5B420
        void OnValidate();  // RVA: 0xF5B7B0
        bool IsLiveChild(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF5B480
        CinemachineVirtualCameraBase[][] get_ChildCameras();  // RVA: 0xF5C020
        void InvalidateListOfChildren();  // RVA: 0xF5B420
        void ValidateListOfChildren();  // RVA: 0xF5BC00
        void OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF5B660
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF5AD80
        void .ctor();  // RVA: 0xF5BE50
    };

} // namespace Cinemachine

// Namespace: <global>
struct Waypoint
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 position; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    Vector3 tangent; // 0x001C
    uint8_t pad_001D[0xB]; // 0x001D
    float roll; // 0x0028
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachinePath : public CinemachinePathBase
    {
    public:
        uint8_t pad_0000[0x50]; // 0x0000
        bool m_Looped; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        Waypoint[][] m_Waypoints; // 0x0058
    
        // Methods
        float get_MinPos();  // RVA: 0x9F9200
        float get_MaxPos();  // RVA: 0xF5CEF0
        bool get_Looped();  // RVA: 0x600800
        void Reset();  // RVA: 0xF5CCE0
        void OnValidate();  // RVA: 0x91CD70
        int32_t get_DistanceCacheSampleStepsPerSegment();  // RVA: 0x423C80
        float GetBoundingIndices(float pos, int32_t indexA, int32_t indexB);  // RVA: 0xF5C980
        Vector3 EvaluateLocalPosition(float pos);  // RVA: 0xF5C4E0
        Vector3 EvaluateLocalTangent(float pos);  // RVA: 0xF5C730
        Quaternion EvaluateLocalOrientation(float pos);  // RVA: 0xF5C120
        float GetRoll(int32_t indexA, int32_t indexB, float standardizedPos);  // RVA: 0xF5CBB0
        static Quaternion RollAroundForward(float angle);  // RVA: 0xF5CDF0
        void .ctor();  // RVA: 0xF5CE40
    };

    // Namespace: Cinemachine
    class CinemachinePipeline : public MonoBehaviour
    {
    public:
    
        // Methods
        void .ctor();  // RVA: 0x423C90
    };

    // Namespace: Cinemachine
    class CinemachinePixelPerfect : public CinemachineExtension
    {
    public:
    
        // Methods
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF6BAA0
        void .ctor();  // RVA: 0x697550
    };

} // namespace Cinemachine

// Namespace: <global>
struct Waypoint
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Vector3 position; // 0x0010
    uint8_t pad_0011[0xB]; // 0x0011
    float roll; // 0x001C

    // Methods
    Vector4 get_AsVector4();  // RVA: 0xF78400
    static Waypoint FromVector4(Vector4 v);  // RVA: 0xF783D0
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineSmoothPath : public CinemachinePathBase
    {
    public:
        uint8_t pad_0000[0x50]; // 0x0000
        bool m_Looped; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        Waypoint[][] m_Waypoints; // 0x0058
        uint8_t pad_0059[0x7]; // 0x0059
        Waypoint[][] m_ControlPoints1; // 0x0060
        uint8_t pad_0061[0x7]; // 0x0061
        Waypoint[][] m_ControlPoints2; // 0x0068
        uint8_t pad_0069[0x7]; // 0x0069
        bool m_IsLoopedCache; // 0x0070
    
        // Methods
        float get_MinPos();  // RVA: 0x9F9200
        float get_MaxPos();  // RVA: 0xF5CEF0
        bool get_Looped();  // RVA: 0x600800
        int32_t get_DistanceCacheSampleStepsPerSegment();  // RVA: 0x423C80
        void OnValidate();  // RVA: 0x91CD70
        void Reset();  // RVA: 0xF6C830
        void InvalidateDistanceCache();  // RVA: 0xF6C7F0
        void UpdateControlPoints();  // RVA: 0xF6C930
        float GetBoundingIndices(float pos, int32_t indexA, int32_t indexB);  // RVA: 0xF6C6D0
        Vector3 EvaluateLocalPosition(float pos);  // RVA: 0xF6C270
        Vector3 EvaluateLocalTangent(float pos);  // RVA: 0xF6C490
        Quaternion EvaluateLocalOrientation(float pos);  // RVA: 0xF6BE90
        static Quaternion RollAroundForward(float angle);  // RVA: 0xF5CDF0
        void .ctor();  // RVA: 0xF6CC00
    };

} // namespace Cinemachine

// Namespace: <global>
struct Instruction
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t m_FullHash; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    CinemachineVirtualCameraBase* m_VirtualCamera; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    float m_ActivateAfter; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float m_MinDuration; // 0x0024
};

// Namespace: <global>
struct ParentHash
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t m_Hash; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t m_ParentHash; // 0x0014

    // Methods
    void .ctor(int32_t h, int32_t p);  // RVA: 0xF16B50
};

// Namespace: <global>
struct HashPair
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t parentHash; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    int32_t hash; // 0x0014
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineStateDrivenCamera : public CinemachineVirtualCameraBase
    {
    public:
        uint8_t pad_0000[0xA8]; // 0x0000
        Transform* m_LookAt; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        Transform* m_Follow; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        Animator* m_AnimatedTarget; // 0x00B8
        uint8_t pad_00B9[0x7]; // 0x00B9
        int32_t m_LayerIndex; // 0x00C0
        uint8_t pad_00C1[0x3]; // 0x00C1
        bool m_ShowDebugText; // 0x00C4
        uint8_t pad_00C5[0x3]; // 0x00C5
        CinemachineVirtualCameraBase[][] m_ChildCameras; // 0x00C8
        uint8_t pad_00C9[0x7]; // 0x00C9
        Instruction[][] m_Instructions; // 0x00D0
        uint8_t pad_00D1[0x7]; // 0x00D1
        CinemachineBlendDefinition m_DefaultBlend; // 0x00D8
        uint8_t pad_00D9[0xF]; // 0x00D9
        CinemachineBlenderSettings* m_CustomBlends; // 0x00E8
        uint8_t pad_00E9[0x7]; // 0x00E9
        ParentHash[][] m_ParentHash; // 0x00F0
        uint8_t pad_00F1[0x7]; // 0x00F1
        ICinemachineCamera* <LiveChild>k__BackingField; // 0x00F8
        uint8_t pad_00F9[0x7]; // 0x00F9
        ICinemachineCamera* m_TransitioningFrom; // 0x0100
        uint8_t pad_0101[0x7]; // 0x0101
        CameraState m_State; // 0x0108
        uint8_t pad_0109[0xE7]; // 0x0109
        System.Collections.Generic.Dictionary<UnityEngine.AnimationClip,System.Collections.Generic.List<Cinemachine.CinemachineStateDrivenCamera.HashPair>> mHashCache; // 0x01F0
        uint8_t pad_01F1[0x7]; // 0x01F1
        float mActivationTime; // 0x01F8
        uint8_t pad_01F9[0x7]; // 0x01F9
        Instruction mActiveInstruction; // 0x0200
        uint8_t pad_0201[0x17]; // 0x0201
        float mPendingActivationTime; // 0x0218
        uint8_t pad_0219[0x7]; // 0x0219
        Instruction mPendingInstruction; // 0x0220
        uint8_t pad_0221[0x17]; // 0x0221
        CinemachineBlend* mActiveBlend; // 0x0238
        uint8_t pad_0239[0x7]; // 0x0239
        System.Collections.Generic.Dictionary<System.Int32,System.Int32> mInstructionDictionary; // 0x0240
        uint8_t pad_0241[0x7]; // 0x0241
        System.Collections.Generic.Dictionary<System.Int32,System.Int32> mStateParentLookup; // 0x0248
        uint8_t pad_0249[0x7]; // 0x0249
        System.Collections.Generic.List<UnityEngine.AnimatorClipInfo> m_clipInfoList; // 0x0250
    
        // Methods
        Il2CppString* get_Description();  // RVA: 0xF6F060
        ICinemachineCamera* get_LiveChild();  // RVA: 0x97A0F0
        void set_LiveChild(ICinemachineCamera* value);  // RVA: 0x97A130
        bool IsLiveChild(ICinemachineCamera* vcam, bool dominantChildOnly);  // RVA: 0xF6DD00
        CameraState get_State();  // RVA: 0xF6F1A0
        Transform* get_LookAt();  // RVA: 0xF46170
        void set_LookAt(Transform* value);  // RVA: 0x58CBE0
        Transform* get_Follow();  // RVA: 0xF46150
        void set_Follow(Transform* value);  // RVA: 0x58CC10
        void OnTargetObjectWarped(Transform* target, Vector3 positionDelta);  // RVA: 0xF6E6E0
        void ForceCameraPosition(Vector3 pos, Quaternion rot);  // RVA: 0xF6D3B0
        void OnTransitionFromCamera(ICinemachineCamera* fromCam, Vector3 worldUp, float deltaTime);  // RVA: 0xF6E7C0
        void InternalUpdateCameraState(Vector3 worldUp, float deltaTime);  // RVA: 0xF6D5E0
        void OnEnable();  // RVA: 0xF6E310
        void OnDisable();  // RVA: 0xF6E1E0
        void OnTransformChildrenChanged();  // RVA: 0xF6DCC0
        void OnGuiHandler();  // RVA: 0xF6E560
        CinemachineVirtualCameraBase[][] get_ChildCameras();  // RVA: 0xF6F040
        bool get_IsBlending();  // RVA: 0xF6F190
        CinemachineBlend* get_ActiveBlend();  // RVA: 0xF6F030
        static int32_t CreateFakeHash(int32_t parentHash, AnimationClip* clip);  // RVA: 0xF6D330
        int32_t LookupFakeHash(int32_t parentHash, AnimationClip* clip);  // RVA: 0xF6DF10
        void InvalidateListOfChildren();  // RVA: 0xF6DCC0
        void UpdateListOfChildren();  // RVA: 0xF6E890
        void ValidateInstructions();  // RVA: 0xF6EA70
        CinemachineVirtualCameraBase* ChooseCurrentCamera();  // RVA: 0xF6CCB0
        int32_t GetClipHash(int32_t hash, System.Collections.Generic.List<UnityEngine.AnimatorClipInfo> clips);  // RVA: 0xF6D4A0
        CinemachineBlendDefinition LookupBlend(ICinemachineCamera* fromKey, ICinemachineCamera* toKey);  // RVA: 0xF6DD30
        void .ctor();  // RVA: 0xF6EE10
    };

} // namespace Cinemachine

// Namespace: <global>
struct FillStrategy
{
public:
    // Static fields
    // static FillStrategy BestFit;
    // static FillStrategy CropImageToFit;
    // static FillStrategy StretchToFit;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
class CanvasInfo
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* mCanvas; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Canvas* mCanvasComponent; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    CinemachineBrain* mCanvasParent; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* mViewport; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RawImage* mRawImage; // 0x0030

    // Methods
    void .ctor();  // RVA: 0x427B90
};

// Namespace: <global>
struct StoryboardRenderMode
{
public:
    // Static fields
    // static StoryboardRenderMode ScreenSpaceOverlay;
    // static StoryboardRenderMode ScreenSpaceCamera;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineStoryboard : public CinemachineExtension
    {
    public:
        // Static fields
        // static bool s_StoryboardGlobalMute;
    
        uint8_t pad_0000[0x30]; // 0x0000
        bool m_ShowImage; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Texture* m_Image; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        FillStrategy m_Aspect; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        float m_Alpha; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        Vector2 m_Center; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        Vector3 m_Rotation; // 0x0050
        uint8_t pad_0051[0xB]; // 0x0051
        Vector2 m_Scale; // 0x005C
        uint8_t pad_005D[0x7]; // 0x005D
        bool m_SyncScale; // 0x0064
        bool m_MuteCamera; // 0x0065
        uint8_t pad_0066[0x2]; // 0x0066
        float m_SplitView; // 0x0068
        uint8_t pad_0069[0x3]; // 0x0069
        StoryboardRenderMode m_RenderMode; // 0x006C
        uint8_t pad_006D[0x3]; // 0x006D
        int32_t m_SortingOrder; // 0x0070
        uint8_t pad_0071[0x3]; // 0x0071
        float m_PlaneDistance; // 0x0074
        uint8_t pad_0075[0x3]; // 0x0075
        System.Collections.Generic.List<Cinemachine.CinemachineStoryboard.CanvasInfo> mCanvasInfo; // 0x0078
    
        // Methods
        void PostPipelineStageCallback(CinemachineVirtualCameraBase* vcam, Stage stage, CameraState state, float deltaTime);  // RVA: 0xF70A90
        void UpdateRenderCanvas();  // RVA: 0xF70EC0
        void ConnectToVcam(bool connect);  // RVA: 0xF6F410
        Il2CppString* get_CanvasName();  // RVA: 0xF711E0
        void CameraUpdatedCallback(CinemachineBrain* brain);  // RVA: 0xF6F240
        CanvasInfo* LocateMyCanvas(CinemachineBrain* parent, bool createIfNotFound);  // RVA: 0xF6FE40
        void CreateCanvas(CanvasInfo* ci);  // RVA: 0xF6F580
        void DestroyCanvas();  // RVA: 0xF6FAD0
        void PlaceImage(CanvasInfo* ci, float alpha);  // RVA: 0xF702E0
        static void StaticBlendingHandler(CinemachineBrain* brain);  // RVA: 0xF70BA0
        static void InitializeModule();  // RVA: 0xF6FD20
        void .ctor();  // RVA: 0xF71090
    };

    // Namespace: Cinemachine
    class ICinemachineTargetGroup
    {
    public:
    
        // Methods
        Transform* get_Transform();  // RVA: 0x26EAF0
        Bounds get_BoundingBox();
        BoundingSphere get_Sphere();
        bool get_IsEmpty();  // RVA: 0x26F7B0
        Bounds GetViewSpaceBoundingBox(Matrix4x4 observer);
        void GetViewSpaceAngularBounds(Matrix4x4 observer, Vector2 minAngles, Vector2 maxAngles, Vector2 zRange);
    };

} // namespace Cinemachine

// Namespace: <global>
struct Target
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Transform* target; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    float weight; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    float radius; // 0x001C
};

// Namespace: <global>
struct PositionMode
{
public:
    // Static fields
    // static PositionMode GroupCenter;
    // static PositionMode GroupAverage;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct RotationMode
{
public:
    // Static fields
    // static RotationMode Manual;
    // static RotationMode GroupAverage;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

// Namespace: <global>
struct UpdateMethod
{
public:
    // Static fields
    // static UpdateMethod Update;
    // static UpdateMethod FixedUpdate;
    // static UpdateMethod LateUpdate;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

namespace Cinemachine
{

    // Namespace: Cinemachine
    class CinemachineTargetGroup : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        PositionMode m_PositionMode; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        RotationMode m_RotationMode; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        UpdateMethod m_UpdateMethod; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        Target[][] m_Targets; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        float m_MaxWeight; // 0x0038
        uint8_t pad_0039[0x3]; // 0x0039
        float m_WeightSum; // 0x003C
        uint8_t pad_003D[0x3]; // 0x003D
        Vector3 m_AveragePos; // 0x0040
        uint8_t pad_0041[0xB]; // 0x0041
        Bounds m_BoundingBox; // 0x004C
        uint8_t pad_004D[0x17]; // 0x004D
        BoundingSphere m_BoundingSphere; // 0x0064
        uint8_t pad_0065[0xF]; // 0x0065
        int32_t m_LastUpdateFrame; // 0x0074
        uint8_t pad_0075[0x3]; // 0x0075
        System.Collections.Generic.List<System.Int32> m_ValidMembers; // 0x0078
        uint8_t pad_0079[0x7]; // 0x0079
