// ============================================================
// Image: GUPS.AntiCheat.dll
// ============================================================

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class UnitySourceGeneratedAssemblyMonoScriptTypes_v1
{
public:

    // Methods
    static MonoScriptData Get();  // RVA: 0x2110A90
    void .ctor();  // RVA: 0x427B90
};

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static System.Action<GUPS.AntiCheat.Core.Punisher.IPunisher> <>9__12_0;
    // static System.Comparison<GUPS.AntiCheat.Core.Punisher.IPunisher> <>9__20_0;


    // Methods
    static void .cctor();  // RVA: 0x2110A20
    void .ctor();  // RVA: 0x427B90
    void <OnNext>b__12_0(IPunisher* p);  // RVA: 0x21108F0
    int32_t <Awake>b__20_0(IPunisher* a, IPunisher* b);  // RVA: 0x2110870
};

// Namespace: <global>
class <>c__DisplayClass18_0
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    uint32_t _ThreatLevel; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x427B90
    bool <GetPunisher>b__0(IPunisher* p);  // RVA: 0x2110940
};

namespace GUPS.AntiCheat
{

    // Namespace: GUPS.AntiCheat
    class AntiCheatMonitor : public Singleton`1
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        ESensitiveLevel sensitiveLevel; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        float threatLevel; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        System.Collections.Generic.List<GUPS.AntiCheat.Core.Detector.IDetector> detectors; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        System.Collections.Generic.List<GUPS.AntiCheat.Core.Punisher.IPunisher> punishers; // 0x0030
    
        // Methods
        bool get_IsPersistent();  // RVA: 0x53A800
        ESensitiveLevel get_SensitiveLevel();  // RVA: 0x4208A0
        float get_ThreatLevel();  // RVA: 0x1F91950
        void RegisterDetector(IDetector* _Detector);  // RVA: 0x20F9EC0
        TDetector GetDetector();  // RVA: 0x3506D0
        void RemoveDetector(IDetector* _Detector);  // RVA: 0x20FA100
        void OnNext(IDetectorStatus* value);  // RVA: 0x20F9BD0
        void OnError(Exception* _Error);  // RVA: 0x4160A0
        void OnCompleted();  // RVA: 0x4160A0
        void Dispose();  // RVA: 0x4160A0
        void RegisterPunisher(IPunisher* _Punisher);  // RVA: 0x20FA020
        System.Collections.Generic.List<GUPS.AntiCheat.Core.Punisher.IPunisher> GetPunisher(uint32_t _ThreatLevel);  // RVA: 0x20F9AF0
        void RemovePunisher(IPunisher* _Punisher);  // RVA: 0x20FA180
        void Awake();  // RVA: 0x20F96E0
        void FixedUpdate();  // RVA: 0x20F9AA0
        void .ctor();  // RVA: 0x20FA200
    };

    // Namespace: GUPS.AntiCheat
    struct ESensitiveLevel
    {
    public:
        // Static fields
        // static ESensitiveLevel NOT_SENSITIVE;
        // static ESensitiveLevel LESS_SENSITIVE;
        // static ESensitiveLevel MODERATE;
        // static ESensitiveLevel SENSITIVE;
        // static ESensitiveLevel VERY_SENSITIVE;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

} // namespace GUPS.AntiCheat

namespace GUPS.AntiCheat.Singleton
{

    // Namespace: GUPS.AntiCheat.Singleton
    class Singleton`1 : public MonoBehaviour
    {
    public:
        // Static fields
        // static T instance;
        // static Il2CppObject* lockHandle;
        // static bool isQuitting;
    
    
        // Methods
        bool get_IsPersistent();  // RVA: 0x26F7B0
        static T get_Instance();  // RVA: 0x3506D0
        static bool get_Exists();  // RVA: 0x26F7E0
        void Awake();  // RVA: 0x26DD20
        static void Create();  // RVA: 0x26DD40
        void OnApplicationQuit();  // RVA: 0x26DD20
        void .ctor();  // RVA: 0x26DD20
        static void .cctor();  // RVA: 0x26DD40
    };

} // namespace GUPS.AntiCheat.Singleton

namespace GUPS.AntiCheat.Settings
{

    // Namespace: GUPS.AntiCheat.Settings
    class GlobalSettings : public ScriptableObject
    {
    public:
        // Static fields
        // static Il2CppString* RELATIVE_SETTINGS_PATH;
        // static Il2CppString* SETTINGS_PATH;
        // static GlobalSettings* instance;
        // static IRandomProvider* <RandomProvider>k__BackingField;
    
        uint8_t pad_0000[0x18]; // 0x0000
        bool Android_Enable_Development; // 0x0018
        bool Android_AllowAllAppStores; // 0x0019
        uint8_t pad_001A[0x6]; // 0x001A
        System.Collections.Generic.List<GUPS.AntiCheat.Monitor.Android.EAppStore> Android_AllowedAppStores; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        System.Collections.Generic.List<System.String> Android_AllowedCustomAppStores; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        bool Android_VerifyAppHash; // 0x0030
        uint8_t pad_0031[0x3]; // 0x0031
        EHashAlgorithm Android_AppHashAlgorithm; // 0x0034
        uint8_t pad_0035[0x3]; // 0x0035
        Il2CppString* Android_AppHashEndpoint; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        bool Android_VerifyAppFingerprint; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        EHashAlgorithm Android_AppFingerprintAlgorithm; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        Il2CppString* Android_AppFingerprint; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        bool Android_UseWhitelistingForLibraries; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        System.Collections.Generic.List<System.String> Android_WhitelistedLibraries; // 0x0058
        uint8_t pad_0059[0x7]; // 0x0059
        System.Collections.Generic.List<System.String> Android_BlacklistedLibraries; // 0x0060
        uint8_t pad_0061[0x7]; // 0x0061
        bool Android_UseBlacklistingforApplication; // 0x0068
        uint8_t pad_0069[0x7]; // 0x0069
        System.Collections.Generic.List<System.String> Android_BlacklistedApplications; // 0x0070
    
        // Methods
        static GlobalSettings* get_Instance();  // RVA: 0x20FCA10
        static GlobalSettings* LoadAsset();  // RVA: 0x20FC7A0
        static IRandomProvider* get_RandomProvider();  // RVA: 0x20FCB40
        void .ctor();  // RVA: 0x20FC870
        static void .cctor();  // RVA: 0x20FC7F0
    };

} // namespace GUPS.AntiCheat.Settings

namespace GUPS.AntiCheat.Punisher
{

    // Namespace: GUPS.AntiCheat.Punisher
    class ExitGamePunisher : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        bool isActive; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        uint32_t threatRating; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        bool <HasPunished>k__BackingField; // 0x0028
    
        // Methods
        Il2CppString* get_Name();  // RVA: 0x20FB520
        bool get_IsSupported();  // RVA: 0x53A800
        bool get_IsActive();  // RVA: 0x4208A0
        void set_IsActive(bool value);  // RVA: 0x87AAB0
        uint32_t get_ThreatRating();  // RVA: 0x7FBC10
        bool get_PunishOnce();  // RVA: 0x53A800
        bool get_HasPunished();  // RVA: 0x77D260
        void set_HasPunished(bool value);  // RVA: 0x77D1C0
        void Punish();  // RVA: 0x20FB4B0
        void .ctor();  // RVA: 0x20FB500
    };

    // Namespace: GUPS.AntiCheat.Punisher
    class FlipCameraPunisher : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        bool isActive; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        uint32_t threatRating; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        bool isFlipped; // 0x0028
        bool flipHorizontal; // 0x0029
    
        // Methods
        Il2CppString* get_Name();  // RVA: 0x20FB6D0
        bool get_IsSupported();  // RVA: 0x53A800
        bool get_IsActive();  // RVA: 0x4208A0
        void set_IsActive(bool value);  // RVA: 0x87AAB0
        uint32_t get_ThreatRating();  // RVA: 0x7FBC10
        bool get_PunishOnce();  // RVA: 0x53A800
        bool get_HasPunished();  // RVA: 0x77D260
        void Punish();  // RVA: 0x20FB550
        void .ctor();  // RVA: 0x20FB6B0
    };

    // Namespace: GUPS.AntiCheat.Punisher
    class ReduceFpsPunisher : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        bool isActive; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        uint32_t threatRating; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        int32_t punishFrameRate; // 0x0028
        uint8_t pad_0029[0x3]; // 0x0029
        bool <HasPunished>k__BackingField; // 0x002C
    
        // Methods
        Il2CppString* get_Name();  // RVA: 0x210FB00
        bool get_IsSupported();  // RVA: 0x53A800
        bool get_IsActive();  // RVA: 0x4208A0
        void set_IsActive(bool value);  // RVA: 0x87AAB0
        uint32_t get_ThreatRating();  // RVA: 0x7FBC10
        bool get_PunishOnce();  // RVA: 0x53A800
        bool get_HasPunished();  // RVA: 0x9AD9F0
        void set_HasPunished(bool value);  // RVA: 0x210FB30
        void Punish();  // RVA: 0x210FA80
        void .ctor();  // RVA: 0x210FAE0
    };

} // namespace GUPS.AntiCheat.Punisher

namespace GUPS.AntiCheat.Protected
{

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedBool
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t obfuscatedValue; // 0x0012
        uint8_t pad_0013[0x1]; // 0x0013
        int32_t secret; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        bool fakeValue; // 0x0018
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x20FD130
        void OnAfterDeserialize();  // RVA: 0x20FD0F0
        void .ctor(bool _Value);  // RVA: 0x20FD1B0
        bool get_Value();  // RVA: 0x20FD290
        void set_Value(bool value);  // RVA: 0x20FD0E0
        void Obfuscate(bool _Value);  // RVA: 0x20FD0E0
        bool UnObfuscate();  // RVA: 0x20FD1A0
        void Obfuscate();  // RVA: 0x20FCFF0
        bool CheckIntegrity();  // RVA: 0x20FCE70
        void Dispose();  // RVA: 0x20FCEB0
        int32_t GetHashCode();  // RVA: 0x20FCFB0
        Il2CppString* ToString();  // RVA: 0x20FD160
        void Serialize(uint8_t _ObfuscatedValue, int32_t _Secret);  // RVA: 0x20FD150
        void Deserialize(uint8_t _ObfuscatedValue, int32_t _Secret);  // RVA: 0x20FCE90
        static ProtectedBool op_Implicit(bool _Value);  // RVA: 0x20FD3F0
        static bool op_Implicit(ProtectedBool _Value);  // RVA: 0x20FD3E0
        static bool op_Equality(ProtectedBool v1, ProtectedBool v2);  // RVA: 0x20FD3B0
        static bool op_Inequality(ProtectedBool v1, ProtectedBool v2);  // RVA: 0x20FD420
        bool Equals(Il2CppObject* obj);  // RVA: 0x20FCEC0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedDateTime
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        ProtectedInt64 obfuscatedInt64; // 0x0018
        uint8_t pad_0019[0x1F]; // 0x0019
        int64_t fakeValue; // 0x0038
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x20FD780
        void OnAfterDeserialize();  // RVA: 0x20FD710
        void .ctor(DateTime _Value);  // RVA: 0x20FD880
        DateTime get_Value();  // RVA: 0x20FD940
        void set_Value(DateTime value);  // RVA: 0x20FDBB0
        void Obfuscate(DateTime _Value);  // RVA: 0x20FD6A0
        DateTime UnObfuscate();  // RVA: 0x20FD840
        void Obfuscate();  // RVA: 0x20FD690
        bool CheckIntegrity();  // RVA: 0x20FD450
        void Dispose();  // RVA: 0x20FD4F0
        Il2CppString* ToString();  // RVA: 0x20FD7E0
        int32_t GetHashCode();  // RVA: 0x20FD630
        static ProtectedDateTime op_Implicit(DateTime _Value);  // RVA: 0x20FDAF0
        static DateTime op_Implicit(ProtectedDateTime _Value);  // RVA: 0x20FDB20
        static bool op_Equality(ProtectedDateTime v1, ProtectedDateTime v2);  // RVA: 0x20FDA70
        static bool op_Inequality(ProtectedDateTime v1, ProtectedDateTime v2);  // RVA: 0x20FDB30
        bool Equals(Il2CppObject* obj);  // RVA: 0x20FD500
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedDecimal
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        Int32[][] obfuscatedValues; // 0x0018
        uint8_t pad_0019[0x7]; // 0x0019
        double fakeValue; // 0x0020
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x20FE0F0
        void OnAfterDeserialize();  // RVA: 0x20FDFF0
        void .ctor(Decimal _Value);  // RVA: 0x20FE210
        Decimal get_Value();  // RVA: 0x20FE2A0
        void set_Value(Decimal value);  // RVA: 0x20FDEB0
        void Obfuscate(Decimal _Value);  // RVA: 0x20FDEB0
        Decimal UnObfuscate();  // RVA: 0x20FE1E0
        void Obfuscate();  // RVA: 0x20FDF40
        bool CheckIntegrity();  // RVA: 0x20FDC20
        void Dispose();  // RVA: 0x20FDCB0
        Il2CppString* ToString();  // RVA: 0x20FE170
        int32_t GetHashCode();  // RVA: 0x20FDE40
        static ProtectedDecimal op_Implicit(Decimal _Value);  // RVA: 0x20FEBC0
        static Decimal op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FE990
        static ProtectedDouble op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FE720
        static ProtectedDecimal op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FE9C0
        static ProtectedInt16 op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FE7C0
        static ProtectedDecimal op_Implicit(ProtectedInt16 _Value);  // RVA: 0x20FED60
        static ProtectedInt32 op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FEE60
        static ProtectedDecimal op_Implicit(ProtectedInt32 _Value);  // RVA: 0x20FEC60
        static ProtectedInt64 op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FE850
        static ProtectedDecimal op_Implicit(ProtectedInt64 _Value);  // RVA: 0x20FEAC0
        static ProtectedFloat op_Implicit(ProtectedDecimal _Value);  // RVA: 0x20FE8F0
        static ProtectedDecimal op_Implicit(ProtectedFloat _Value);  // RVA: 0x20FE620
        static bool op_Equality(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FE410
        static bool op_Inequality(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FEF00
        bool Equals(Il2CppObject* obj);  // RVA: 0x20FDCD0
        static bool op_LessThan(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FF060
        static bool op_LessThanOrEqual(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FEFB0
        static bool op_GreaterThan(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FE570
        static bool op_GreaterThanOrEqual(ProtectedDecimal v1, ProtectedDecimal v2);  // RVA: 0x20FE4C0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedDouble
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        ULongDouble obfuscatedValue; // 0x0018
        uint8_t pad_0019[0x7]; // 0x0019
        ULongDouble manager; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        uint64_t secret; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        double fakeValue; // 0x0030
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x20FF410
        void OnAfterDeserialize();  // RVA: 0x20FF3B0
        void .ctor(double value);  // RVA: 0x20FF480
        double get_Value();  // RVA: 0x20FF570
        void set_Value(double value);  // RVA: 0x20FF390
        void Obfuscate(double _Value);  // RVA: 0x20FF390
        double UnObfuscate();  // RVA: 0x20FF460
        void Obfuscate();  // RVA: 0x20FF2A0
        bool CheckIntegrity();  // RVA: 0x20FF110
        void Dispose();  // RVA: 0x20FF140
        Il2CppString* ToString();  // RVA: 0x20FF430
        int32_t GetHashCode();  // RVA: 0x20FF260
        static ProtectedDouble op_Implicit(double _Value);  // RVA: 0x20FF9F0
        static double op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FF850
        static ProtectedInt16 op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FF860
        static ProtectedDouble op_Implicit(ProtectedInt16 _Value);  // RVA: 0x20FFA70
        static ProtectedInt32 op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FF9B0
        static ProtectedDouble op_Implicit(ProtectedInt32 _Value);  // RVA: 0x20FF910
        static ProtectedInt64 op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FF890
        static ProtectedDouble op_Implicit(ProtectedInt64 _Value);  // RVA: 0x20FF960
        static ProtectedFloat op_Implicit(ProtectedDouble _Value);  // RVA: 0x20FF8D0
        static ProtectedDouble op_Implicit(ProtectedFloat _Value);  // RVA: 0x20FFA20
        static ProtectedDouble op_Addition(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FF6A0
        static ProtectedDouble op_Subtraction(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FFC00
        static ProtectedDouble op_Multiply(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FFB90
        static ProtectedDouble op_Division(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FF710
        static bool op_Equality(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FF780
        static bool op_Inequality(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FFAC0
        bool Equals(Il2CppObject* obj);  // RVA: 0x20FF150
        static bool op_LessThan(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FFB50
        static bool op_LessThanOrEqual(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FFB10
        static bool op_GreaterThan(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FF810
        static bool op_GreaterThanOrEqual(ProtectedDouble v1, ProtectedDouble v2);  // RVA: 0x20FF7D0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedFloat
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        UIntFloat obfuscatedValue; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        UIntFloat manager; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        uint32_t secret; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        float fakeValue; // 0x0020
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x21043B0
        void OnAfterDeserialize();  // RVA: 0x2104370
        void .ctor(float value);  // RVA: 0x2104420
        float get_Value();  // RVA: 0x2104510
        void set_Value(float value);  // RVA: 0x2104350
        void Obfuscate(float _Value);  // RVA: 0x2104350
        float UnObfuscate();  // RVA: 0x2104410
        void Obfuscate();  // RVA: 0x2104260
        bool CheckIntegrity();  // RVA: 0x2104110
        void Dispose();  // RVA: 0x2104150
        Il2CppString* ToString();  // RVA: 0x21043E0
        int32_t GetHashCode();  // RVA: 0x2104250
        void Serialize(uint32_t _ObfuscatedValue, uint32_t _Secret);  // RVA: 0x21043D0
        void Deserialize(uint32_t _ObfuscatedValue, uint32_t _Secret);  // RVA: 0x2104130
        static ProtectedFloat op_Implicit(float _Value);  // RVA: 0x21047C0
        static float op_Implicit(ProtectedFloat _Value);  // RVA: 0x21047F0
        static ProtectedInt16 op_Implicit(ProtectedFloat _Value);  // RVA: 0x2104800
        static ProtectedFloat op_Implicit(ProtectedInt16 _Value);  // RVA: 0x21048F0
        static ProtectedInt32 op_Implicit(ProtectedFloat _Value);  // RVA: 0x2104930
        static ProtectedFloat op_Implicit(ProtectedInt32 _Value);  // RVA: 0x2104870
        static ProtectedInt64 op_Implicit(ProtectedFloat _Value);  // RVA: 0x2104830
        static ProtectedFloat op_Implicit(ProtectedInt64 _Value);  // RVA: 0x21048B0
        static ProtectedFloat op_Addition(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104630
        static ProtectedFloat op_Subtraction(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104AA0
        static ProtectedFloat op_Multiply(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104A40
        static ProtectedFloat op_Division(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104690
        static bool op_Equality(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x21046F0
        static bool op_Inequality(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104970
        bool Equals(Il2CppObject* obj);  // RVA: 0x2104160
        static bool op_LessThan(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104A00
        static bool op_LessThanOrEqual(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x21049C0
        static bool op_GreaterThan(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104780
        static bool op_GreaterThanOrEqual(ProtectedFloat v1, ProtectedFloat v2);  // RVA: 0x2104740
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedInt16
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        int16_t obfuscatedValue; // 0x0012
        uint8_t pad_0013[0x1]; // 0x0013
        int16_t secret; // 0x0014
        uint8_t pad_0015[0x1]; // 0x0015
        int16_t fakeValue; // 0x0016
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x2104D50
        void OnAfterDeserialize();  // RVA: 0x2104D10
        void .ctor(int16_t _Value);  // RVA: 0x2104DB0
        int16_t get_Value();  // RVA: 0x2104E90
        void set_Value(int16_t value);  // RVA: 0x2104D00
        void Obfuscate(int16_t _Value);  // RVA: 0x2104D00
        int16_t UnObfuscate();  // RVA: 0x2104DA0
        void Obfuscate();  // RVA: 0x2104C20
        bool CheckIntegrity();  // RVA: 0x2104B00
        void Dispose();  // RVA: 0x2104B20
        Il2CppString* ToString();  // RVA: 0x2104D70
        int32_t GetHashCode();  // RVA: 0x2104C00
        static ProtectedInt16 op_Implicit(int16_t _Value);  // RVA: 0x2105100
        static int16_t op_Implicit(ProtectedInt16 _Value);  // RVA: 0x2105130
        static ProtectedInt16 op_Addition(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2104F90
        static ProtectedInt16 op_Subtraction(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105270
        static ProtectedInt16 op_Multiply(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105210
        static ProtectedInt16 op_Division(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2104FE0
        static bool op_Equality(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105040
        static bool op_Inequality(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105150
        bool Equals(Il2CppObject* obj);  // RVA: 0x2104B30
        static bool op_LessThan(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x21051D0
        static bool op_LessThanOrEqual(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105190
        static bool op_GreaterThan(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x21050C0
        static bool op_GreaterThanOrEqual(ProtectedInt16 v1, ProtectedInt16 v2);  // RVA: 0x2105080
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedInt32
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        int32_t obfuscatedValue; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        int32_t secret; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        int32_t fakeValue; // 0x001C
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x2105500
        void OnAfterDeserialize();  // RVA: 0x21054D0
        void .ctor(int32_t _Value);  // RVA: 0x2105560
        int32_t get_Value();  // RVA: 0x2105640
        void set_Value(int32_t value);  // RVA: 0x21054C0
        void Obfuscate(int32_t _Value);  // RVA: 0x21054C0
        int32_t UnObfuscate();  // RVA: 0x2105550
        void Obfuscate();  // RVA: 0x21053F0
        bool CheckIntegrity();  // RVA: 0x21052D0
        void Dispose();  // RVA: 0x2105300
        Il2CppString* ToString();  // RVA: 0x2105530
        int32_t GetHashCode();  // RVA: 0x21053E0
        void Serialize(int32_t _ObfuscatedValue, int32_t _Secret);  // RVA: 0x2105520
        void Deserialize(int32_t _ObfuscatedValue, int32_t _Secret);  // RVA: 0x21052F0
        static ProtectedInt32 op_Implicit(int32_t _Value);  // RVA: 0x21058A0
        static int32_t op_Implicit(ProtectedInt32 _Value);  // RVA: 0x2105890
        static ProtectedInt32 op_Addition(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105740
        static ProtectedInt32 op_Subtraction(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x21059B0
        static ProtectedInt32 op_Multiply(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105950
        static ProtectedInt32 op_Division(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x21057A0
        static bool op_Equality(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105800
        static bool op_Inequality(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x21058C0
        bool Equals(Il2CppObject* obj);  // RVA: 0x2105310
        static bool op_LessThan(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105920
        static bool op_LessThanOrEqual(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x21058F0
        static bool op_GreaterThan(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105860
        static bool op_GreaterThanOrEqual(ProtectedInt32 v1, ProtectedInt32 v2);  // RVA: 0x2105830
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedInt64
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        int64_t obfuscatedValue; // 0x0018
        uint8_t pad_0019[0x7]; // 0x0019
        int64_t secret; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        int64_t fakeValue; // 0x0028
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x2105C50
        void OnAfterDeserialize();  // RVA: 0x2105C10
        void .ctor(int64_t _Value);  // RVA: 0x2105CB0
        int64_t get_Value();  // RVA: 0x2105DA0
        void set_Value(int64_t value);  // RVA: 0x2105C00
        void Obfuscate(int64_t _Value);  // RVA: 0x2105C00
        int64_t UnObfuscate();  // RVA: 0x2105CA0
        void Obfuscate();  // RVA: 0x2105B20
        bool CheckIntegrity();  // RVA: 0x2105A10
        void Dispose();  // RVA: 0x2105A30
        Il2CppString* ToString();  // RVA: 0x2105C70
        int32_t GetHashCode();  // RVA: 0x2105B10
        static ProtectedInt64 op_Implicit(int64_t _Value);  // RVA: 0x2106040
        static int64_t op_Implicit(ProtectedInt64 _Value);  // RVA: 0x2106070
        static ProtectedInt64 op_Addition(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2105EB0
        static ProtectedInt64 op_Subtraction(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x21061A0
        static ProtectedInt64 op_Multiply(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2106140
        static ProtectedInt64 op_Division(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2105F10
        static bool op_Equality(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2105F80
        static bool op_Inequality(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2106080
        bool Equals(Il2CppObject* obj);  // RVA: 0x2105A40
        static bool op_LessThan(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2106100
        static bool op_LessThanOrEqual(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x21060C0
        static bool op_GreaterThan(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2106000
        static bool op_GreaterThanOrEqual(ProtectedInt64 v1, ProtectedInt64 v2);  // RVA: 0x2105FC0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedQuaternion
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        UIntFloat obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        UIntFloat obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        UIntFloat obfuscatedValueZ; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        UIntFloat obfuscatedValueW; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        UIntFloat manager; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        uint32_t secret; // 0x0028
        uint8_t pad_0029[0x3]; // 0x0029
        Quaternion fakeValue; // 0x002C
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x21080A0
        void OnAfterDeserialize();  // RVA: 0x2107FD0
        void .ctor(Quaternion _Value);  // RVA: 0x2108150
        Quaternion get_Value();  // RVA: 0x2108210
        void set_Value(Quaternion value);  // RVA: 0x2108520
        void Obfuscate(Quaternion _Value);  // RVA: 0x2107F70
        Quaternion UnObfuscate();  // RVA: 0x2108110
        void Obfuscate();  // RVA: 0x2107DE0
        bool CheckIntegrity();  // RVA: 0x2107AB0
        void Dispose();  // RVA: 0x2107B30
        Il2CppString* ToString();  // RVA: 0x21080D0
        int32_t GetHashCode();  // RVA: 0x2107D50
        static ProtectedQuaternion op_Implicit(Quaternion _Value);  // RVA: 0x2108450
        static Quaternion op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x2108420
        static bool op_Equality(ProtectedQuaternion v1, ProtectedQuaternion v2);  // RVA: 0x2108390
        static bool op_Inequality(ProtectedQuaternion v1, ProtectedQuaternion v2);  // RVA: 0x2108490
        bool Equals(Il2CppObject* obj);  // RVA: 0x2107B40
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedString
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        Il2CppString* obfuscatedValue; // 0x0018
        uint8_t pad_0019[0x7]; // 0x0019
        int32_t secret; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        Il2CppString* fakeValue; // 0x0028
    
        // Methods
        static Il2CppString* EncryptToUTF8(Il2CppString* _String, int32_t _Secret);  // RVA: 0x2108930
        static Il2CppString* DecryptFromUTF8(Il2CppString* _String, int32_t _Secret);  // RVA: 0x21086D0
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x2108EC0
        void OnAfterDeserialize();  // RVA: 0x2108E70
        void .ctor(Il2CppString* _Value);  // RVA: 0x2108F50
        Il2CppString* get_Value();  // RVA: 0x2109050
        void set_Value(Il2CppString* value);  // RVA: 0x2108D20
        void Obfuscate(Il2CppString* _Value);  // RVA: 0x2108D20
        Il2CppString* UnObfuscate();  // RVA: 0x2108F40
        void Obfuscate();  // RVA: 0x2108D70
        bool CheckIntegrity();  // RVA: 0x2108690
        void Dispose();  // RVA: 0x2108910
        Il2CppString* ToString();  // RVA: 0x2108F30
        int32_t GetHashCode();  // RVA: 0x2108CD0
        void Serialize(Il2CppString* _ObfuscatedValue, int32_t _Secret);  // RVA: 0x2108EF0
        void Deserialize(Il2CppString* _ObfuscatedValue, int32_t _Secret);  // RVA: 0x21088C0
        static ProtectedString op_Implicit(Il2CppString* _Value);  // RVA: 0x2109230
        static Il2CppString* op_Implicit(ProtectedString _Value);  // RVA: 0x2109260
        static ProtectedString op_Addition(ProtectedString v1, ProtectedString v2);  // RVA: 0x2109180
        static bool op_Equality(ProtectedString v1, ProtectedString v2);  // RVA: 0x21091F0
        static bool op_Inequality(ProtectedString v1, ProtectedString v2);  // RVA: 0x2109270
        bool Equals(Il2CppObject* obj);  // RVA: 0x2108BC0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedUInt16
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint16_t obfuscatedValue; // 0x0012
        uint8_t pad_0013[0x1]; // 0x0013
        uint16_t secret; // 0x0014
        uint8_t pad_0015[0x1]; // 0x0015
        uint16_t fakeValue; // 0x0016
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x2109EF0
        void OnAfterDeserialize();  // RVA: 0x2109EB0
        void .ctor(uint16_t _Value);  // RVA: 0x2109F40
        uint16_t get_Value();  // RVA: 0x210A020
        void set_Value(uint16_t value);  // RVA: 0x2104D00
        void Obfuscate(uint16_t _Value);  // RVA: 0x2104D00
        uint16_t UnObfuscate();  // RVA: 0x2104DA0
        void Obfuscate();  // RVA: 0x2109DD0
        bool CheckIntegrity();  // RVA: 0x2104B00
        void Dispose();  // RVA: 0x2104B20
        Il2CppString* ToString();  // RVA: 0x2109F10
        int32_t GetHashCode();  // RVA: 0x2109DB0
        static ProtectedUInt16 op_Implicit(uint16_t _Value);  // RVA: 0x210A2B0
        static uint16_t op_Implicit(ProtectedUInt16 _Value);  // RVA: 0x210A290
        static ProtectedUInt16 op_Addition(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A120
        static ProtectedUInt16 op_Subtraction(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A400
        static ProtectedUInt16 op_Multiply(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A3A0
        static ProtectedUInt16 op_Division(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A170
        static bool op_Equality(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A1D0
        static bool op_Inequality(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A2E0
        bool Equals(Il2CppObject* obj);  // RVA: 0x2109CE0
        static bool op_LessThan(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A360
        static bool op_LessThanOrEqual(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A320
        static bool op_GreaterThan(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A250
        static bool op_GreaterThanOrEqual(ProtectedUInt16 v1, ProtectedUInt16 v2);  // RVA: 0x210A210
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedUInt32
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        uint32_t obfuscatedValue; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        uint32_t secret; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        uint32_t fakeValue; // 0x001C
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210A640
        void OnAfterDeserialize();  // RVA: 0x210A610
        void .ctor(uint32_t _Value);  // RVA: 0x210A680
        uint32_t get_Value();  // RVA: 0x210A760
        void set_Value(uint32_t value);  // RVA: 0x21054C0
        void Obfuscate(uint32_t _Value);  // RVA: 0x21054C0
        uint32_t UnObfuscate();  // RVA: 0x2105550
        void Obfuscate();  // RVA: 0x210A540
        bool CheckIntegrity();  // RVA: 0x21052D0
        void Dispose();  // RVA: 0x2105300
        Il2CppString* ToString();  // RVA: 0x210A660
        int32_t GetHashCode();  // RVA: 0x210A530
        static ProtectedUInt32 op_Implicit(uint32_t _Value);  // RVA: 0x210A9C0
        static uint32_t op_Implicit(ProtectedUInt32 _Value);  // RVA: 0x210A9B0
        static ProtectedUInt32 op_Addition(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A860
        static ProtectedUInt32 op_Subtraction(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210AAD0
        static ProtectedUInt32 op_Multiply(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210AA70
        static ProtectedUInt32 op_Division(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A8C0
        static bool op_Equality(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A920
        static bool op_Inequality(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A9E0
        bool Equals(Il2CppObject* obj);  // RVA: 0x210A460
        static bool op_LessThan(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210AA40
        static bool op_LessThanOrEqual(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210AA10
        static bool op_GreaterThan(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A980
        static bool op_GreaterThanOrEqual(ProtectedUInt32 v1, ProtectedUInt32 v2);  // RVA: 0x210A950
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedUInt64
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x6]; // 0x0012
        uint64_t obfuscatedValue; // 0x0018
        uint8_t pad_0019[0x7]; // 0x0019
        uint64_t secret; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        uint64_t fakeValue; // 0x0028
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210AD30
        void OnAfterDeserialize();  // RVA: 0x210ACF0
        void .ctor(uint64_t _Value);  // RVA: 0x210AD80
        uint64_t get_Value();  // RVA: 0x210AE70
        void set_Value(uint64_t value);  // RVA: 0x2105C00
        void Obfuscate(uint64_t _Value);  // RVA: 0x2105C00
        uint64_t UnObfuscate();  // RVA: 0x2105CA0
        void Obfuscate();  // RVA: 0x210AC10
        bool CheckIntegrity();  // RVA: 0x2105A10
        void Dispose();  // RVA: 0x2105A30
        Il2CppString* ToString();  // RVA: 0x210AD50
        int32_t GetHashCode();  // RVA: 0x210AC00
        static ProtectedUInt64 op_Implicit(uint64_t _Value);  // RVA: 0x210B120
        static uint64_t op_Implicit(ProtectedUInt64 _Value);  // RVA: 0x210B110
        static ProtectedUInt64 op_Addition(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210AF80
        static ProtectedUInt64 op_Subtraction(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B270
        static ProtectedUInt64 op_Multiply(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B210
        static ProtectedUInt64 op_Division(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210AFE0
        static bool op_Equality(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B050
        static bool op_Inequality(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B150
        bool Equals(Il2CppObject* obj);  // RVA: 0x210AB30
        static bool op_LessThan(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B1D0
        static bool op_LessThanOrEqual(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B190
        static bool op_GreaterThan(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B0D0
        static bool op_GreaterThanOrEqual(ProtectedUInt64 v1, ProtectedUInt64 v2);  // RVA: 0x210B090
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector2
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        UIntFloat obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        UIntFloat obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        UIntFloat manager; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        uint32_t secret; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        Vector2 fakeValue; // 0x0024
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210C100
        void OnAfterDeserialize();  // RVA: 0x210C060
        void .ctor(Vector2 _Value);  // RVA: 0x210C290
        Vector2 get_Value();  // RVA: 0x210C320
        void set_Value(Vector2 value);  // RVA: 0x210C680
        void Obfuscate(Vector2 _Value);  // RVA: 0x210BF10
        Vector2 UnObfuscate();  // RVA: 0x210C260
        void Obfuscate();  // RVA: 0x210BF40
        bool CheckIntegrity();  // RVA: 0x210BC90
        void Dispose();  // RVA: 0x210BD20
        Il2CppString* ToString();  // RVA: 0x210C160
        int32_t GetHashCode();  // RVA: 0x210BED0
        void Serialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _Secret);  // RVA: 0x210C140
        void Deserialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _Secret);  // RVA: 0x210BCE0
        static ProtectedVector2 op_Implicit(Vector2 _Value);  // RVA: 0x210C5F0
        static Vector2 op_Implicit(ProtectedVector2 _Value);  // RVA: 0x210C4F0
        static ProtectedQuaternion op_Implicit(ProtectedVector2 _Value);  // RVA: 0x210C570
        static ProtectedVector2 op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210C500
        static bool op_Equality(ProtectedVector2 v1, ProtectedVector2 v2);  // RVA: 0x210C490
        static bool op_Inequality(ProtectedVector2 v1, ProtectedVector2 v2);  // RVA: 0x210C620
        bool Equals(Il2CppObject* obj);  // RVA: 0x210BD30
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector2Int
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        int32_t obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        int32_t obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        int32_t secret; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        Vector2Int fakeValue; // 0x0020
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210B630
        void OnAfterDeserialize();  // RVA: 0x210B5B0
        void .ctor(Vector2Int _Value);  // RVA: 0x210B740
        Vector2Int get_Value();  // RVA: 0x210B7A0
        void set_Value(Vector2Int value);  // RVA: 0x210B480
        void Obfuscate(Vector2Int _Value);  // RVA: 0x210B480
        Vector2Int UnObfuscate();  // RVA: 0x210B720
        void Obfuscate();  // RVA: 0x210B4A0
        bool CheckIntegrity();  // RVA: 0x210B2D0
        void Dispose();  // RVA: 0x2104150
        Il2CppString* ToString();  // RVA: 0x210B650
        int32_t GetHashCode();  // RVA: 0x210B450
        static ProtectedVector2Int op_Implicit(Vector2Int _Value);  // RVA: 0x210BA90
        static Vector2Int op_Implicit(ProtectedVector2Int _Value);  // RVA: 0x210B940
        static ProtectedQuaternion op_Implicit(ProtectedVector2Int _Value);  // RVA: 0x210BA00
        static ProtectedVector2Int op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210B950
        static bool op_Equality(ProtectedVector2Int v1, ProtectedVector2Int v2);  // RVA: 0x210B8F0
        static bool op_Inequality(ProtectedVector2Int v1, ProtectedVector2Int v2);  // RVA: 0x210BB00
        bool Equals(Il2CppObject* obj);  // RVA: 0x210B310
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector3
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        UIntFloat obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        UIntFloat obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        UIntFloat obfuscatedValueZ; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        UIntFloat manager; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        uint32_t secret; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        Vector3 fakeValue; // 0x0028
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210D8A0
        void OnAfterDeserialize();  // RVA: 0x210D7F0
        void .ctor(Vector3 _Value);  // RVA: 0x210DA70
        Vector3 get_Value();  // RVA: 0x210DB10
        void set_Value(Vector3 value);  // RVA: 0x210E050
        void Obfuscate(Vector3 _Value);  // RVA: 0x210D650
        Vector3 UnObfuscate();  // RVA: 0x210DA40
        void Obfuscate();  // RVA: 0x210D6A0
        bool CheckIntegrity();  // RVA: 0x210D300
        void Dispose();  // RVA: 0x210D3D0
        Il2CppString* ToString();  // RVA: 0x210D8F0
        int32_t GetHashCode();  // RVA: 0x210D5D0
        void Serialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _ObfuscatedValueZ, uint32_t _Secret);  // RVA: 0x210D8D0
        void Deserialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _ObfuscatedValueZ, uint32_t _Secret);  // RVA: 0x210D380
        static ProtectedVector3 op_Implicit(Vector3 _Value);  // RVA: 0x210DF00
        static Vector3 op_Implicit(ProtectedVector3 _Value);  // RVA: 0x210DD20
        static ProtectedQuaternion op_Implicit(ProtectedVector3 _Value);  // RVA: 0x210DE50
        static ProtectedVector3 op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210DD50
        static bool op_Equality(ProtectedVector3 v1, ProtectedVector3 v2);  // RVA: 0x210DC80
        static bool op_Inequality(ProtectedVector3 v1, ProtectedVector3 v2);  // RVA: 0x210DFB0
        bool Equals(Il2CppObject* obj);  // RVA: 0x210D3E0
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector3Int
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        int32_t obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        int32_t obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        int32_t obfuscatedValueZ; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        int32_t secret; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        Vector3Int fakeValue; // 0x0024
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210CB50
        void OnAfterDeserialize();  // RVA: 0x210CAB0
        void .ctor(Vector3Int _Value);  // RVA: 0x210CCC0
        Vector3Int get_Value();  // RVA: 0x210CD40
        void set_Value(Vector3Int value);  // RVA: 0x210D240
        void Obfuscate(Vector3Int _Value);  // RVA: 0x210C960
        Vector3Int UnObfuscate();  // RVA: 0x210CCA0
        void Obfuscate();  // RVA: 0x210C990
        bool CheckIntegrity();  // RVA: 0x210C6C0
        void Dispose();  // RVA: 0x210BD20
        Il2CppString* ToString();  // RVA: 0x210CB80
        int32_t GetHashCode();  // RVA: 0x210C8E0
        static ProtectedVector3Int op_Implicit(Vector3Int _Value);  // RVA: 0x210D120
        static Vector3Int op_Implicit(ProtectedVector3Int _Value);  // RVA: 0x210CF50
        static ProtectedQuaternion op_Implicit(ProtectedVector3Int _Value);  // RVA: 0x210D050
        static ProtectedVector3Int op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210CF80
        static bool op_Equality(ProtectedVector3Int v1, ProtectedVector3Int v2);  // RVA: 0x210CEC0
        static bool op_Inequality(ProtectedVector3Int v1, ProtectedVector3Int v2);  // RVA: 0x210D1B0
        bool Equals(Il2CppObject* obj);  // RVA: 0x210C720
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector4
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        UIntFloat obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        UIntFloat obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        UIntFloat obfuscatedValueZ; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        UIntFloat obfuscatedValueW; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        UIntFloat manager; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        uint32_t secret; // 0x0028
        uint8_t pad_0029[0x3]; // 0x0029
        Vector4 fakeValue; // 0x002C
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210F450
        void OnAfterDeserialize();  // RVA: 0x210F380
        void .ctor(Vector4 _Value);  // RVA: 0x210F4F0
        Vector4 get_Value();  // RVA: 0x210F5B0
        void set_Value(Vector4 value);  // RVA: 0x2108520
        void Obfuscate(Vector4 _Value);  // RVA: 0x2107F70
        Vector4 UnObfuscate();  // RVA: 0x2108110
        void Obfuscate();  // RVA: 0x210F1F0
        bool CheckIntegrity();  // RVA: 0x210EE50
        void Dispose();  // RVA: 0x2107B30
        Il2CppString* ToString();  // RVA: 0x210F4B0
        int32_t GetHashCode();  // RVA: 0x210F160
        void Serialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _ObfuscatedValueZ, uint32_t _ObfuscatedValueW, uint32_t _Secret);  // RVA: 0x210F480
        void Deserialize(uint32_t _ObfuscatedValueX, uint32_t _ObfuscatedValueY, uint32_t _ObfuscatedValueZ, uint32_t _ObfuscatedValueW, uint32_t _Secret);  // RVA: 0x210EEE0
        static ProtectedVector4 op_Implicit(Vector4 _Value);  // RVA: 0x210F7D0
        static Vector4 op_Implicit(ProtectedVector4 _Value);  // RVA: 0x210F810
        static ProtectedQuaternion op_Implicit(ProtectedVector4 _Value);  // RVA: 0x210F840
        static ProtectedVector4 op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210F910
        static bool op_Equality(ProtectedVector4 v1, ProtectedVector4 v2);  // RVA: 0x210F730
        static bool op_Inequality(ProtectedVector4 v1, ProtectedVector4 v2);  // RVA: 0x210F9E0
        bool Equals(Il2CppObject* obj);  // RVA: 0x210EF60
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ProtectedVector4Int
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        bool isInitialized; // 0x0010
        bool <HasIntegrity>k__BackingField; // 0x0011
        uint8_t pad_0012[0x2]; // 0x0012
        int32_t obfuscatedValueX; // 0x0014
        uint8_t pad_0015[0x3]; // 0x0015
        int32_t obfuscatedValueY; // 0x0018
        uint8_t pad_0019[0x3]; // 0x0019
        int32_t obfuscatedValueZ; // 0x001C
        uint8_t pad_001D[0x3]; // 0x001D
        int32_t obfuscatedValueW; // 0x0020
        uint8_t pad_0021[0x3]; // 0x0021
        int32_t secret; // 0x0024
        uint8_t pad_0025[0x3]; // 0x0025
        Vector4 fakeValue; // 0x0028
    
        // Methods
        bool get_HasIntegrity();  // RVA: 0x158B450
        void set_HasIntegrity(bool value);  // RVA: 0x20F96D0
        void OnBeforeSerialize();  // RVA: 0x210E650
        void OnAfterDeserialize();  // RVA: 0x210E590
        void .ctor(Vector4 _Value);  // RVA: 0x210E710
        Vector4 get_Value();  // RVA: 0x210E7C0
        void set_Value(Vector4 value);  // RVA: 0x210ED70
        void Obfuscate(Vector4 _Value);  // RVA: 0x210E550
        Vector4 UnObfuscate();  // RVA: 0x210E6C0
        void Obfuscate();  // RVA: 0x210E3D0
        bool CheckIntegrity();  // RVA: 0x210E0B0
        void Dispose();  // RVA: 0x210D3D0
        Il2CppString* ToString();  // RVA: 0x210E680
        int32_t GetHashCode();  // RVA: 0x210E340
        static ProtectedVector4Int op_Implicit(Vector4 _Value);  // RVA: 0x210EC10
        static Vector4 op_Implicit(ProtectedVector4Int _Value);  // RVA: 0x210EBE0
        static ProtectedQuaternion op_Implicit(ProtectedVector4Int _Value);  // RVA: 0x210EB10
        static ProtectedVector4Int op_Implicit(ProtectedQuaternion _Value);  // RVA: 0x210E9E0
        static bool op_Equality(ProtectedVector4Int v1, ProtectedVector4Int v2);  // RVA: 0x210E940
        static bool op_Inequality(ProtectedVector4Int v1, ProtectedVector4Int v2);  // RVA: 0x210ECD0
        bool Equals(Il2CppObject* obj);  // RVA: 0x210E150
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct UIntFloat
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        float floatValue; // 0x0010
        uint32_t intValue; // 0x0010
    };

    // Namespace: GUPS.AntiCheat.Protected
    struct ULongDouble
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        double doubleValue; // 0x0010
        uint64_t longValue; // 0x0010
    };

} // namespace GUPS.AntiCheat.Protected

namespace GUPS.AntiCheat.Protected.Time
{

    // Namespace: GUPS.AntiCheat.Protected.Time
    class ProtectedTime
    {
    public:
        // Static fields
        // static GameTimeCheatingDetector* gameTimeCheatingDetector;
        // static DeviceTimeCheatingDetector* deviceTimeCheatingDetector;
    
    
        // Methods
        static float get_deltaTime();  // RVA: 0x2109430
        static float get_unscaledDeltaTime();  // RVA: 0x21099F0
        static float get_timeScale();  // RVA: 0x20FBFC0
        static void set_timeScale(float value);  // RVA: 0x2109CD0
        static float get_time();  // RVA: 0x2109880
        static float get_unscaledTime();  // RVA: 0x2109B60
        static float get_timeSinceLevelLoad();  // RVA: 0x2109710
        static float get_realtimeSinceStartup();  // RVA: 0x21095A0
        static DateTime get_UtcNow();  // RVA: 0x21092B0
        void .ctor();  // RVA: 0x427B90
    };

} // namespace GUPS.AntiCheat.Protected.Time

namespace GUPS.AntiCheat.Protected.Prefs
{

    // Namespace: GUPS.AntiCheat.Protected.Prefs
    struct EPlayerPrefsType
    {
    public:
        // Static fields
        // static EPlayerPrefsType UNKNOWN;
        // static EPlayerPrefsType BOOL;
        // static EPlayerPrefsType INT;
        // static EPlayerPrefsType FLOAT;
        // static EPlayerPrefsType STRING;
        // static EPlayerPrefsType VECTOR2;
        // static EPlayerPrefsType VECTOR3;
        // static EPlayerPrefsType VECTOR4;
        // static EPlayerPrefsType QUATERNION;
    
        uint8_t pad_0000[0x10]; // 0x0000
        uint8_t value__; // 0x0010
    };

    // Namespace: GUPS.AntiCheat.Protected.Prefs
    class IProtectedPref`1
    {
    public:
    
        // Methods
        Il2CppString* get_Key();  // RVA: 0x26EAF0
        T get_Value();  // RVA: 0x3506D0
        void set_Value(T value);  // RVA: 0x3506D0
    };

    // Namespace: GUPS.AntiCheat.Protected.Prefs
    class ProtectedBoolPref
    {
    public:
        uint8_t pad_0000[0x10]; // 0x0000
        Il2CppString* key; // 0x0010
        uint8_t pad_0011[0x7]; // 0x0011
        bool defaultValue; // 0x0018
    
        // Methods
        Il2CppString* get_Key();  // RVA: 0x20FCD70
        bool get_Value();  // RVA: 0x20FCD80
        void set_Value(bool value);  // RVA: 0x20FCD90
        void .ctor();  // RVA: 0x427B90
    };

} // namespace GUPS.AntiCheat.Protected.Prefs

// Namespace: <global>
struct DataStruct
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    EPlayerPrefsType <PlayerPrefsType>k__BackingField; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppString* <Key>k__BackingField; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Il2CppString* <Value>k__BackingField; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* <Hash>k__BackingField; // 0x0028

    // Methods
    EPlayerPrefsType get_PlayerPrefsType();  // RVA: 0x1592280
    Il2CppString* get_Key();  // RVA: 0x7F8900
    Il2CppString* get_Value();  // RVA: 0x42A330
    Il2CppString* get_Hash();  // RVA: 0x42A480
    void .ctor(EPlayerPrefsType _PlayerPrefsType, Il2CppString* _Key, Il2CppString* _Value, Il2CppString* _Hash);  // RVA: 0x20FA690
};

namespace GUPS.AntiCheat.Protected.Prefs
{

    // Namespace: GUPS.AntiCheat.Protected.Prefs
    class ProtectedFileBasedPlayerPrefs
    {
    public:
        // Static fields
        // static Il2CppString* <FilePath>k__BackingField;
        // static Il2CppObject* lockHandle;
        // static System.Collections.Generic.Dictionary<System.String,GUPS.AntiCheat.Protected.Prefs.ProtectedFileBasedPlayerPrefs.
    
        // Methods
        static Il2CppString* get_FilePath();  // RVA: 0x2103F60
        static void set_FilePath(Il2CppString* value);  // RVA: 0x2103FB0
        static bool HasKey(Il2CppString* _Key);  // RVA: 0x2101A20
        static void SetInt(Il2CppString* _Key, int32_t _Value);  // RVA: 0x2102D30
        static int32_t GetInt(Il2CppString* _Key, int32_t _DefaultValue);  // RVA: 0x2100590
        static int32_t GetInt(Il2CppString* _Key);  // RVA: 0x2100540
        static void SetFloat(Il2CppString* _Key, float _Value);  // RVA: 0x2102AF0
        static float GetFloat(Il2CppString* _Key, float _DefaultValue);  // RVA: 0x21001D0
        static float GetFloat(Il2CppString* _Key);  // RVA: 0x21004F0
        static void SetString(Il2CppString* _Key, Il2CppString* _Value);  // RVA: 0x2102FD0
        static Il2CppString* GetString(Il2CppString* _Key, Il2CppString* _DefaultValue);  // RVA: 0x2100970
        static Il2CppString* GetString(Il2CppString* _Key);  // RVA: 0x2100C70
        static void SetBool(Il2CppString* _Key, bool _Value);  // RVA: 0x21028B0
        static bool GetBool(Il2CppString* _Key, bool _DefaultValue);  // RVA: 0x20FFDC0
        static bool GetBool(Il2CppString* _Key);  // RVA: 0x2100180
        static void SetVector2(Il2CppString* _Key, Vector2 _Value);  // RVA: 0x2103240
        static Vector2 GetVector2(Il2CppString* _Key, Vector2 _DefaultValue);  // RVA: 0x2100CD0
        static Vector2 GetVector2(Il2CppString* _Key);  // RVA: 0x2101030
        static void SetVector3(Il2CppString* _Key, Vector3 _Value);  // RVA: 0x21034B0
        static Vector3 GetVector3(Il2CppString* _Key, Vector3 _DefaultValue);  // RVA: 0x21010D0
        static Vector3 GetVector3(Il2CppString* _Key);  // RVA: 0x21014A0
        static void SetVector4(Il2CppString* _Key, Vector4 _Value);  // RVA: 0x2103810
